script_name("{0d00ff}Ar{2900ff}iz{3900ff}on{4500ff}a H{4f00ff}el{5800ff}pe{6000ff}r")
local script_names = "Arizona Helper (L)"

script_version('4.882')
script_author("metk1u")

local model_name =
{
	[323] = "Дилдо на спину #3",
	[348] = "Desert Eagle",
	[355] = "АК-47 на спину",
	[356] = "M4 на спину",
	[371] = "Рюкзак (парашют)",
	[2045] = "Бита с гвоздями",
	[2061] = "Патрон на грудь",
	[2226] = "Бумбокс",
	[2429] = "Реактивный ранец",
	[2469] = "Самолётик на спину",
	[2590] = "Коса на спину",
	[2690] = "Огнетушитель на спину",
	[2782] = "Устрица на спину & Раптор",
	[2908] = "Голова зомби",
	[2918] = "Рюкзак с шипами",
	[3273] = "Ранец охотники на приведений",
	[16368] = "Красная шляпа",
	[18632] = "Рыболовная удочка на спину",
	[18635] = "Молоток на спину",
	[18636] = "Кепка Police",
	[18638] = "Каска строителя",
	[18640] = "Борода 1",
	[18645] = "Мотошлем",
	[18782] = "Шапка из печенья & Печенька",
	[18890] = "Грабли на спину",
	[18906] = "Бандана на голову",
	[18911] = "Бандана",
	[18921] = "Берет",
	[18926] = "Кепка передняя",
	[18952] = "Шлем для бокса",
	[18953] = "Тёплая Шапка",
	[18955] = "Кепка обратная",
	[18963] = "Маска CJ",
	[18964] = "Бандитская шапка",
	[18970] = "Шляпа",
	[19036] = "Хоккейная маска",
	[19039] = "Часы",
	[19054] = "Подарок на спину",
	[19064] = "Новогодняя шапка",
	[19085] = "Повязка на глаз",
	[19086] = "Улучшенное дилдо",
	[19093] = "Кепка DUDE",
	[19095] = "Ковбойская шляпа",
	[19101] = "Каска",
	[19136] = "Шляпа с дредами",
	[19137] = "Голова петуха",
	[19142] = "Бронежилет",
	[19274] = "Парик (1) & Борода (ораньжевая)",
	[19330] = "Каска пожарного (жёлтая) & Женская шляпка",
	[19349] = "Монокль",
	[19350] = "Усы (короткие)",
	[19351] = "Усы (длинные) & Хвост на голове",
	[19352] = "Чёрный конус",
	[19469] = "Повязка на шею",
	[19472] = "Респиратор",
	[19517] = "Борода #1",
	[19519] = "Парик (3)",
	[19520] = "Фуражка офицера",
	[19554] = "Шапка баллас",
	[19557] = "Маска Зорро",
	[19558] = "Кепка (развозчика пиццы)",
	[19581] = "Сковородка на спину",
	[19591] = "Китайский веер",
	[19621] = "Канистра на правое бедро",
	[19627] = "Гаечный ключ на грудь",
	[19904] = "Жилет грузчика"
};
local model_name_anti_stealer = -- http://киберпро.рф/repeat_search/ https://items.shinoa.tech/items.php
{
	-- [19331] = "Тёмный плащ",
	-- [19348] = "С модификации Купидон & Посох бирюзовый & Посох красный",
	[0] = "None",
	[19998] = "Кейс в руке",
	[321] = "Дилдо на спину #1",
	[322] = "Дилдо на спину #2",
	[324] = "Рюкзак мотор",
	[326] = "Трость на спину",
	[333] = "Клюшка на спину & Хоккейная клюшка за спиной & Клюшка в руку",
	[335] = "Нож с модификации Псих",
	[336] = "Бита на спину",
	[337] = "Лопата на спину",
	[338] = "Кий на спину",
	[339] = "Катана на спину",
	[341] = "Бензопила на спину",
	[361] = "Огнемёт на спину",
	[362] = "Миниган на спину",
	[363] = "Портфель террориста",
	[364] = "Пульт от бомбы",
	[367] = "Пушка за спиной",
	[368] = "Прибор ночного видения",
	[370] = "Базука & Необычный реактивный ранец",
	[635] = "Плащ с модификации Смерть",
	[636] = "Плащ с модификации Тыква",
	[806] = "Трава какая-то",
	[815] = "С модификации Demon",
	[881] = "Ёлка",
	[888] = "Язык Венома",
	[891] = "С модификации Костюм для хэллоуина",
	[928] = "Корона BomjGang",
	[953] = "Крылья ангела",
	[954] = "Рога оленя и Лук Купидона",
	[1007] = "С модификации Волшебник",
	[1010] = "С модификации Человек в хим. защите",
	[1013] = "Ушки бэтмена",
	[1017] = "С модификации Волшебник",
	[1019] = "Очки с модификации Бешенный доктор",
	[1090] = "Порог в руку (СТО)",
	[1098] = "Рюкзак Колесо",
	[1108] = "Кусок косы с модификации Смерть",
	[1111] = "С модификации Спарта",
	[1112] = "Щиток на левое плечо",
	[1114] = "Очки сварщика",
	[1115] = "Железная маска",
	[1116] = "Маска решетка",
	[1128] = "Маска для сварки",
	[1133] = "Меч с модификации Djey",
	[1141] = "Бампер в руку (СТО)",
	[1157] = "Бампер в руку (СТО)",
	[1177] = "Реактивный ранец (1)",
	[1182] = "Железная маска 3",
	[1186] = "Рюкзак трансформер",
	[1208] = "INVALID_OBJECT_ID",
	[1212] = "Пачка денег на спину & Рюкзак бакс",
	[1220] = "Коробка в руку",
	[1221] = "INVALID_OBJECT_ID",
	[1228] = "Карамельный посох",
	[1238] = "Колпак тёмного эльфа",
	[1239] = "Знак INFO",
	[1240] = "Сердца",
	[1242] = "Необычный рюкзак",
	[1243] = "Боеголовка",
	[1247] = "Знак звезды",
	[1248] = "Значок GTA III",
	[1253] = "Значок стримера",
	[1254] = "Череп на грудь",
	[1265] = "Мешок с мусором в руку",
	[1269] = "Кувалда",
	[1270] = "Красный рюкзак",
	[1272] = "Значок синего домика",
	[1273] = "Значок зелёного домика",
	[1274] = "Доллар на грудь",
	[1275] = "Рубашка на грудь",
	[1276] = "Сувенир на спину",
	[1277] = "Синий кейс",
	[1279] = "INVALID_OBJECT_ID",
	[1314] = "Дружеский знак",
	[1316] = "С модификации Охранник из Игры в Кальмара",
	[1319] = "Жезл ГАИ",
	[1327] = "Походный рюкзак",
	[1332] = "Сумка доставщика",
	[1336] = "Рюкзак доставки",
	[1360] = "Переносной сад",
	[1366] = "Щит",
	[1369] = "Капсула",
	[1371] = "Рюкзак Бегемот & Шапка бегемот",
	[1387] = "Крюк пирата",
	[1487] = "Бутылка на спину",
	[1488] = "Рюкзак разлив №1",
	[1511] = "Рюкзак разлив №2",
	[1548] = "Золотые погоны",
	[1550] = "Мешок денег на спину",
	[1562] = "Белый рюкзак",
	[1565] = "Корона (1)",
	[1570] = "Рюкзак для ларьков",
	[1575] = "Белый пакет с наркотиками на спину",
	[1582] = "Пицца",
	[1583] = "Рюкзак с мужиком",
	[1584] = "Девушка с пистолетом",
	[1585] = "Рюкзак с девушкой 2",
	[1588] = "Голова мишени",
	[1601] = "Молнии Зевса",
	[1602] = "Призрачный нимб, щит, ледяное копье",
	[1603] = "Кровавая накидка & Золотая шапка & Огненный щит",
	[1604] = "Копьё Зевса",
	[1607] = "Дельфин",
	[1609] = "Черепаха на спину",
	[1614] = "Треугольник",
	[1622] = "Камера на плечо",
	[1636] = "С модификации Химик",
	[1654] = "Красный будильник",
	[1681] = "Самолёт за спиной (Шамал)",
	[1707] = "Красный рюкзак",
	[1736] = "Голова оленя & Рюкзак олень",
	[1808] = "Рюкзак с окном",
	[1841] = "INVALID_OBJECT_ID",
	[1851] = "Кубик в руку",
	[1877] = "Меч красный",
	[1878] = "Меч ораньжевый",
	[1879] = "Меч зелёный",
	[1880] = "Меч синий",
	[1881] = "Меч розовый",
	[1882] = "Меч фиолетовый",
	[1885] = "Корзины за спиной",
	[1886] = "Маска робота (1)",
	[1895] = "Золотая шляпа с шипами",
	[1944] = "С модификации Спанч Боб",
	[1946] = "Мяч на ноге",
	[1954] = "Рюкзак космонавта",
	[1974] = "С модификации Тедди",
	[2006] = "С модификации Химик",
	[2028] = "INVALID_OBJECT_ID",
	[2036] = "Ускоритель",
	[2044] = "Механизм за спиной",
	[2053] = "Снаряжение солдата & Снаряжение полицейского",
	[2060] = "Мешок грузчиков",
	[2064] = "Крылья зелёные",
	[2072] = "Сферы",
	[2096] = "Снежные сани 3",
	[2098] = "Адский лук",
	[2102] = "Колонка на спину",
	[2168] = "Рюкзак красный волнистый",
	[2186] = "Техно рюкзак",
	[2224] = "Карамельная бита",
	[2226] = "Бумбокс",
	[2237] = "С модификации Спарта",
	[2238] = "Шляпа с красными каплями",
	[2250] = "Цветок",
	[2253] = "Рюкзак с цветком",
	[2276] = "INVALID_OBJECT_ID",
	[2332] = "Коробка какая-то",
	[2345] = "Плащ из листьев",
	[2351] = "Зажигалка",
	[2362] = "Переносная лавка",
	[2384] = "Одежда в руки",
	[2396] = "Дьявольские копья",
	[2404] = "Доска для серфинга (1)",
	[2405] = "Доска для серфинга (2)",
	[2406] = "Доска для серфинга (3) & Рубиновый меч",
	[2429] = "Реактивный ранец (3)",
	[2511] = "Аэроплан 2",
	[2512] = "Аэроплан 1",
	[2594] = "Необычный рюкзак",
	[2595] = "INVALID_OBJECT_ID",
	[2614] = "Два флага на спине",
	[2630] = "Велосипед в руку",
	[2680] = "С модификации Байкер",
	[2689] = "С модификации Тедди",
	[2703] = "Рюкзак-бургер",
	[2707] = "Рюкзак со светом",
	[2710] = "Синий рюкзак 2",
	[2711] = "С модификации Робот & Рюкзак (Кибер)",
	[2712] = "Метла на спину",
	[2714] = "Табличка 'OPEN' на спину",
	[2723] = "Переноска дров",
	[2726] = "С модификации Спарта",
	[2764] = "Рюкзак в клеточку",
	[2769] = "С модификации Зомби & Шаурма на спину",
	[2788] = "С модификации Гринч",
	[2803] = "Мешок с подарками",
	[2804] = "Кусок мяса в руку & Сет:Петух",
	[2805] = "Мешок с мясом",
	[2810] = "Человечек на спину",
	[2814] = "Пицца & Сумка доставщика",
	[2846] = "Одежда в руках",
	[2855] = "Рюкзак-журнальный",
	[2887] = "Чёрный рюкзак",
	[2888] = "Маска робота (2)",
	[2899] = "Ледяное копьё",
	[2901] = "Рюкзак из травы",
	[2905] = "Модификация: Бешенный доктор",
	[2907] = "Модификация: Хэдкраб из Half-Life",
	[2913] = "Штанга в руку",
	[2916] = "Модификация: Качок",
	[2928] = "Железный ящик",
	[2961] = "Красный ящик 3",
	[2968] = "Рюкзак BomjGang",
	[2976] = "Реактивный ранец (4)",
	[2977] = "Рюкзак",
	[2978] = "Щит с шипами",
	[2983] = "Штурвал за спиной",
	[2985] = "Экзоскилет",
	[2988] = "Сундук за спиной",
	[2992] = "Нимб с какой-то модификации",
	[3013] = "Ящик за спиной",
	[3014] = "INVALID_OBJECT_ID",
	[3016] = "Ядерный рюкзак",
	[3026] = "Рюкзак",
	[3027] = "Косяк",
	[3031] = "Ранец вертолёт",
	[3052] = "Коробка в руку",
	[3056] = "Магнит на спину & Инопланетная пушка",
	[3070] = "Реактивный ранец (5) & Скайборд & Маска робота - чёрная & Пушка на руке",
	[3072] = "Гантеля",
	[3096] = "Синий посох светлый",
	[3100] = "С модификации Соник",
	[3261] = "С модификации Снаряжение полицейского",
	[3272] = "Паук на спину",
	[3273] = "Ранец охотники на приведений",
	[3383] = "Усы таракана",
	[3385] = "Рюкзак будущего",
	[3425] = "Установка за спиной",
	[3426] = "Установка за спиной (2)",
	[3433] = "Зелёный рюкзак",
	[3434] = "Рюкзак пират",
	[3440] = "Очки переливающиеся",
	[3497] = "Садок",
	[3524] = "Левая горящая голова & Правая горящая голова & Рюкзак-череп",
	[3632] = "Бочка в руку",
	[3643] = "Рюкзак стимпанк",
	[3658] = "Гармошка",
	[3785] = "Светящийся рюкзак",
	[3801] = "Длинный топор & Кислородный баллон & Локатор",
	[3877] = "Капусла большая & дубина",
	[3932] = "С модификации PUBG",
	[5381] = "CUSTOM: Часы 'Rolex Submariner'",
	[5382] = "CUSTOM: Часы 'Gucci'",
	[5383] = "CUSTOM: Часы 'Panthere de Cartier'",
	[5384] = "CUSTOM: Часы 'Relogios Casio'",
	[5385] = "CUSTOM: Часы 'Casio G-SHOCK'",
	[5386] = "CUSTOM: Часы 'Patek Philippe Nautilus'",
	[5387] = "CUSTOM: Часы 'Apple Watch'",
	[5388] = "CUSTOM: Наушники 'beats by Dre'",
	[5389] = "CUSTOM: Наушники 'Harman/Kardon'",
	[5683] = "CUSTOM: Наушники 'Razer'",
	[5684] = "CUSTOM: Наушники 'AirPods Max'",
	[5685] = "CUSTOM: Кепка 'Tommy Hilfiger'",
	[5686] = "CUSTOM: Кепка 'Ralph Lauren'",
	[5687] = "CUSTOM: Кепка 'LA'",
	[5688] = "CUSTOM: Кепка 'Gucci'",
	[5689] = "CUSTOM: Кепка 'Supreme'",
	[5690] = "CUSTOM: Неоновая маска",
	[5691] = "CUSTOM: Маска 'Scary'",
	[5692] = "CUSTOM: Маска 'Wrench'",
	[5693] = "CUSTOM: Маска Локи",
	[5694] = "CUSTOM: Маска 'Rust'",
	[5695] = "CUSTOM: Мотошлем 'Kitty'",
	[5696] = "CUSTOM: Мотошлем 'Pink'",
	[5697] = "CUSTOM: Мотошлем",
	[5698] = "CUSTOM: Мотошлем 'Alien'",
	[5699] = "CUSTOM: Эксклюзивная шляпа 1",
	[5700] = "CUSTOM: Эксклюзивная шляпа 2",
	[5701] = "CUSTOM: Эксклюзивная шляпа 3",
	[5702] = "CUSTOM: Эксклюзивная шляпа 4",
	[6011] = "CUSTOM: Эксклюзивная шляпа 5",
	[6012] = "CUSTOM: Велосипед на спину",
	[6013] = "CUSTOM: Дельтаплан на спину",
	[6254] = "CUSTOM: Нарукавник на правую руку",
	[6258] = "CUSTOM: Нарукавник на левую руку",
	[6259] = "CUSTOM: Доспех на правую руку",
	[6260] = "CUSTOM: Доспех на левую руку",
	[6261] = "CUSTOM: Гарпун",
	[6262] = "CUSTOM: Рюкзак рыбака",
	[6263] = "CUSTOM: Золотой меч",
	[6264] = "CUSTOM: Брош на шею",
	[6265] = "CUSTOM: Спасательный жилет[4288]",
	[6266] = "CUSTOM: Пояс рыбака",
	[6267] = "CUSTOM: Маска дайвера",
	[6268] = "CUSTOM: Кепка пирата",
	[6268] = "CUSTOM: Кепка пирата",
	[6269] = "CUSTOM: Плащ пирата",
	[6269] = "CUSTOM: Плащ пирата",
	[6270] = "CUSTOM: Щит легиона",
	[6271] = "CUSTOM: Маска пирата",
	[6271] = "CUSTOM: Маска пирата",
	[6272] = "CUSTOM: Рюкзак пирата",
	[6273] = "CUSTOM: Грави-пушка",
	[6274] = "CUSTOM: Очки с Half-Life",
	[6275] = "CUSTOM: Оружие с Half-Life",
	[6276] = "CUSTOM: Шлем археолога",
	[6277] = "CUSTOM: Прототип",
	[6278] = "CUSTOM: Рюкзак доставщика",
	[6279] = "CUSTOM: Магичесий топор",
	[6865] = "Маска с рогами & Рюкзак (Череп с рогами)",
	[7093] = "Сердечко Erotic",
	[7313] = "Ранец радио & Кейс анимированный 2 & Очки анимированые",
	[7392] = "Девушка на спину & Рюкзак-девушка",
	[7891] = "Лист металла в руку",
	[8483] = "Маска череп",
	[8492] = "Крылья & Красная накидка & Красный воротник",
	[8493] = "Пиратский корабль на спину",
	[8548] = "С модификации Зомби",
	[8644] = "Два кинжала на спину",
	[9584] = "Рюкзак пароход",
	[9833] = "Реактивный водный ранец",
	[9958] = "Радиорюкзак & Субмарина",
	[10145] = "Шляпа из будущего",
	[10281] = "Машина из стены",
	[10757] = "Самолёт за спиной",
	[11417] = "Портативная АЗС",
	[11489] = "Крылья гаргульи",
	[11700] = "Щит знак радиация",
	[11704] = "Маска демона",
	[11705] = "Кейс для оружия",
	[11712] = "Крест на грудь и Распятие",
	[11713] = "Рюкзак пожарного",
	[11716] = "С модификации Палач",
	[11722] = "С модификации Супер-Эльфа",
	[11726] = "Золотой посох",
	[11727] = "Очки будущего 2 & Кристальный рюкзак",
	[11731] = "С модификации Негр",
	[11732] = "Маска лицо в сердечке",
	[11733] = "Снежные сани 2 & Рюкзак конь",
	[11734] = "Сани на спину",
	[11736] = "Медицинская маска & Рюкзак медика зелёный",
	[11738] = "Рюкзак медика красный",
	[11740] = "Модификация: Блин",
	[11741] = "С модификации Ghost",
	[11743] = "INVALID_OBJECT_ID",
	[11747] = "С модификации Индеец",
	[11749] = "Подводная маска",
	[11750] = "VR-очки",
	[12598] = "CUSTOM: Каска #1",
	[12599] = "CUSTOM: Рюкзак #1",
	[12600] = "CUSTOM: Бронежилет #1",
	[12606] = "CUSTOM: Раскраска на оружие Deagle (2)",
	[12607] = "CUSTOM: Раскраска на оружие Deagle (3)",
	[12613] = "CUSTOM: Рюкзак #2",
	[12614] = "CUSTOM: Рюкзак #3",
	[12615] = "CUSTOM: Рюкзак #4",
	[12616] = "CUSTOM: Рюкзак #5",
	[12617] = "CUSTOM: Каска #2",
	[12618] = "CUSTOM: Каска #3",
	[12619] = "CUSTOM: Каска #4",
	[12620] = "CUSTOM: Каска #5",
	[12621] = "CUSTOM: Бронежилет #2",
	[12622] = "CUSTOM: Бронежилет #3",
	[12623] = "CUSTOM: Бронежилет #4",
	[12624] = "CUSTOM: Бронежилет #5",
	[12634] = "CUSTOM: Рюкзак 'Крипер'",
	[12635] = "CUSTOM: Рюкзак альпиниста",
	[12636] = "CUSTOM: Шлем Тора",
	[12637] = "CUSTOM: Футбольный шлем",
	[12638] = "CUSTOM: Шлем 'Daft Punk'",
	[12639] = "CUSTOM: Шлем 'Стив'",
	[12640] = "CUSTOM: Шлем 'Гомер'",
	[12641] = "CUSTOM: Маска распорядителя",
	[12642] = "CUSTOM: Маска охранника 1",
	[12643] = "CUSTOM: Маска охранника 3",
	[12644] = "CUSTOM: Маска охранника 2",
	[12645] = "CUSTOM: VIP маска 'Бык'",
	[12646] = "CUSTOM: АлмаЗная кирка",
	[12647] = "CUSTOM: Крылья #1",
	[12648] = "CUSTOM: Крылья #2",
	[12649] = "CUSTOM: Крылья #3",
	[12650] = "CUSTOM: Крылья #4",
	[12651] = "CUSTOM: Крылья #5",
	[12652] = "CUSTOM: Супер-кирка",
	[12653] = "CUSTOM: Супер-грабли",
	[12654] = "CUSTOM: Посох Деда Мороза",
	[12655] = "CUSTOM: Кокошник Снегурочки",
	[12656] = "CUSTOM: Шапка с ёлкой на пружине",
	[12657] = "CUSTOM: Маска Гринча",
	[12658] = "CUSTOM: Наряженная ёлка на спине",
	[12659] = "CUSTOM: Крылья #6",
	[12660] = "CUSTOM: Шапка Верки Сердючки",
	[12661] = "CUSTOM: Подарочный бант на спине",
	[12662] = "CUSTOM: Голова Пряни",
	[12663] = "CUSTOM: Голова Тигра",
	[12664] = "CUSTOM: Бронежилет #6",
	[12665] = "CUSTOM: Крылья #7",
	[12666] = "CUSTOM: Крылья #8",
	[12667] = "CUSTOM: Посох Снежной Королевы",
	[12668] = "CUSTOM: Бронежилет #7",
	[12669] = "CUSTOM: Бронежилет #8",
	[12672] = "CUSTOM: Бронежилет желеЗного человека",
	[12673] = "CUSTOM: Русский боевой топор",
	[12674] = "CUSTOM: Рюкзак Louis Vuitton",
	[12675] = "CUSTOM: Плащ Бэтмана",
	[12676] = "CUSTOM: Рука бесконечности",
	[12677] = "CUSTOM: Рука Халка",
	[12678] = "CUSTOM: Молот Тора",
	[12679] = "CUSTOM: Шлем железного человека",
	[12680] = "CUSTOM: Шлем Мистерио",
	[12681] = "CUSTOM: Хук Пуджа",
	[12682] = "CUSTOM: Меч 'Звёздные войны'",
	[12683] = "CUSTOM: Маска Халка",
	[12684] = "CUSTOM: Щит Капитана Америки",
	[12685] = "CUSTOM: Красный сноуборд",
	[12686] = "CUSTOM: Пятизубец",
	[12687] = "CUSTOM: Серебряный крюк",
	[12688] = "CUSTOM: Посох льда",
	[12689] = "CUSTOM: Рюкзак Черепашки-ниндЗя",
	[12690] = "CUSTOM: Голова LEGO",
	[12691] = "CUSTOM: Голова 'Тише едешь, дальше будешь'",
	[12692] = "CUSTOM: Голова Робокоп",
	[12693] = "CUSTOM: Маска Человека-паук",
	[12694] = "CUSTOM: Маска Шрек",
	[12695] = "CUSTOM: Маска из Бумажного дома",
	[12696] = "CUSTOM: Маска Терминатор",
	[12697] = "CUSTOM: Маска Добби",
	[13562] = "Крутящаяся дубина",
	[13667] = "Маска обезьяны",
	[14405] = "Белый двойной рюкзак",
	[14449] = "Лежак на пикник",
	[14467] = "Человечек на плечо",
	[14527] = "Крылья стрекозы",
	[14608] = "Копье бога",
	[14611] = "Корона (2)",
	[14637] = "Два дракона",
	[14781] = "Рюкзак к пикнику",
	[16345] = "Космическая ракета & Щит (2)",
	[16442] = "Рюкзак корова",
	[16776] = "Петух на плечо",
	[16778] = "НЛО",
	[16781] = "Пончик за спиной (с анимацией)",
	[17511] = "Ядерная бомба",
	[18003] = "Оружие & Рюкзак переноска",
	[18633] = "Балонный ключ на спину",
	[18634] = "Лом на спину",
	[18637] = "Щит на спину и в руку",
	[18641] = "Маска фонарь",
	[18642] = "Ранец шокер & Копье-шокер",
	[18643] = "Красная шляпа маяк",
	[18644] = "Отвёртка в руку",
	[18646] = "Глаз терминатора",
	[18688] = "Огонь",
	[18693] = "Огонь",
	[18701] = "Огонь",
	[18717] = "С модификации Волшебник",
	[18718] = "Огонь",
	[18729] = "Огонь",
	[18736] = "Сет:Птенец",
	[18848] = "Военный реактивный ранец",
	[18849] = "Парашют & Сканер с анимацией",
	[18858] = "Реактивный рюкзак",
	[18865] = "Телефон",
	[18866] = "Телефон",
	[18867] = "Телефон",
	[18868] = "Телефон & Черный чемодан",
	[18869] = "Телефон",
	[18870] = "Телефон",
	[18871] = "Телефон",
	[18872] = "Телефон",
	[18873] = "Телефон",
	[18874] = "Телефон",
	[18875] = "ПипБой & Рюкзак техно",
	[18891] = "С модификации",
	[18936] = "С модификации Палач",
	[18947] = "Шляпка (1)",
	[18948] = "Шляпка (2)",
	[18949] = "Шляпка (3)",
	[18950] = "Шляпка (4)",
	[18951] = "Шляпка (5)",
	[18967] = "Панамка (1)",
	[18968] = "Панамка (2)",
	[18969] = "Панамка (3)",
	[18974] = "Маска Чумного Доктора",
	[18976] = "Сумка-барыжка синяя",
	[19006] = "Очки",
	[19007] = "Очки",
	[19008] = "Очки",
	[19009] = "Очки",
	[19010] = "Очки",
	[19011] = "Очки",
	[19012] = "Очки",
	[19013] = "Очки",
	[19014] = "Очки",
	[19015] = "Очки",
	[19016] = "Очки",
	[19017] = "Очки",
	[19018] = "Очки",
	[19019] = "Очки",
	[19020] = "Очки",
	[19021] = "Очки",
	[19022] = "Очки",
	[19023] = "Очки",
	[19024] = "Очки",
	[19025] = "Очки",
	[19026] = "Очки",
	[19027] = "Очки",
	[19028] = "Очки",
	[19029] = "Очки",
	[19030] = "Очки",
	[19031] = "Очки",
	[19032] = "Очки",
	[19033] = "Очки",
	[19034] = "Очки",
	[19035] = "Очки",
	[19054] = "Подарок на спину",
	[19055] = "Подарок на спину",
	[19056] = "Подарок на спину",
	[19057] = "Подарок на спину",
	[19058] = "Подарок на спину",
	[19063] = "С модификации праздник",
	[19067] = "Шапка (1)",
	[19067] = "Шапки",
	[19068] = "Шапка (2)",
	[19069] = "Шапка (3)",
	[19077] = "Борода #2",
	[19078] = "Попугай",
	[19079] = "Попугай на плечо",
	[19080] = "Синяя шляпа маяк",
	[19081] = "Шляпа маяк",
	[19082] = "Шляпа маяк",
	[19083] = "Шляпа маяк",
	[19084] = "Шляпа маяк",
	[19087] = "С модификации праздник",
	[19090] = "Синий берет",
	[19091] = "Красный берет",
	[19092] = "Зелёный берет",
	[19094] = "Гамбургер",
	[19128] = "Кейс анимированный 3",
	[19130] = "Знак на груди",
	[19133] = "Хвост чёрта",
	[19135] = "Стрелка с модификации праздник и Вьетнамская шапка",
	[19141] = "Каска спецназа (черная)",
	[19163] = "С модификации Дарт-вейдер",
	[19173] = "Картина в руку какая-то",
	[19177] = "С модификации Палач",
	[19197] = "Ангельское кольцо на голову",
	[19200] = "С модификации Ghost & Сет:Птенец",
	[19202] = "С модификации Зомби",
	[19280] = "Фонарь на спину",
	[19300] = "INVALID_OBJECT_ID",
	[19314] = "Рога & Уши эльфа",
	[19315] = "Олень на плечо",
	[19317] = "Красная гитара",
	[19318] = "Чёрно-белая гитара",
	[19319] = "Чёрная гитара",
	[19320] = "Тыква на голову",
	[19332] = "Воздушный шар",
	[19333] = "Воздушный шар",
	[19334] = "Воздушный шар",
	[19335] = "Воздушный шар",
	[19336] = "Воздушный шар",
	[19337] = "Воздушный шар",
	[19338] = "Воздушный шар",
	[19339] = "С модификации Негр",
	[19341] = "Яйцо",
	[19342] = "Яйцо",
	[19343] = "Яйцо",
	[19344] = "Яйцо",
	[19345] = "Яйцо",
	[19346] = "Хот-дог на голову",
	[19347] = "Звезда на грудь & Значок шерифа на спине",
	[19348] = "Посох бирюзовый & Посох красный",
	[19421] = "Наушники (1)",
	[19422] = "Наушники (2)",
	[19423] = "Наушники (3)",
	[19424] = "Наушники (4)",
	[19468] = "Ведро в руку",
	[19513] = "Телефон",
	[19514] = "Каска спецназа (белая)",
	[19516] = "С модификации Купидон",
	[19518] = "Парик (2) & Сет:Яйцо",
	[19522] = "Значок красного домика",
	[19523] = "Значок оранжевого домика",
	[19524] = "Значок желтого домика",
	[19525] = "Рюкзак пара",
	[19527] = "Капюшон, Зелёный фонарь, Зелёные погоны, Шапка Британца",
	[19528] = "Шляпа волшебника",
	[19553] = "Фермерская шляпа",
	[19555] = "Боксерские перчатки",
	[19556] = "Боксерские перчатки",
	[19559] = "Походный рюкзак",
	[19570] = "С модификации Гринч",
	[19572] = "НЕИЗВЕСТНО",
	[19573] = "Рюкзак угол",
	[19574] = "Сет:Птенец",
	[19576] = "С модификации Гринч",
	[19577] = "С модификации Дедпул",
	[19578] = "Рюкзак банан & Рюкзак жёлтый & Сумка жёлтая через плечо",
	[19582] = "С модификации Дедпул",
	[19583] = "С модификации Djey",
	[19590] = "Меч на спину",
	[19602] = "Зелёный щит",
	[19617] = "INVALID_OBJECT_ID",
	[19620] = "Полицейский ранец & Палка красно-синяя & Рюкзак полицейский",
	[19623] = "Фотоаппарат на грудь",
	[19624] = "Большой чемодан",
	[19626] = "Лопата в руку (2)",
	[19630] = "Рыба на спину",
	[19631] = "Молот",
	[19632] = "Горящий щит & Горящее копье 1 & Горящий рюкзак",
	[19636] = "Ларек с фруктами",
	[19776] = "Бейдж ФБР",
	[19777] = "Лого ФБР на спине",
	[19793] = "С модификации Палач",
	[19797] = "Погоны красно-синие & 3D-очки & Кейс анимированный 1 & Очки красно-синий неон",
	[19801] = "Маска",
	[19804] = "Замочек на грудь",
	[19806] = "Новогодний реактивный ранец",
	[19807] = "Рюкзак телефон",
	[19813] = "Коричневый рюкзак",
	[19822] = "Щит за спиной",
	[19823] = "Жёлтая бита на спину",
	[19824] = "Бита-бутылка на спину",
	[19828] = "Белый рюкзак",
	[19831] = "Рюкзак с крышкой",
	[19835] = "Кружка кофе",
	[19836] = "С модификации Палач с головой в руке",
	[19840] = "Красный плащ",
	[19847] = "Копченая нога & Кусок телятины",
	[19873] = "Модификация: Блин",
	[19874] = "С модификации Дедпул и Рюкзак бирюзовый",
	[19878] = "Скейт на спину",
	[19893] = "Проектор с картой за спиной",
	[19894] = "INVALID_OBJECT_ID",
	[19900] = "НЕИЗВЕСТНО",
	[19917] = "Техно-рюкзак 3",
	[19921] = "Красная сумка за спиной",
	[19958] = "Щит знак налево",
	[19959] = "Щит знак направо",
	[19960] = "Щит знак левее",
	[19961] = "Щит знак правее",
	[19962] = "Щит знак перекрёсток",
	[19963] = "Щит знак Т-перекрёсток",
	[19964] = "Щит знак светофор",
	[19965] = "Щит знак опасность",
	[19966] = "Щит знак стоп",
	[19967] = "Щит знак кирпич",
	[19973] = "Щит знак старт",
	[19974] = "Щит знак ремонт",
	[19975] = "Щит знак уступи дорогу",
	[19976] = "Щит знак внимание",
	[19993] = "С модификации Спанч Боб",
	[19977] = "Знак (уступи дорогу)"
};
----------------------------------------
local friends =
{
	"Sawa_Seleznev",
	"Denis_Seleznev",
	"Avksentiu_Adaw",
	"Vartan_Germun",
	"Mawka_Dvornyawka",
	"Kristinka_Mandarinka",
	"Crim_Conors",
	"Settar_Halikov",
	"Vivian_Vain",
	"Sam_Mason",
	"Roy_Shelby"
};
----------------------------------------
local _message = {}

function push_message(text, del)
	del = del or 5
	_message[#_message+1] =
	{
		active = false,
		time = 0,
		showtime = del,
		text = text
	}
end
----------------------------------------
local imgui = require('imgui')
require("encoding").default = "CP1251"
u8 = require("encoding").UTF8
local inicfg = require("inicfg")
local sampev = require("samp.events")
local key = require 'vkeys'
require "lib.moonloader"
require "lib.sampfuncs"
local memory = require'memory'
local bit = require('numberlua')
local BitStreamIO = require 'lib.samp.events.bitstream_io'
local ffi = require("ffi")
ffi.cdef[[
	short GetKeyState(int nVirtKey);
	bool GetKeyboardLayoutNameA(char* pwszKLID);
	int GetLocaleInfoA(int Locale, int LCType, char* lpLCData, int cchData);
]]
----------------------------------------
arial_9_5 = renderCreateFont('Arial', 9, 5)
arial_7_5 = renderCreateFont('Arial', 7, 5)
arial_12_5 = renderCreateFont('Arial', 12, 5)
arial_10_13 = renderCreateFont('Arial', 10, 13)
molot_8_5 = renderCreateFont("Molot", 8, 5)
molot_10_9 = renderCreateFont('Molot', 10, 9)
--------------------[ZEKS]--------------------
local autozeks_timer = os.time()+9
--------------------[Продовоз]--------------------
local prodovoz_timer = 0
local prods = 2000
--------------------[NoBalloons]--------------------
local balls = 
{
	[19332] = {3, 3}, 		-- Red
	[19333] = {211, 211}, 	-- Blue
	[19334] = {1, 1}, 		-- White
	[19335] = {152, 6}, 	-- Blue & Yellow
	[19336] = {126, 1}, 	-- Pink & White
	[19337] = {243, 6}, 	-- Green & Yellow
	[19338] = {243, 3}, 	-- Green and Red
}
--------------------[RPC]--------------------
local packet_incoming = 'Waiting for packet!'
local packet_outcoming = 'Waiting for packet!'
local rpc_incoming = 'Waiting for RPC!'
local rpc_outcoming = 'Waiting for RPC!'
--------------------[Дальний чат]--------------------
local chatbuble = {}
--------------------[Эмулятор]--------------------
local list3d = {}
--------------------[Автоввод текста в лавку]--------------------
dialogs_lavka = -1
--------------------[Анализ цен на ЦР]--------------------
local analysis = nil
local last_text = nil
local data_cr = {}
local template = 
{
	last_update = nil,
	sell = {},
	buy = {}
}
----------------------------------------
local path_cr = getWorkingDirectory() .. '\\config\\cr_items.json'
if not doesFileExist(path_cr) then
	data_cr = template
	createDirectory(getWorkingDirectory() .. '\\config\\')
	local file_open_cr = io.open(path_cr, "w")
	file_open_cr:write(encodeJson(data_cr))
	file_open_cr:close()
else
	local file_open_cr = io.open(path_cr, "r")
	data_cr = decodeJson(file_open_cr:read('*a'))
	file_open_cr:close()
end
--------------------[Новый автолут]--------------------
local autoloot_td = {''}
--------------------[BizInfo]--------------------
local biz_listitem = 0
local max_biz = 7
local render_bizinfo = {}
local render_bizinfo_timer = 0
local biz_message_1 = nil
local biz_message_2 = nil
local biz_message_3 = nil
local biz_message_4 = nil
local biz_message_5 = nil
local biz_message_6 = nil
local biz_message_7 = nil
--------------------[rfam]--------------------
local RfamThreadHandler = nil
local RfamEnabled = false
local HideAllTextdraws = false
local RfamFlood = {}
--------------------[AntiFlood]--------------------
local messagesFloodTab = {}
--------------------[Остальное]--------------------
local reconnect_timer = 0
local message_report = ""
local local_name = ""
local carid = -1
local windowstate = imgui.ImBool(false)
local type_window = imgui.ImInt(1)
----------------------------------------
local file_settings = 'settings.ini'
local path = getWorkingDirectory() .. '\\config'
----------------------------------------
local mainIni = inicfg.load(
{
	config =
	{
		renderTime = true,
		killStat = true,
		del_opisanie_3d = true,
		autozeks = false,
		prodovoz_edit = 4500,
		bizinfo_timer = 60,
		convert = 200,
		set_weather = 10,
		set_time = 12,
		theme_colorR = 0.41,
		theme_colorG = 0.19,
		theme_colorB = 0.63,
		theme_colorA = 1.00
	},
	account =
	{
		my_nick = 'Nickname',
		my_password = 'Password',
		my_pincode = '0000',
		my_nick_2 = 'Nickname_2',
		my_password_2 = 'Password_2',
		my_pincode_2 = '0000',
		my_nick_3 = 'Nickname_3',
		my_password_3 = 'Password_3',
		my_pincode_3 = '0000'
	},
	chat =
	{
		chatlog = true,
		----------------------------------------
		removechatspam = true,
		tosampfuncsspam = true,
		----------------------------------------
		tosampfuncsfam = false,
		----------------------------------------
		distant_active = false,
		distant_count = 10,
		antiflood_time = 10
	},
	chest =
	{
		roll_standart = true,
		roll_platinum = true,
		roll_maska = true,
		roll_state = true,
		roll_wait = 10,
	},
	destroy =
	{
		bucket = true,
		tree = true,
		serdce = true,
		xlam = true,
		newyear = true,
	},
	lavka =
	{
		drugs = 0,
		drugs_price = 100,
		----------------------------------------
		materials = 0,
		materials_price = 10,
		----------------------------------------
		fam_talon = 0,
		fam_talon_price = 5000,
		----------------------------------------
		gift = 0,
		gift_price = 4000,
		----------------------------------------
		cooper_roll = 0,
		cooper_roll_price = 6000,
		----------------------------------------
		silver_roll = 0,
		silver_roll_price = 20000,
		----------------------------------------
		gold_roll = 0,
		gold_roll_price = 150000,
		----------------------------------------
		xlopok = 0,
		xlopok_price = 100,
		----------------------------------------
		lens = 0,
		lens_price = 100,
		----------------------------------------
		stone = 0,
		stone_price = 200,
		----------------------------------------
		metal = 0,
		metal_price = 1000,
		----------------------------------------
		bronze = 0,
		bronze_price = 1500,
		----------------------------------------
		silver = 0,
		silver_price = 2000,
		----------------------------------------
		gold = 0,
		gold_price = 5000,
		----------------------------------------
		euro = 0,
		euro_price = 4000,
		----------------------------------------
		gr_talon = 0,
		gr_talon_price = 1000,
		----------------------------------------
		antibiotiki = 0,
		antibiotiki_price = 2000,
		----------------------------------------
		prison = 0,
		prison_price = 35000,
		----------------------------------------
		zlov_moneta = 0,
		zlov_moneta_price = 200000,
		----------------------------------------
		toch_stone = 0,
		toch_stone_price = 20000,
		----------------------------------------
		bilet_6 = 0,
		bilet_6_price = 1000,
		----------------------------------------
		sticker_cluck = 0,
		sticker_cluck_price = 5000,
		----------------------------------------
		sticker_binko = 0,
		sticker_binko_price = 5000,
		----------------------------------------
		sticker_jizzy = 0,
		sticker_jizzy_price = 5000,
		----------------------------------------
		platinum_roll = 0,
		platinum_roll_price = 300000,
		----------------------------------------
		fam_money = 0,
		fam_money_price = 1000,
		----------------------------------------
		smazka = 0,
		smazka_price = 500000,
		----------------------------------------
		oxlajdauka = 0,
		oxlajdauka_price = 300000,
		----------------------------------------
		band_respect = 0,
		band_respect_price = 500,
		----------------------------------------
		AZ_coins = 0,
		AZ_coins_price = 30000,
		----------------------------------------
		Moneta_8_god = 0,
		Moneta_8_god_price = 10000
	},
	autopiar =
	{
		----------------------------------------
		vr_text = '',
		vr_text_2 = '',
		vr_delay = 3,
		vr_active = false,
		----------------------------------------
		fam_text = '',
		fam_text_2 = '',
		fam_delay = 3,
		fam_active = false,
		----------------------------------------
		al_text = '',
		al_text_2 = '',
		al_delay = 3,
		al_active = false
		----------------------------------------
	}
},file_settings)

if not doesDirectoryExist(path) then
	inicfg.save(mainIni,file_settings)
end

local elements =
{
	config =
	{
		renderTime = imgui.ImBool(mainIni.config.renderTime),
		killStat = imgui.ImBool(mainIni.config.killStat),
		del_opisanie_3d = imgui.ImBool(mainIni.config.del_opisanie_3d),
		autozeks = imgui.ImBool(mainIni.config.autozeks),
		prodovoz_edit = imgui.ImInt(mainIni.config.prodovoz_edit),
		bizinfo_timer = imgui.ImInt(mainIni.config.bizinfo_timer),
		convert = imgui.ImInt(mainIni.config.convert),
		attach_id = imgui.ImInt(1001),
		del_stream = imgui.ImBool(false),
		del_shout = imgui.ImBool(false),
		del_stream_pl = imgui.ImBool(false),
		del_stream_veh = imgui.ImBool(false),
		anim_car = imgui.ImBool(false),
		set_weather = imgui.ImInt(mainIni.config.set_weather),
		set_time = imgui.ImInt(mainIni.config.set_time),
		theme_colorR = imgui.ImFloat(mainIni.config.theme_colorR),
		theme_colorG = imgui.ImFloat(mainIni.config.theme_colorG),
		theme_colorB = imgui.ImFloat(mainIni.config.theme_colorB),
		theme_colorA = imgui.ImFloat(mainIni.config.theme_colorA)
	},
	account =
	{
		my_nick = imgui.ImBuffer(tostring(mainIni.account.my_nick), 24),
		my_password = imgui.ImBuffer(tostring(mainIni.account.my_password), 100),
		my_pincode = imgui.ImBuffer(tostring(mainIni.account.my_pincode), 24),
		my_nick_2 = imgui.ImBuffer(tostring(mainIni.account.my_nick_2), 24),
		my_password_2 = imgui.ImBuffer(tostring(mainIni.account.my_password_2), 100),
		my_pincode_2 = imgui.ImBuffer(tostring(mainIni.account.my_pincode_2), 24),
		my_nick_3 = imgui.ImBuffer(tostring(mainIni.account.my_nick_3), 24),
		my_password_3 = imgui.ImBuffer(tostring(mainIni.account.my_password_3), 100),
		my_pincode_3 = imgui.ImBuffer(tostring(mainIni.account.my_pincode_3), 24)
	},
	chat =
	{
		chatlog = imgui.ImBool(mainIni.chat.chatlog),
		----------------------------------------
		removechatspam = imgui.ImBool(mainIni.chat.removechatspam),
		tosampfuncsspam = imgui.ImBool(mainIni.chat.tosampfuncsspam),
		----------------------------------------
		tosampfuncsfam = imgui.ImBool(mainIni.chat.tosampfuncsfam),
		----------------------------------------
		distant_active = imgui.ImBool(mainIni.chat.distant_active),
		distant_count = imgui.ImInt(mainIni.chat.distant_count),
		antiflood_time = imgui.ImInt(mainIni.chat.antiflood_time)
	},
	chest =
	{
		roll_standart = imgui.ImBool(mainIni.chest.roll_standart),
		roll_platinum = imgui.ImBool(mainIni.chest.roll_platinum),
		roll_maska = imgui.ImBool(mainIni.chest.roll_maska),
		roll_state = imgui.ImBool(mainIni.chest.roll_state),
		roll_wait = imgui.ImInt(mainIni.chest.roll_wait),
	},
	destroy =
	{
		bucket = imgui.ImBool(mainIni.destroy.bucket),
		tree = imgui.ImBool(mainIni.destroy.tree),
		serdce = imgui.ImBool(mainIni.destroy.serdce),
		xlam = imgui.ImBool(mainIni.destroy.xlam),
		newyear = imgui.ImBool(mainIni.destroy.newyear)
	},
	lavka =
	{
		drugs = imgui.ImInt(mainIni.lavka.drugs),
		drugs_price = imgui.ImInt(mainIni.lavka.drugs_price),
		----------------------------------------
		materials = imgui.ImInt(mainIni.lavka.materials),
		materials_price = imgui.ImInt(mainIni.lavka.materials_price),
		----------------------------------------
		fam_talon = imgui.ImInt(mainIni.lavka.fam_talon),
		fam_talon_price = imgui.ImInt(mainIni.lavka.fam_talon_price),
		----------------------------------------
		gift = imgui.ImInt(mainIni.lavka.gift),
		gift_price = imgui.ImInt(mainIni.lavka.gift_price),
		----------------------------------------
		cooper_roll = imgui.ImInt(mainIni.lavka.cooper_roll),
		cooper_roll_price = imgui.ImInt(mainIni.lavka.cooper_roll_price),
		----------------------------------------
		silver_roll = imgui.ImInt(mainIni.lavka.silver_roll),
		silver_roll_price = imgui.ImInt(mainIni.lavka.silver_roll_price),
		----------------------------------------
		gold_roll = imgui.ImInt(mainIni.lavka.gold_roll),
		gold_roll_price = imgui.ImInt(mainIni.lavka.gold_roll_price),
		----------------------------------------
		xlopok = imgui.ImInt(mainIni.lavka.xlopok),
		xlopok_price = imgui.ImInt(mainIni.lavka.xlopok_price),
		----------------------------------------
		lens = imgui.ImInt(mainIni.lavka.lens),
		lens_price = imgui.ImInt(mainIni.lavka.lens_price),
		----------------------------------------
		stone = imgui.ImInt(mainIni.lavka.stone),
		stone_price = imgui.ImInt(mainIni.lavka.stone_price),
		----------------------------------------
		metal = imgui.ImInt(mainIni.lavka.metal),
		metal_price = imgui.ImInt(mainIni.lavka.metal_price),
		----------------------------------------
		bronze = imgui.ImInt(mainIni.lavka.bronze),
		bronze_price = imgui.ImInt(mainIni.lavka.bronze_price),
		----------------------------------------
		silver = imgui.ImInt(mainIni.lavka.silver),
		silver_price = imgui.ImInt(mainIni.lavka.silver_price),
		----------------------------------------
		gold = imgui.ImInt(mainIni.lavka.gold),
		gold_price = imgui.ImInt(mainIni.lavka.gold_price),
		----------------------------------------
		euro = imgui.ImInt(mainIni.lavka.euro),
		euro_price = imgui.ImInt(mainIni.lavka.euro_price),
		----------------------------------------
		gr_talon = imgui.ImInt(mainIni.lavka.gr_talon),
		gr_talon_price = imgui.ImInt(mainIni.lavka.gr_talon_price),
		----------------------------------------
		antibiotiki = imgui.ImInt(mainIni.lavka.antibiotiki),
		antibiotiki_price = imgui.ImInt(mainIni.lavka.antibiotiki_price),
		----------------------------------------
		prison = imgui.ImInt(mainIni.lavka.prison),
		prison_price = imgui.ImInt(mainIni.lavka.prison_price),
		----------------------------------------
		zlov_moneta = imgui.ImInt(mainIni.lavka.zlov_moneta),
		zlov_moneta_price = imgui.ImInt(mainIni.lavka.zlov_moneta_price),
		----------------------------------------
		toch_stone = imgui.ImInt(mainIni.lavka.toch_stone),
		toch_stone_price = imgui.ImInt(mainIni.lavka.toch_stone_price),
		----------------------------------------
		bilet_6 = imgui.ImInt(mainIni.lavka.bilet_6),
		bilet_6_price = imgui.ImInt(mainIni.lavka.bilet_6_price),
		----------------------------------------
		sticker_cluck = imgui.ImInt(mainIni.lavka.sticker_cluck),
		sticker_cluck_price = imgui.ImInt(mainIni.lavka.sticker_cluck_price),
		----------------------------------------
		sticker_binko = imgui.ImInt(mainIni.lavka.sticker_binko),
		sticker_binko_price = imgui.ImInt(mainIni.lavka.sticker_binko_price),
		----------------------------------------
		sticker_jizzy = imgui.ImInt(mainIni.lavka.sticker_jizzy),
		sticker_jizzy_price = imgui.ImInt(mainIni.lavka.sticker_jizzy_price),
		----------------------------------------
		platinum_roll = imgui.ImInt(mainIni.lavka.platinum_roll),
		platinum_roll_price = imgui.ImInt(mainIni.lavka.platinum_roll_price),
		----------------------------------------
		fam_money = imgui.ImInt(mainIni.lavka.fam_money),
		fam_money_price = imgui.ImInt(mainIni.lavka.fam_money_price),
		----------------------------------------
		smazka = imgui.ImInt(mainIni.lavka.smazka),
		smazka_price = imgui.ImInt(mainIni.lavka.smazka_price),
		----------------------------------------
		oxlajdauka = imgui.ImInt(mainIni.lavka.oxlajdauka),
		oxlajdauka_price = imgui.ImInt(mainIni.lavka.oxlajdauka_price),
		----------------------------------------
		band_respect = imgui.ImInt(mainIni.lavka.band_respect),
		band_respect_price = imgui.ImInt(mainIni.lavka.band_respect_price),
		----------------------------------------
		AZ_coins = imgui.ImInt(mainIni.lavka.AZ_coins),
		AZ_coins_price = imgui.ImInt(mainIni.lavka.AZ_coins_price),
		----------------------------------------
		Moneta_8_god = imgui.ImInt(mainIni.lavka.Moneta_8_god),
		Moneta_8_god_price = imgui.ImInt(mainIni.lavka.Moneta_8_god_price)
	},
	autopiar =
	{
		----------------------------------------
		vr_text = imgui.ImBuffer(tostring(mainIni.autopiar.vr_text), 144),
		vr_text_2 = imgui.ImBuffer(tostring(mainIni.autopiar.vr_text_2), 144),
		vr_delay = imgui.ImInt(mainIni.autopiar.vr_delay),
		vr_active = imgui.ImBool(mainIni.autopiar.vr_active),
		----------------------------------------
		fam_text = imgui.ImBuffer(tostring(mainIni.autopiar.fam_text), 144),
		fam_text_2 = imgui.ImBuffer(tostring(mainIni.autopiar.fam_text_2), 144),
		fam_delay = imgui.ImInt(mainIni.autopiar.fam_delay),
		fam_active = imgui.ImBool(mainIni.autopiar.fam_active),
		----------------------------------------
		al_text = imgui.ImBuffer(tostring(mainIni.autopiar.al_text), 144),
		al_text_2 = imgui.ImBuffer(tostring(mainIni.autopiar.al_text_2), 144),
		al_delay = imgui.ImInt(mainIni.autopiar.al_delay),
		al_active = imgui.ImBool(mainIni.autopiar.al_active)
		----------------------------------------
	},
	autotoch =
	{
		autotoch_active = false,
		checked_radio = imgui.ImInt(12),
		checked_inv = imgui.ImInt(2),
		autotoch_enable = imgui.ImBool(false)
	},
	state =
	{
		----------------------------------------
		buyvk = -1,
		----------------------------------------
		nicks = false,
		----------------------------------------
		finds = 65535,
		----------------------------------------
		olen = false,
		----------------------------------------
		run = false,
		----------------------------------------
		show_packet = false,
		----------------------------------------
		autoloot = false,
		autoloot_number = 0,
		----------------------------------------
		showid = false,
		showpos = false,
		showmodel = false,
		----------------------------------------
		stealer_td = true,
		----------------------------------------
		alt = false,
		----------------------------------------
		space = false
		----------------------------------------
	}
}
----------------------------------------
local vr_timer = 0
if elements.autopiar.vr_active.v == true then
	vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
end
----------------------------------------
local fam_timer = 0
if elements.autopiar.fam_active.v == true then
	fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
end
----------------------------------------
local al_timer = 0
if elements.autopiar.al_active.v == true then
	al_timer = os.time()+(elements.autopiar.al_delay.v*60)
end
----------------------------------------
local chest_timer_1 = os.time()+(elements.chest.roll_wait.v*60)
local chest_timer_2 = 0
local chest_timer_3 = 0
----------------------------------------

function main()
	while not isSampAvailable() do wait(0) end
	
	if not doesDirectoryExist("moonloader\\logs") then createDirectory("moonloader\\logs") end
	if not doesDirectoryExist("moonloader\\stealer") then createDirectory("moonloader\\stealer") end
	
	----------------------------------------
	lua_thread.create(autoCarKey)
	lua_thread.create(autoALT)
	lua_thread.create(autoSPACE)
	lua_thread.create(renderDateTime)
	lua_thread.create(autoOpenChest)
	lua_thread.create(autoTrunk)
	lua_thread.create(setWeatherTime)
	lua_thread.create(autoPiar)
	lua_thread.create(autoLoot)
	lua_thread.create(functionNicks)
	lua_thread.create(functionFinds)
	lua_thread.create(renderDeer)
	lua_thread.create(renderPacket)
	lua_thread.create(renderOpenBagajnik)
	lua_thread.create(renderTextdraws)
	lua_thread.create(renderProdovoz)
	-- lua_thread.create(renderQuest)
	lua_thread.create(renderCalculator)
	lua_thread.create(autoClickKey)
	lua_thread.create(autoBuyVK)
	lua_thread.create(autoZeks)
	lua_thread.create(offAnims)
	-- lua_thread.create(inputChat)
	--------------------[NoAnimationsMoney]--------------------
	memory.setuint8(0x5700F7, 0xB8, true)
	memory.copy(0x5700FB, memory.strptr('\x89\x96\xBC\x00\x00\x00'), 6, true)
	memory.setuint8(0x570103, 0xEB, true)
	--------------------[NoCollisionBlade]--------------------
	memory.fill(0x6C5107, 0x90, 59, true)
	--------------------[NoBalloons]--------------------
	local result, samp = loadDynamicLibrary("samp.dll")
	if result then
		writeMemory(samp + 0xB0DE0, 0x02, 0xC390, true) 
	end
	------------------[Блокировка SA:MP клавиш]--------------------
	memory.fill(sampGetBase() + 31102, 0, 1, true) -- F4
	memory.fill(sampGetBase() + 463840, 0, 1, true) -- F1
	----------------------------------------
	autoupdate("https://raw.githubusercontent.com/metk1u/scripts/main/update_launcher.json", '['..string.upper(thisScript().name)..']: ')
	----------------------------------------
	for id_model_anti_stealer, name_model_anti_stealer in pairs(model_name_anti_stealer) do
		os.remove("moonloader\\stealer\\"..id_model_anti_stealer.." - "..name_model_anti_stealer..".notepad")
		os.remove("moonloader\\stealer\\"..id_model_anti_stealer.." - .notepad")
	end
	----------------------------------------
	_, playerid = sampGetPlayerIdByCharHandle(PLAYER_PED)
	local_name = sampGetPlayerNickname(playerid)
	----------------------------------------
	sampRegisterChatCommand('chat',function()
		windowstate.v = not windowstate.v
	end)
	sampRegisterChatCommand('biz',function()
		biz_listitem = 0
		auto_bizinfo(0)
	end)
	----------------------------------------
	sampRegisterChatCommand('rec',function() 
		sampDisconnectWithReason(false)
		sampSetGamestate(1)
		push_message('Перезахожу...')
	end)
	----------------------------------------
	sampRegisterChatCommand('rr',function(arg)
		if #arg == 0 then
			sampAddChatMessage('Используй: /rr [жалоба]', 0xAFAFAF)
		else
			message_report = arg
			sampSendChat("/report")
		end
	end)
	----------------------------------------
	sampRegisterChatCommand('buyvk',function(number)
		if #number == 0 then
			sampAddChatMessage('Используй: /buyvk [number 1-7]', 0xAFAFAF)
			if elements.state.buyvk ~= -1 then
				elements.state.buyvk = -1
				push_message('Выключаю покупку VK-Coins.')
			end
		else
			if elements.state.buyvk == -1 then
				elements.state.buyvk = number-1
				push_message('Включаю покупку VK-Coins.')
			else
				elements.state.buyvk = -1
				push_message('Выключаю покупку VK-Coins.')
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("nicks",function()
		elements.state.nicks = not elements.state.nicks
		push_message((elements.state.nicks and "Включаю" or "Выключаю")..' поиск игроков в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand('finds',function(playerid)
		if #playerid == 0 then
			sampAddChatMessage('Используй: /finds [playerid]', 0xAFAFAF)
			if elements.state.finds ~= 65535 then
				elements.state.finds = 65535
				printString('~r~Find disable',2000)
				push_message('Выключаю поиск игрока.')
			end
		else
			if sampIsPlayerConnected(playerid) then
				if elements.state.finds == playerid then
					elements.state.finds = 65535
					printString('~r~Find disable',2000)
					push_message('Выключаю поиск игрока.')
				else
					sampSendChat("/id "..playerid)
					elements.state.finds = playerid
					printString('~g~Find enable',2000)
					push_message('Поиск ID:'..elements.state.finds..' активирован.')
				end
			else
				sampAddChatMessage('{FF3300}x{AFAFAF} Игрок не в игре.',0xAFAFAF)
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("olen",function()
		elements.state.olen = not elements.state.olen
		push_message((elements.state.olen and "Включаю" or "Выключаю")..' поиск оленей в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("run",function()
		elements.state.run = not elements.state.run
		push_message((elements.state.run and "Включаю" or "Выключаю")..' бесконечный бег.')
	end)
	----------------------------------------
	sampRegisterChatCommand("rpc",function()
		elements.state.show_packet = not elements.state.show_packet
		push_message((elements.state.show_packet and "Включаю" or "Выключаю")..' показ пакетов.')
	end)
	----------------------------------------
	sampRegisterChatCommand("loot",function()
		elements.state.autoloot = not elements.state.autoloot
		push_message((elements.state.autoloot and "Включаю" or "Выключаю")..' пылесос.')
	end)
	----------------------------------------
	sampRegisterChatCommand('ud',function()
		sampSendChat("/usedrugs 3")
	end)
	----------------------------------------
	sampRegisterChatCommand('ar',function()
		sampSendChat("/armour")
	end)
	----------------------------------------
	sampRegisterChatCommand('show',function(playerid)
		sampSendChat("/showvisit "..playerid)
	end)
	----------------------------------------
	sampRegisterChatCommand("showid",function()
		elements.state.showid = not elements.state.showid
		push_message((elements.state.showid and "Включаю" or "Выключаю")..' ID текстдравов.')
		----------------------------------------
		if elements.state.showmodel == true then
			elements.state.showmodel = false
			push_message('Выключаю MODEL текстдравов.')
		end
		----------------------------------------
		if elements.state.showpos == true then
			elements.state.showpos = false
			push_message('Выключаю X / Y текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("showpos",function()
		elements.state.showpos = not elements.state.showpos
		push_message((elements.state.showpos and "Включаю" or "Выключаю")..' X / Y текстдравов.')
		----------------------------------------
		if elements.state.showmodel == true then
			elements.state.showmodel = false
			push_message('Выключаю MODEL текстдравов.')
		end
		----------------------------------------
		if elements.state.showid == true then
			elements.state.showid = false
			push_message('Выключаю ID текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("showmodel",function()
		elements.state.showmodel = not elements.state.showmodel
		push_message((elements.state.showmodel and "Включаю" or "Выключаю")..' MODEL текстдравов.')
		----------------------------------------
		if elements.state.showid == true then
			elements.state.showid = false
			push_message('Выключаю ID текстдравов.')
		end
		----------------------------------------
		if elements.state.showpos == true then
			elements.state.showpos = false
			push_message('Выключаю X / Y текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("price",commandPrice)
	----------------------------------------
	sampRegisterChatCommand("alt",function()
		elements.state.alt = not elements.state.alt
		push_message((elements.state.alt and "Включаю" or "Выключаю")..' click ALT.')
	end)
	----------------------------------------
	sampRegisterChatCommand("space",function()
		elements.state.space = not elements.state.space
		push_message((elements.state.space and "Включаю" or "Выключаю")..' click space.')
	end)
	----------------------------------------
	sampRegisterChatCommand("rfam",function()
		RfamEnabled = not RfamEnabled
		if not RfamEnabled then
			sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Функция выключена.', 0xFFFFFF)
			RfamThreadHandler:terminate()
			RfamThreadHandler = nil
			HideAllTextdraws = false
			sampSendClickTextdraw(65535)
			return
		end
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Функция включена, всем людям в радиусе 5 метров будет отсылать приглашение в семью.', 0xFFFFFF)
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Для отключения функции введите команду еще раз.', 0xFFFFFF)

		RfamThreadHandler = lua_thread.create(function()
			while true do wait(100)
				HideAllTextdraws = false
				if not RfamEnabled then
					RfamThreadHandler:terminate()
					RfamThreadHandler = nil
					return
				end

				for _, char in pairs(getAllChars()) do
					if not char then
						goto continue
					end
					local mx, my, mz = getCharCoordinates(PLAYER_PED)
					mx, my, mz = mx or 0, my or 0, mz or 0

					local s, x, y, z = pcall(function() return getCharCoordinates(char) end)
						if not s then
							goto continue
						end
					x, y, z = x or 0, y or 0, z or 0

					local distance = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
					distance = distance or 9999

					local r, id = sampGetPlayerIdByCharHandle(char)
					if r and id ~= sampGetCurentPlayerID() and distance < 5.0 then
						GettingFamInfo = true
						HideAllTextdraws = true
						if RfamFlood[id] ~= nil then
							if RfamFlood[id].Timestamp < os.time() then
								sampSendChat('/faminvite '..id)
								wait(500)
								RfamFlood[id] =
								{
									Timestamp = os.time()+15
								}
							end
						else
							sampSendChat('/faminvite '..id)
							wait(500)
							RfamFlood[id] =
							{
								Timestamp = os.time()+15
							}
						end
					end
				::continue:: end
			end
		end)
	end)
	sampRegisterChatCommand("hide",function()
		function hidePlayer(id)
			local w = BitStreamIO.bs_write
			local bs = raknetNewBitStream()
			w.int16(bs, id)
			raknetEmulRpcReceiveBitStream(163, bs)
		end
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Все людишки в зоне стрима исчезли.', 0xFFFFFF)
		local chars = getAllChars()
		for i = 1, #chars do
			local res, id = sampGetPlayerIdByCharHandle(chars[i])
			if res and chars[i] ~= 1 then
				hidePlayer(id)
			end
		end
	end)
	sampRegisterChatCommand("55",function()
		ApplyAnimation("Pointup_loop","ON_LOOKERS",4.1,true,false,false,false)
	end)
	sampRegisterChatCommand("88",function()
		ApplyAnimation("SitnWait_loop_W","BEACH",4.0,true,false,false,false)
	end)
	----------------------------------------
	for i = 0, sampGetMaxPlayerId() do
		if sampIsPlayerConnected(i) then
			nickname = sampGetPlayerNickname(i)
			for id = 1, #friends do
				if nickname:find(friends[id]) and not local_name:find(friends[id]) then
					sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..i..'] находится на сервере.')
					sampAddChatMessage('Игрок '..nickname..'['..i..'] находится на сервере.', 0xFF3300)
				end
			end
		end
	end
	----------------------------------------
	sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] {299800}Загружен{FFFFFF}. Настройки: /chat.', 0xFFFFFF)
	----------------------------------------
	while true do
		wait(0)
		--------------------[Реконнект]--------------------
		-- if reconnect_timer >= os.time() then
			-- printString(string.format('~r~RECONNECT: %d cek',reconnect_timer-os.time()),100)
			-- if reconnect_timer == os.time() then
				-- local ip, port = sampGetCurrentServerAddress()
				-- sampConnectToServer(ip, port)				
				-- reconnect_timer = 0
			-- end
		-- end
		--------------------[Очистка памяти]--------------------
		-- if memory.read(0x8E4CB4, 4, true) > 1048576*550 then -- 800 МБайт (500 МБайт - 524288000)
			-- cleanStreamMemoryBuffer()
			-- sampAddChatMessage('['..thisScript().name..' (L){FFFFFF}] Произвелась очистка памяти!', 0xFFFFFF)
		-- end
		------------------[Фикс чата на Т]--------------------
		-- if isKeyJustPressed(VK_T) and not sampIsDialogActive() and not sampIsScoreboardOpen() and not isSampfuncsConsoleActive() then
			-- sampSetChatInputEnabled(true)
		-- end
		------------------[Radio Off]--------------------
		-- if isCharInAnyCar(playerPed) and getRadioChannel(playerPed) < 12 then
			-- setRadioChannel(12)
		-- end
		------------------[Бесконечный бег]--------------------
		-- if elements.state.run == true then
			-- memory.setint8(0xB7CEE4, 1)
		-- else
			-- memory.setint8(0xB7CEE4, 0)
		-- end
		--------------------[Дальний чат]--------------------
		if elements.chat.distant_active.v == true and not isPauseMenuActive() then
			local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
			local windowPosX = getStructElement(input, 0x8, 4)
			local windowPosY = getStructElement(input, 0xC, 4)
			renderFontDrawText(molot_8_5, "Дальний чат:", windowPosX, windowPosY+80, -1)
			----------------------------------------
			for _, message in ipairs(chatbuble) do
				renderFontDrawText(molot_8_5, message, windowPosX, windowPosY+92, -1)
				windowPosY = windowPosY+13
			end
		end
		--------------------[BizInfo]--------------------
		if render_bizinfo_timer > os.time() and not isPauseMenuActive() then
			local windowPosY = 0
			local sx, sy = getScreenResolution()
			if biz_message_1 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_1, sx/4, sy/1.15+windowPosY, -1)
			end
			if biz_message_2 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_2, sx/4, sy/1.15+windowPosY+13, -1)
			end
			if biz_message_3 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_3, sx/4, sy/1.15+windowPosY+13*2, -1)
			end
			if biz_message_4 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_4, sx/4, sy/1.15+windowPosY+13*3, -1)
			end
			if biz_message_5 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_5, sx/4, sy/1.15+windowPosY+13*4, -1)
			end
			if biz_message_6 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_6, sx/4, sy/1.15+windowPosY+13*5, -1)
			end
			if biz_message_7 ~= nil then
				renderFontDrawText(molot_8_5, biz_message_7, sx/4, sy/1.15+windowPosY+13*6, -1)
			end
		end
		if render_bizinfo_timer == os.time() then
			render_bizinfo_timer = 0
			biz_message_1 = nil
			biz_message_2 = nil
			biz_message_3 = nil
			biz_message_4 = nil
			biz_message_5 = nil
			biz_message_6 = nil
			biz_message_7 = nil
		end
		--------------------[Главный ImGui]--------------------
		imgui.Process = true
		imgui.ShowCursor = windowstate.v
		----------------------------------------
	end
end

function saveini()
	inicfg.save(
	{
		config =
		{
			renderTime = elements.config.renderTime.v,
			killStat = elements.config.killStat.v,
			del_opisanie_3d = elements.config.del_opisanie_3d.v,
			autozeks = elements.config.autozeks.v,
			prodovoz_edit = elements.config.prodovoz_edit.v,
			bizinfo_timer = elements.config.bizinfo_timer.v,
			convert = elements.config.convert.v,
			set_weather = elements.config.set_weather.v,
			set_time = elements.config.set_time.v,
			theme_colorR = elements.config.theme_colorR.v,
			theme_colorG = elements.config.theme_colorG.v,
			theme_colorB = elements.config.theme_colorB.v,
			theme_colorA = elements.config.theme_colorA.v
		},
		account =
		{
			my_nick = elements.account.my_nick.v,
			my_password = elements.account.my_password.v,
			my_pincode = elements.account.my_pincode.v,
			my_nick_2 = elements.account.my_nick_2.v,
			my_password_2 = elements.account.my_password_2.v,
			my_pincode_2 = elements.account.my_pincode_2.v,
			my_nick_3 = elements.account.my_nick_3.v,
			my_password_3 = elements.account.my_password_3.v,
			my_pincode_3 = elements.account.my_pincode_3.v
		},
		chat =
		{
			chatlog = elements.chat.chatlog.v,
			removechatspam = elements.chat.removechatspam.v,
			tosampfuncsspam = elements.chat.tosampfuncsspam.v,
			tosampfuncsfam = elements.chat.tosampfuncsfam.v,
			distant_active = elements.chat.distant_active.v,
			distant_count = elements.chat.distant_count.v,
			antiflood_time = elements.chat.antiflood_time.v
		},
		chest =
		{
			roll_standart = elements.chest.roll_standart.v,
			roll_platinum = elements.chest.roll_platinum.v,
			roll_maska = elements.chest.roll_maska.v,
			roll_state = elements.chest.roll_state.v,
			roll_wait = elements.chest.roll_wait.v,
		},
		destroy =
		{
			bucket = elements.destroy.bucket.v,
			tree = elements.destroy.tree.v,
			serdce = elements.destroy.serdce.v,
			xlam = elements.destroy.xlam.v,
			newyear = elements.destroy.newyear.v,
		},
		lavka =
		{
			drugs = elements.lavka.drugs.v,
			drugs_price = elements.lavka.drugs_price.v,
			----------------------------------------
			materials = elements.lavka.materials.v,
			materials_price = elements.lavka.materials_price.v,
			----------------------------------------
			fam_talon = elements.lavka.fam_talon.v,
			fam_talon_price = elements.lavka.fam_talon_price.v,
			----------------------------------------
			gift = elements.lavka.gift.v,
			gift_price = elements.lavka.gift_price.v,
			----------------------------------------
			cooper_roll = elements.lavka.cooper_roll.v,
			cooper_roll_price = elements.lavka.cooper_roll_price.v,
			----------------------------------------
			silver_roll = elements.lavka.silver_roll.v,
			silver_roll_price = elements.lavka.silver_roll_price.v,
			----------------------------------------
			gold_roll = elements.lavka.gold_roll.v,
			gold_roll_price = elements.lavka.gold_roll_price.v,
			----------------------------------------
			xlopok = elements.lavka.xlopok.v,
			xlopok_price = elements.lavka.xlopok_price.v,
			----------------------------------------
			lens = elements.lavka.lens.v,
			lens_price = elements.lavka.lens_price.v,
			----------------------------------------
			stone = elements.lavka.stone.v,
			stone_price = elements.lavka.stone_price.v,
			----------------------------------------
			metal = elements.lavka.metal.v,
			metal_price = elements.lavka.metal_price.v,
			----------------------------------------
			bronze = elements.lavka.bronze.v,
			bronze_price = elements.lavka.bronze_price.v,
			----------------------------------------
			silver = elements.lavka.silver.v,
			silver_price = elements.lavka.silver_price.v,
			----------------------------------------
			gold = elements.lavka.gold.v,
			gold_price = elements.lavka.gold_price.v,
			----------------------------------------
			euro = elements.lavka.euro.v,
			euro_price = elements.lavka.euro_price.v,
			----------------------------------------
			gr_talon = elements.lavka.gr_talon.v,
			gr_talon_price = elements.lavka.gr_talon_price.v,
			----------------------------------------
			antibiotiki = elements.lavka.antibiotiki.v,
			antibiotiki_price = elements.lavka.antibiotiki_price.v,
			----------------------------------------
			prison = elements.lavka.prison.v,
			prison_price = elements.lavka.prison_price.v,
			----------------------------------------
			zlov_moneta = elements.lavka.zlov_moneta.v,
			zlov_moneta_price = elements.lavka.zlov_moneta_price.v,
			----------------------------------------
			toch_stone = elements.lavka.toch_stone.v,
			toch_stone_price = elements.lavka.toch_stone_price.v,
			----------------------------------------
			bilet_6 = elements.lavka.bilet_6.v,
			bilet_6_price = elements.lavka.bilet_6_price.v,
			----------------------------------------
			sticker_cluck = elements.lavka.sticker_cluck.v,
			sticker_cluck_price = elements.lavka.sticker_cluck_price.v,
			----------------------------------------
			sticker_binko = elements.lavka.sticker_binko.v,
			sticker_binko_price = elements.lavka.sticker_binko_price.v,
			----------------------------------------
			sticker_jizzy = elements.lavka.sticker_jizzy.v,
			sticker_jizzy_price = elements.lavka.sticker_jizzy_price.v,
			----------------------------------------
			platinum_roll = elements.lavka.platinum_roll.v,
			platinum_roll_price = elements.lavka.platinum_roll_price.v,
			----------------------------------------
			fam_money = elements.lavka.fam_money.v,
			fam_money_price = elements.lavka.fam_money_price.v,
			----------------------------------------
			smazka = elements.lavka.smazka.v,
			smazka_price = elements.lavka.smazka_price.v,
			----------------------------------------
			oxlajdauka = elements.lavka.oxlajdauka.v,
			oxlajdauka_price = elements.lavka.oxlajdauka_price.v,
			----------------------------------------
			band_respect = elements.lavka.band_respect.v,
			band_respect_price = elements.lavka.band_respect_price.v,
			----------------------------------------
			AZ_coins = elements.lavka.AZ_coins.v,
			AZ_coins_price = elements.lavka.AZ_coins_price.v,
			----------------------------------------
			Moneta_8_god = elements.lavka.Moneta_8_god.v,
			Moneta_8_god_price = elements.lavka.Moneta_8_god_price.v
		},
		autopiar =
		{
			----------------------------------------
			vr_text = elements.autopiar.vr_text.v,
			vr_text_2 = elements.autopiar.vr_text_2.v,
			vr_delay = elements.autopiar.vr_delay.v,
			vr_active = elements.autopiar.vr_active.v,
			----------------------------------------
			fam_text = elements.autopiar.fam_text.v,
			fam_text_2 = elements.autopiar.fam_text_2.v,
			fam_delay = elements.autopiar.fam_delay.v,
			fam_active = elements.autopiar.fam_active.v,
			----------------------------------------
			al_text = elements.autopiar.al_text.v,
			al_text_2 = elements.autopiar.al_text_2.v,
			al_delay = elements.autopiar.al_delay.v,
			al_active = elements.autopiar.al_active.v
			----------------------------------------
		}
	},file_settings)
end

function imgui.OnDrawFrame()
	----------------------------------------
	onRenderNotification()
	----------------------------------------
	local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
	local windowPosX = getStructElement(input, 0x8, 4)
	local windowPosY = getStructElement(input, 0xC, 4)
	--------------------[Калькулятор]--------------------
	if sampIsChatInputActive() and ok then
		imgui.SetNextWindowPos(imgui.ImVec2(windowPosX, windowPosY + 30 + 15), imgui.Cond.FirstUseEver)
		imgui.SetNextWindowSize(imgui.ImVec2(result_calc:len()*10, 30))
		imgui.Begin('Solve', window, imgui.WindowFlags.NoTitleBar + imgui.WindowFlags.NoResize + imgui.WindowFlags.NoMove)
		imgui.CenterText(u8(number_separator(result_calc)))
		imgui.End()
	end
	----------------------------------------
	local sw,sh = getScreenResolution()
	if windowstate.v == true then
		----------------------------------------
		imgui.SetNextWindowPos(imgui.ImVec2(sw/1.9, sh/2.7), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5,0.5))
		imgui.SetNextWindowSize(imgui.ImVec2(860, 520), imgui.Cond.FirstUseEver)
		imgui.Begin(u8(script_names..' | v'..thisScript().version),windowstate,imgui.WindowFlags.HorizontalScrollbar + imgui.WindowFlags.AlwaysAutoResize)
		imgui.BeginGroup()
		----------------------------------------
		if imgui.Button(u8('Сохранить настройки'),imgui.ImVec2(180,20)) then
			saveini()
			sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Настройки успешно сохранены.', 0xFFFFFF)
			push_message('Настройки сохранены!')
		end
		imgui.SameLine()
		----------------------------------------
		if imgui.Button(u8('Перезагрузить скрипт'),imgui.ImVec2(180,20)) then
			thisScript():reload()
		end
		----------------------------------------
		if imgui.Button(u8('Отключить скрипт'),imgui.ImVec2(180,20)) then
			thisScript():unload()
		end
		imgui.SameLine()
		----------------------------------------
		if imgui.Button(u8('Суицид'),imgui.ImVec2(180,20)) then
			setCharHealth(PLAYER_PED, 0)
			push_message('Покойся с миром!')
		end
		imgui.NewLine()
		----------------------------------------
		if imgui.Button(u8('Команды скрипта'), imgui.ImVec2(180, 30)) then
			type_window.v = 1
		end
		----------------------------------------
		if imgui.Button(u8('Настройки'), imgui.ImVec2(180, 30)) then
			type_window.v = 2
		end
		----------------------------------------
		if imgui.Button(u8('Настройки автологин'), imgui.ImVec2(180, 30)) then
			type_window.v = 3
		end
		----------------------------------------
		if imgui.Button(u8('Настройки автопиар'), imgui.ImVec2(180, 30)) then
			type_window.v = 4
		end
		----------------------------------------
		if imgui.Button(u8('Настройки чата'), imgui.ImVec2(180, 30)) then
			type_window.v = 5
		end
		----------------------------------------
		if imgui.Button(u8('Удаление мусора с сервера'), imgui.ImVec2(180, 30)) then
			type_window.v = 6
		end
		----------------------------------------
		if imgui.Button(u8('Авто-точилка аксессуаров'), imgui.ImVec2(180, 30)) then
			type_window.v = 7
		end
		----------------------------------------
		if imgui.Button(u8('Авто-открытие сундуков'), imgui.ImVec2(180, 30)) then
			type_window.v = 8
		end
		----------------------------------------
		if imgui.Button(u8('Авто-скуп в ларьке'), imgui.ImVec2(180, 30)) then
			type_window.v = 9
		end
		----------------------------------------
		imgui.BeginChild("##Skup", imgui.ImVec2(330, 80), true, imgui.WindowFlags.NoScrollbar)
			----------------------------------------
			local count_all = 0
			if elements.lavka.drugs.v ~= 0 then
				count_all = count_all+(elements.lavka.drugs_price.v*elements.lavka.drugs.v)
			end
			if elements.lavka.materials.v ~= 0 then
				count_all = count_all+(elements.lavka.materials_price.v*elements.lavka.materials.v)
			end
			if elements.lavka.fam_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.fam_talon_price.v*elements.lavka.fam_talon.v)
			end
			if elements.lavka.gift.v ~= 0 then
				count_all = count_all+(elements.lavka.gift_price.v*elements.lavka.gift.v)
			end
			if elements.lavka.cooper_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.cooper_roll_price.v*elements.lavka.cooper_roll.v)
			end
			if elements.lavka.silver_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.silver_roll_price.v*elements.lavka.silver_roll.v)
			end
			if elements.lavka.gold_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.gold_roll_price.v*elements.lavka.gold_roll.v)
			end
			if elements.lavka.xlopok.v ~= 0 then
				count_all = count_all+(elements.lavka.xlopok_price.v*elements.lavka.xlopok.v)
			end
			if elements.lavka.lens.v ~= 0 then
				count_all = count_all+(elements.lavka.lens_price.v*elements.lavka.lens.v)
			end
			if elements.lavka.stone.v ~= 0 then
				count_all = count_all+(elements.lavka.stone_price.v*elements.lavka.stone.v)
			end
			if elements.lavka.metal.v ~= 0 then
				count_all = count_all+(elements.lavka.metal_price.v*elements.lavka.metal.v)
			end
			if elements.lavka.bronze.v ~= 0 then
				count_all = count_all+(elements.lavka.bronze_price.v*elements.lavka.bronze.v)
			end
			if elements.lavka.silver.v ~= 0 then
				count_all = count_all+(elements.lavka.silver_price.v*elements.lavka.silver.v)
			end
			if elements.lavka.gold.v ~= 0 then
				count_all = count_all+(elements.lavka.gold_price.v*elements.lavka.gold.v)
			end
			if elements.lavka.euro.v ~= 0 then
				count_all = count_all+(elements.lavka.euro_price.v*elements.lavka.euro.v)
			end
			if elements.lavka.gr_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.gr_talon_price.v*elements.lavka.gr_talon.v)
			end
			if elements.lavka.antibiotiki.v ~= 0 then
				count_all = count_all+(elements.lavka.antibiotiki_price.v*elements.lavka.antibiotiki.v)
			end
			if elements.lavka.prison.v ~= 0 then
				count_all = count_all+(elements.lavka.prison_price.v*elements.lavka.prison.v)
			end
			if elements.lavka.zlov_moneta.v ~= 0 then
				count_all = count_all+(elements.lavka.zlov_moneta_price.v*elements.lavka.zlov_moneta.v)
			end
			if elements.lavka.toch_stone.v ~= 0 then
				count_all = count_all+(elements.lavka.toch_stone_price.v*elements.lavka.toch_stone.v)
			end
			if elements.lavka.bilet_6.v ~= 0 then
				count_all = count_all+(elements.lavka.bilet_6_price.v*elements.lavka.bilet_6.v)
			end
			if elements.lavka.sticker_cluck.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_cluck_price.v*elements.lavka.sticker_cluck.v)
			end
			if elements.lavka.sticker_binko.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_binko_price.v*elements.lavka.sticker_binko.v)
			end
			if elements.lavka.sticker_jizzy.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_jizzy_price.v*elements.lavka.sticker_jizzy.v)
			end
			if elements.lavka.platinum_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.platinum_roll_price.v*elements.lavka.platinum_roll.v)
			end
			if elements.lavka.smazka.v ~= 0 then
				count_all = count_all+(elements.lavka.smazka_price.v*elements.lavka.smazka.v)
			end
			if elements.lavka.oxlajdauka.v ~= 0 then
				count_all = count_all+(elements.lavka.oxlajdauka_price.v*elements.lavka.oxlajdauka.v)
			end
			if elements.lavka.band_respect.v ~= 0 then
				count_all = count_all+(elements.lavka.band_respect_price.v*elements.lavka.band_respect.v)
			end
			if elements.lavka.AZ_coins.v ~= 0 then
				count_all = count_all+(elements.lavka.AZ_coins_price.v*elements.lavka.AZ_coins.v)
			end
			if elements.lavka.Moneta_8_god.v ~= 0 then
				count_all = count_all+(elements.lavka.Moneta_8_god_price.v*elements.lavka.Moneta_8_god.v)
			end
			----------------------------------------
			imgui.Text(u8(separator(string.format("Для покупки всех товаров необходимо $%d",count_all))))
			if count_all > getPlayerMoney(Player) then
				imgui.TextColoredRGB(u8(separator(string.format("{FF3300}Тебе нехватает $%d",count_all-getPlayerMoney(Player)))))
			end
			----------------------------------------
			if imgui.Button(u8"Начать скупку",imgui.ImVec2(250,25)) then
				skupka()
				windowstate.v = not windowstate.v
			end
			----------------------------------------
		imgui.EndChild()
		imgui.PushItemWidth(90)
		imgui.InputInt(u8('Своровать модификацию с указанного ID'),elements.config.attach_id)
		if elements.config.attach_id.v < 0 or elements.config.attach_id.v > 1001 then
			elements.config.attach_id.v = 1001
		end
		----------------------------------------
		if imgui.Checkbox(u8('Выключить игроков в зоне стрима'),elements.config.del_stream_pl) then
			if elements.chat.distant_active.v == true then
				elements.chat.distant_active.v = false
			end
		end
		imgui.SameLine()
		imgui.TextColoredRGB(u8"{8B00FF}(?)")
		----------------------------------------
		imgui.Hint('del_stream_pl', u8'Отключает появление ИГРОКОВ в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		imgui.Checkbox(u8('Выключить транспорт в зоне стрима'),elements.config.del_stream_veh)
		imgui.SameLine()
		imgui.TextColoredRGB(u8"{8B00FF}(?)")
		----------------------------------------
		imgui.Hint('del_stream_veh', u8'Отключает появление ТРАНСПОРТА в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		if imgui.Checkbox(u8('Выключить обновление зоны стрима'),elements.config.del_stream) then
			if elements.config.del_stream.v == true then
				elements.config.del_shout.v = true
			end
			if elements.config.del_stream.v == false then
				elements.config.del_shout.v = false
			end
			if elements.chat.distant_active.v == true then
				elements.chat.distant_active.v = false
			end
		end
		imgui.SameLine()
		imgui.TextColoredRGB(u8"{8B00FF}(?)")
		----------------------------------------
		imgui.Hint('del_stream', u8'Отключает появление игроков и транспорта в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		imgui.SameLine()
		imgui.Checkbox(u8('Выключить /s чат'),elements.config.del_shout)
		----------------------------------------
		imgui.EndGroup()
		imgui.SameLine()
		imgui.BeginGroup()
		----------------------------------------
		local menuX = 0
		local menuY = 0
		if type_window.v == 1 then menuX = 300 menuY = 263 end
		if type_window.v == 2 then menuX = 555 menuY = 395 end
		if type_window.v == 3 then menuX = 215 menuY = 235 end
		if type_window.v == 4 then menuX = 570 menuY = 305 end
		if type_window.v == 5 then menuX = 470 menuY = 240 end
		if type_window.v == 6 then menuX = 300 menuY = 130 end
		if type_window.v == 7 then menuX = 435 menuY = 83 end
		if type_window.v == 8 then menuX = 225 menuY = 130 end
		if type_window.v == 9 then menuX = 580 menuY = 700 end
		----------------------------------------
		imgui.BeginChild("##MenuActive", imgui.ImVec2(menuX, menuY), true, imgui.WindowFlags.NoScrollbar)
			----------------------------------------
			if type_window.v == 1 then
				imgui.Text(u8"Основные команды:")
				imgui.Text(u8"/rec - Перезайти на сервер")
				imgui.Text(u8"/rr [текст] - Написать в репорт")
				imgui.TextColoredRGB(u8"/buyvk [1-7] - Автопрокачка VK-Coins. {8B00FF}(?)")
				imgui.Hint('buyvk', u8'Открываешь BOOST в телефоне, вводишь /buyvk [1-7] и\nскрипт будет автоматически покупать.')
				imgui.TextColoredRGB(u8"/nicks - Игроки в зоне стрима {8B00FF}(?)")
				imgui.Hint('nicks', u8'Чтобы отключить введи /nicks ещё раз.')
				imgui.TextColoredRGB(u8"/finds [playerid] - Поиск игрока в зоне стрима {8B00FF}(?)")
				imgui.Hint('finds', u8'Чтобы отключить введи /finds ещё раз.')
				imgui.Text(u8"/olen - Поиск оленей в зоне стрима")
				imgui.Text(u8"/run - Бесконечный бег")
				imgui.TextColoredRGB(u8"/loot - Автосбор с мусорки/багажника {8B00FF}(?)")
				imgui.Hint('loot', u8'Заходишь в мусорку, вводишь /loot и скрипт будет автоматически\nлутать все что появится.')
				imgui.Text(u8"/ud - Использует 3 грамма наркотиков")
				imgui.Text(u8"/ar - Надевает броню")
				imgui.Text(u8"/price [название] - Посмотреть цену на товар")
				imgui.Text(u8"/biz - Посмотреть статистику бизнесов")
				imgui.Text(u8"/hide - Удалить всех людишек с зоны стрима")
			end
			----------------------------------------
			if type_window.v == 2 then
				imgui.Checkbox(u8('Включить чатлог'),elements.chat.chatlog)
				----------------------------------------
				imgui.Checkbox(u8('Включить время в левом нижнем углу'),elements.config.renderTime)
				----------------------------------------
				imgui.Checkbox(u8('Выключить киллстат'),elements.config.killStat)
				imgui.Checkbox(u8('Убрать \'Описание\' игроков'),elements.config.del_opisanie_3d)
				imgui.Checkbox(u8('Автоматический /zeks раз в 9 секунд'),elements.config.autozeks)
				imgui.Checkbox(u8('Отключение анимации посадки в транспорт у игроков'),elements.config.anim_car)
				----------------------------------------
				imgui.Separator()
				imgui.PushItemWidth(100)
				imgui.InputInt(u8('Кол-во продукции для завозки в бизнесы'),elements.config.prodovoz_edit)
				if elements.config.prodovoz_edit.v > 4500 then
					elements.config.prodovoz_edit.v = 4500
				end
				if elements.config.prodovoz_edit.v < 1 then
					elements.config.prodovoz_edit.v = 1
				end
				imgui.Separator()
				----------------------------------------
				imgui.PushItemWidth(100)
				imgui.InputInt(u8('Таймер на BizInfo (в сек.)'),elements.config.bizinfo_timer)
				if elements.config.bizinfo_timer.v < 5 then
					elements.config.bizinfo_timer.v = 5
				end
				imgui.Separator()
				----------------------------------------
				imgui.PushItemWidth(100)
				imgui.InputInt(u8('Курс Vice City coins'),elements.config.convert)
				if elements.config.convert.v < 0 then
					elements.config.convert.v = 0
				end
				imgui.Separator()
				----------------------------------------
				imgui.PushItemWidth(300)
				imgui.SliderInt(u8('Погода'),elements.config.set_weather,0,45)
				imgui.Separator()
				----------------------------------------
				imgui.PushItemWidth(300)
				imgui.SliderInt(u8('Время'),elements.config.set_time,0,23)
				imgui.Separator()
				----------------------------------------
				imgui.SliderFloat(u8('[THEME] Корректировка красного цвета'), elements.config.theme_colorR, 0.000, 1.000, "%.3f")
				imgui.SliderFloat(u8('[THEME] Корректировка зелёного цвета'), elements.config.theme_colorG, 0.000, 1.000, "%.3f")
				imgui.SliderFloat(u8('[THEME] Корректировка синего цвета'), elements.config.theme_colorB, 0.000, 1.000, "%.3f")
				imgui.SliderFloat(u8('[THEME] Корректировка прозрачности'), elements.config.theme_colorA, 0.000, 1.000, "%.3f")
				theme()
			end
			----------------------------------------
			if type_window.v == 3 then
				imgui.PushItemWidth(150)
				imgui.InputText(u8('Ник'),elements.account.my_nick)
				imgui.InputText(u8('Пароль'),elements.account.my_password)
				imgui.InputText(u8('Пинкод'),elements.account.my_pincode)
				imgui.Separator()
				imgui.InputText(u8('Ник##2'),elements.account.my_nick_2)
				imgui.InputText(u8('Пароль##2'),elements.account.my_password_2)
				imgui.InputText(u8('Пинкод##2'),elements.account.my_pincode_2)
				imgui.Separator()
				imgui.InputText(u8('Ник##3'),elements.account.my_nick_3)
				imgui.InputText(u8('Пароль##3'),elements.account.my_password_3)
				imgui.InputText(u8('Пинкод##3'),elements.account.my_pincode_3)
			end
			----------------------------------------
			if type_window.v == 4 then
				imgui.PushItemWidth(460)
				imgui.InputText(u8('[/vr] Текст'),elements.autopiar.vr_text)
				imgui.InputText(u8('[/vr] Текст - 2'),elements.autopiar.vr_text_2)
				imgui.PushItemWidth(200)
				imgui.SliderInt(u8('[/vr] Задержка (мин.)'),elements.autopiar.vr_delay,1,60)
				if imgui.Checkbox(u8('[/vr] Активировать'),elements.autopiar.vr_active) then
					if elements.autopiar.vr_active.v == true then
						if elements.autopiar.vr_text.v == '' and elements.autopiar.vr_text_2.v == '' then
							elements.autopiar.vr_active.v = false	
						else
							if vr_timer < os.time() then
								--------------------------------
								vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
								--------------------------------
								if elements.autopiar.vr_text.v == '' then
									sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text_2.v))
								elseif elements.autopiar.vr_text_2.v == '' then
									sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
								else
									--------------------------------
									math.randomseed(os.time())
									local rand_vr = math.random(2)
									--------------------------------
									if rand_vr == 1 then
										sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
									else
										sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text_2.v))
									end
									--------------------------------
								end
							end
						end
					end
				end
				----------------------------------------
				imgui.Separator()
				imgui.PushItemWidth(460)
				imgui.InputText(u8('[/fam] Текст'),elements.autopiar.fam_text)
				imgui.InputText(u8('[/fam] Текст - 2'),elements.autopiar.fam_text_2)
				imgui.PushItemWidth(200)
				imgui.SliderInt(u8('[/fam] Задержка (мин.)'),elements.autopiar.fam_delay,1,60)
				if imgui.Checkbox(u8('[/fam] Активировать'),elements.autopiar.fam_active) then
					if elements.autopiar.fam_active.v == true then
						if elements.autopiar.fam_text.v == '' and elements.autopiar.fam_text_2.v == '' then
							elements.autopiar.fam_active.v = false	
						else
							if fam_timer < os.time() then
								--------------------------------
								fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
								--------------------------------
								if elements.autopiar.fam_text.v == '' then
									sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text_2.v))
								elseif elements.autopiar.fam_text_2.v == '' then
									sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
								else
									--------------------------------
									math.randomseed(os.time())
									local rand_fam = math.random(2)
									--------------------------------
									if rand_fam == 1 then
										sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
									else
										sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text_2.v))
									end
									--------------------------------
								end
							end
						end
					end
				end
				----------------------------------------
				imgui.Separator()
				imgui.PushItemWidth(460)
				imgui.InputText(u8('[/al] Текст'),elements.autopiar.al_text)
				imgui.InputText(u8('[/al] Текст - 2'),elements.autopiar.al_text_2)
				imgui.PushItemWidth(200)
				imgui.SliderInt(u8('[/al] Задержка (мин.)'),elements.autopiar.al_delay,1,60)
				if imgui.Checkbox(u8('[/al] Активировать'),elements.autopiar.al_active) then
					if elements.autopiar.al_active.v == true then
						if elements.autopiar.al_text.v == '' and elements.autopiar.al_text_2.v == '' then
							elements.autopiar.al_active.v = false	
						else
							if al_timer < os.time() then
								--------------------------------
								al_timer = os.time()+(elements.autopiar.al_delay.v*60)
								--------------------------------
								if elements.autopiar.al_text.v == '' then
									sampSendChat(u8:decode('/al '..elements.autopiar.al_text_2.v))
								elseif elements.autopiar.al_text_2.v == '' then
									sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
								else
									--------------------------------
									math.randomseed(os.time())
									local rand_al = math.random(2)
									--------------------------------
									if rand_al == 1 then
										sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
									else
										sampSendChat(u8:decode('/al '..elements.autopiar.al_text_2.v))
									end
									--------------------------------
								end
							end
						end
					end
				end
				----------------------------------------
			end
			----------------------------------------
			if type_window.v == 5 then
				--------------------[SPAM сообщения]--------------------
				imgui.TextColoredRGB(u8"{FF3300}SPAM сообщения:")
				imgui.Checkbox(u8('Отключить в чате SPAM сообщения'),elements.chat.removechatspam)
				imgui.SameLine()
				imgui.TextColoredRGB(u8"{8B00FF}(?)")
				----------------------------------------
				imgui.Hint('SPAM', u8'1. Удаляет рекламу от сервера.\n2. Удаляет сообщения в бандах об инкассаторах.\n3. Сообщения о собеседованиях.')
				----------------------------------------
				imgui.Checkbox(u8('Выводить SPAM сообщения в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsspam)
				--------------------[Настройки /fam чата]--------------------
				imgui.Separator()
				imgui.TextColoredRGB(u8"{FF3300}Настройки /fam чата:")
				imgui.Checkbox(u8('Выводить /fam сообщения в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsfam)
				--------------------[Настройки дальнего чата]--------------------
				imgui.Separator()
				imgui.TextColoredRGB(u8"{FF3300}Настройки дальнего чата:")
				imgui.Checkbox(u8('Включить дальний чат'),elements.chat.distant_active)
				if elements.config.del_stream.v == true then
					imgui.TextColoredRGB(u8('{FF3300}У тебя отключена зона прорисовки!'))
				end
				if elements.config.del_stream_pl.v == true then
					imgui.TextColoredRGB(u8('{FF3300}У тебя отключена зона прорисовки игроков!'))
				end
				imgui.PushItemWidth(370)
				imgui.SliderInt(u8('Кол-во строк'),elements.chat.distant_count,3,15)
				--------------------[Настройки Антифлуда]--------------------
				imgui.Separator()
				imgui.TextColoredRGB(u8"{FF3300}Настройки антифлуда:")
				imgui.PushItemWidth(300)
				imgui.SliderInt(u8('Антифлуд (мин.)'),elements.chat.antiflood_time,0,10)
			end
			----------------------------------------
			if type_window.v == 6 then
				imgui.Checkbox(u8('Отключить на сервере \'ковши\''),elements.destroy.bucket)
				imgui.Checkbox(u8('Отключить на сервере \'ёлки\''),elements.destroy.tree)
				imgui.Checkbox(u8('Отключить на сервере \'огромное сердце\''),elements.destroy.serdce)
				imgui.Checkbox(u8('Отключить на сервере \'хлам\''),elements.destroy.xlam)
				imgui.SameLine()
				imgui.TextColoredRGB(u8"{8B00FF}(?)")
				----------------------------------------
				imgui.Hint('XLAM', u8'Отключает:\n\
	Большой Куст #1\n\
	Большой Куст #2\n\
	Небольшое дерево #1\n\
	Небольшое дерево #2\n\
	INVALID_OBJECT_ID\n\
	INVALID_OBJECT_ID\n\
	Флаг\n\
	Граффити\n\
	Красный флажок\n\
	Красная гитара\n\
	Чёрно-белая гитара\n\
	Чёрная гитара\n\
	Праздничный торт')
				imgui.Checkbox(u8('Отключить на сервере \'новогодний маппинг\''),elements.destroy.newyear)
			end
			if type_window.v == 7 then
				imgui.Checkbox(u8'Включить авто-точилку',elements.autotoch.autotoch_enable)
				imgui.PushItemWidth(200)
				imgui.SliderInt(u8('На сколько будет точится аксессуар'),elements.autotoch.checked_radio,1,12)
				imgui.SliderInt(u8('Страница'),elements.autotoch.checked_inv,1,4)
				----------------------------------------
				imgui.SameLine()
				imgui.TextColoredRGB(u8"{8B00FF}(?)")
				----------------------------------------
				imgui.Hint('autotoch', u8'Страница инвентаря где хранятся точильные камни или амулеты.')
			end
			if type_window.v == 8 then
				----------------------------------------
				imgui.Checkbox(u8('Открывать стандартный сундук'),elements.chest.roll_standart)
				imgui.Checkbox(u8('Открывать платиновый сундук'),elements.chest.roll_platinum)
				imgui.Checkbox(u8('Открывать тайник Маска'),elements.chest.roll_maska)
				----------------------------------------
				imgui.PushItemWidth(81)
				imgui.InputInt(u8('Задержка в мин.'),elements.chest.roll_wait)
				if elements.chest.roll_wait.v < 1 then elements.chest.roll_wait.v = 1 end
				----------------------------------------
				if imgui.Checkbox(u8('Открывать сундуки'),elements.chest.roll_state) then
					if elements.chest.roll_state.v == true then
						windowstate.v = not windowstate.v
						lua_thread.create(function()
							if elements.chest.roll_standart.v == true then
								sampSendClickTextdraw(65535)
								active = true
								sampSendChat("/invent")
								wait(2500)
							end
							if elements.chest.roll_platinum.v == true then
								sampSendClickTextdraw(65535)
								wait(355)
								active2 = true
								sampSendChat("/invent")
								wait(2500)
							end
							if elements.chest.roll_maska.v == true then
								sampSendClickTextdraw(65535)
								wait(355)
								active3 = true
								sampSendChat("/invent")
								wait(2500)
							end
						end)
					end
				end
			end
			if type_window.v == 9 then
				imgui.PushItemWidth(113)
				----------------------------------------
				imgui.InputInt(u8('Цена  ##1'),elements.lavka.drugs_price)
				imgui.SameLine()
				imgui.InputInt(u8('Наркотики (кол-во)'),elements.lavka.drugs)
				if elements.lavka.drugs.v < 0 then elements.lavka.drugs.v = 0 end
				if elements.lavka.drugs_price.v < 0 then elements.lavka.drugs_price.v = 0 end
				if elements.lavka.drugs_price.v > 10000000 then elements.lavka.drugs_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##2'),elements.lavka.materials_price)
				imgui.SameLine()
				imgui.InputInt(u8('Материалы (кол-во)'),elements.lavka.materials)
				if elements.lavka.materials.v < 0 then elements.lavka.materials.v = 0 end
				if elements.lavka.materials_price.v < 0 then elements.lavka.materials_price.v = 0 end
				if elements.lavka.materials_price.v > 10000000 then elements.lavka.materials_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##3'),elements.lavka.fam_talon_price)
				imgui.SameLine()
				imgui.InputInt(u8('Семейный талон (кол-во)'),elements.lavka.fam_talon)
				if elements.lavka.fam_talon.v < 0 then elements.lavka.fam_talon.v = 0 end
				if elements.lavka.fam_talon_price.v < 0 then elements.lavka.fam_talon_price.v = 0 end
				if elements.lavka.fam_talon_price.v > 10000000 then elements.lavka.fam_talon_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##4'),elements.lavka.gift_price)
				imgui.SameLine()
				imgui.InputInt(u8('Подарки (кол-во)'),elements.lavka.gift)
				if elements.lavka.gift.v < 0 then elements.lavka.gift.v = 0 end
				if elements.lavka.gift_price.v < 0 then elements.lavka.gift_price.v = 0 end
				if elements.lavka.gift_price.v > 10000000 then elements.lavka.gift_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##5'),elements.lavka.cooper_roll_price)
				imgui.SameLine()
				imgui.InputInt(u8('Бронзовые рулетки (кол-во)'),elements.lavka.cooper_roll)
				if elements.lavka.cooper_roll.v < 0 then elements.lavka.cooper_roll.v = 0 end
				if elements.lavka.cooper_roll_price.v < 0 then elements.lavka.cooper_roll_price.v = 0 end
				if elements.lavka.cooper_roll_price.v > 10000000 then elements.lavka.cooper_roll_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##6'),elements.lavka.silver_roll_price)
				imgui.SameLine()
				imgui.InputInt(u8('Серебрянные рулетки (кол-во)'),elements.lavka.silver_roll)
				if elements.lavka.silver_roll.v < 0 then elements.lavka.silver_roll.v = 0 end
				if elements.lavka.silver_roll_price.v < 0 then elements.lavka.silver_roll_price.v = 0 end
				if elements.lavka.silver_roll_price.v > 10000000 then elements.lavka.silver_roll_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##7'),elements.lavka.gold_roll_price)
				imgui.SameLine()
				imgui.InputInt(u8('Золотые рулетки (кол-во)'),elements.lavka.gold_roll)
				if elements.lavka.gold_roll.v < 0 then elements.lavka.gold_roll.v = 0 end
				if elements.lavka.gold_roll_price.v < 0 then elements.lavka.gold_roll_price.v = 0 end
				if elements.lavka.gold_roll_price.v > 10000000 then elements.lavka.gold_roll_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##8'),elements.lavka.xlopok_price)
				imgui.SameLine()
				imgui.InputInt(u8('Хлопок (кол-во)'),elements.lavka.xlopok)
				if elements.lavka.xlopok.v < 0 then elements.lavka.xlopok.v = 0 end
				if elements.lavka.xlopok_price.v < 0 then elements.lavka.xlopok_price.v = 0 end
				if elements.lavka.xlopok_price.v > 10000000 then elements.lavka.xlopok_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##9'),elements.lavka.lens_price)
				imgui.SameLine()
				imgui.InputInt(u8('Лён (кол-во)'),elements.lavka.lens)
				if elements.lavka.lens.v < 0 then elements.lavka.lens.v = 0 end
				if elements.lavka.lens_price.v < 0 then elements.lavka.lens_price.v = 0 end
				if elements.lavka.lens_price.v > 10000000 then elements.lavka.lens_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##10'),elements.lavka.stone_price)
				imgui.SameLine()
				imgui.InputInt(u8('Камень (кол-во)'),elements.lavka.stone)
				if elements.lavka.stone.v < 0 then elements.lavka.stone.v = 0 end
				if elements.lavka.stone_price.v < 0 then elements.lavka.stone_price.v = 0 end
				if elements.lavka.stone_price.v > 10000000 then elements.lavka.stone_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##11'),elements.lavka.metal_price)
				imgui.SameLine()
				imgui.InputInt(u8('Металл (кол-во)'),elements.lavka.metal)
				if elements.lavka.metal.v < 0 then elements.lavka.metal.v = 0 end
				if elements.lavka.metal_price.v < 0 then elements.lavka.metal_price.v = 0 end
				if elements.lavka.metal_price.v > 10000000 then elements.lavka.metal_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##12'),elements.lavka.bronze_price)
				imgui.SameLine()
				imgui.InputInt(u8('Бронза (кол-во)'),elements.lavka.bronze)
				if elements.lavka.bronze.v < 0 then elements.lavka.bronze.v = 0 end
				if elements.lavka.bronze_price.v < 0 then elements.lavka.bronze_price.v = 0 end
				if elements.lavka.bronze_price.v > 10000000 then elements.lavka.bronze_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##13'),elements.lavka.silver_price)
				imgui.SameLine()
				imgui.InputInt(u8('Серебро (кол-во)'),elements.lavka.silver)
				if elements.lavka.silver.v < 0 then elements.lavka.silver.v = 0 end
				if elements.lavka.silver_price.v < 0 then elements.lavka.silver_price.v = 0 end
				if elements.lavka.silver_price.v > 10000000 then elements.lavka.silver_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##14'),elements.lavka.gold_price)
				imgui.SameLine()
				imgui.InputInt(u8('Золото (кол-во)'),elements.lavka.gold)
				if elements.lavka.gold.v < 0 then elements.lavka.gold.v = 0 end
				if elements.lavka.gold_price.v < 0 then elements.lavka.gold_price.v = 0 end
				if elements.lavka.gold_price.v > 10000000 then elements.lavka.gold_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##15'),elements.lavka.euro_price)
				imgui.SameLine()
				imgui.InputInt(u8('Евро (кол-во)'),elements.lavka.euro)
				if elements.lavka.euro.v < 0 then elements.lavka.euro.v = 0 end
				if elements.lavka.euro_price.v < 0 then elements.lavka.euro_price.v = 0 end
				if elements.lavka.euro_price.v > 10000000 then elements.lavka.euro_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##16'),elements.lavka.gr_talon_price)
				imgui.SameLine()
				imgui.InputInt(u8('Гражданский талон (кол-во)'),elements.lavka.gr_talon)
				if elements.lavka.gr_talon.v < 0 then elements.lavka.gr_talon.v = 0 end
				if elements.lavka.gr_talon_price.v < 0 then elements.lavka.gr_talon_price.v = 0 end
				if elements.lavka.gr_talon_price.v > 10000000 then elements.lavka.gr_talon_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##17'),elements.lavka.antibiotiki_price)
				imgui.SameLine()
				imgui.InputInt(u8('Антибиотики (кол-во)'),elements.lavka.antibiotiki)
				if elements.lavka.antibiotiki.v < 0 then elements.lavka.antibiotiki.v = 0 end
				if elements.lavka.antibiotiki_price.v < 0 then elements.lavka.antibiotiki_price.v = 0 end
				if elements.lavka.antibiotiki_price.v > 10000000 then elements.lavka.antibiotiki_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##18'),elements.lavka.prison_price)
				imgui.SameLine()
				imgui.InputInt(u8('Отмычки от ТСР (кол-во)'),elements.lavka.prison)
				if elements.lavka.prison.v < 0 then elements.lavka.prison.v = 0 end
				if elements.lavka.prison_price.v < 0 then elements.lavka.prison_price.v = 0 end
				if elements.lavka.prison_price.v > 10000000 then elements.lavka.prison_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##19'),elements.lavka.zlov_moneta_price)
				imgui.SameLine()
				imgui.InputInt(u8('Зловещая монета (кол-во)'),elements.lavka.zlov_moneta)
				if elements.lavka.zlov_moneta.v < 0 then elements.lavka.zlov_moneta.v = 0 end
				if elements.lavka.zlov_moneta_price.v < 0 then elements.lavka.zlov_moneta_price.v = 0 end
				if elements.lavka.zlov_moneta_price.v > 10000000 then elements.lavka.zlov_moneta_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##20'),elements.lavka.toch_stone_price)
				imgui.SameLine()
				imgui.InputInt(u8('Точильные камни (кол-во)'),elements.lavka.toch_stone)
				if elements.lavka.toch_stone.v < 0 then elements.lavka.toch_stone.v = 0 end
				if elements.lavka.toch_stone_price.v < 0 then elements.lavka.toch_stone_price.v = 0 end
				if elements.lavka.toch_stone_price.v > 10000000 then elements.lavka.toch_stone_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##21'),elements.lavka.bilet_6_price)
				imgui.SameLine()
				imgui.InputInt(u8('Билет 6 годовщины (кол-во)'),elements.lavka.bilet_6)
				if elements.lavka.bilet_6.v < 0 then elements.lavka.bilet_6.v = 0 end
				if elements.lavka.bilet_6_price.v < 0 then elements.lavka.bilet_6_price.v = 0 end
				if elements.lavka.bilet_6_price.v > 10000000 then elements.lavka.bilet_6_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##22'),elements.lavka.sticker_cluck_price)
				imgui.SameLine()
				imgui.InputInt(u8('Стикер Cluckin Bell (кол-во)'),elements.lavka.sticker_cluck)
				if elements.lavka.sticker_cluck.v < 0 then elements.lavka.sticker_cluck.v = 0 end
				if elements.lavka.sticker_cluck_price.v < 0 then elements.lavka.sticker_cluck_price.v = 0 end
				if elements.lavka.sticker_cluck_price.v > 10000000 then elements.lavka.sticker_cluck_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##23'),elements.lavka.sticker_binko_price)
				imgui.SameLine()
				imgui.InputInt(u8('Стикер Binko (кол-во)'),elements.lavka.sticker_binko)
				if elements.lavka.sticker_binko.v < 0 then elements.lavka.sticker_binko.v = 0 end
				if elements.lavka.sticker_binko_price.v < 0 then elements.lavka.sticker_binko_price.v = 0 end
				if elements.lavka.sticker_binko_price.v > 10000000 then elements.lavka.sticker_binko_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##24'),elements.lavka.sticker_jizzy_price)
				imgui.SameLine()
				imgui.InputInt(u8('Стикер Jizzy (кол-во)'),elements.lavka.sticker_jizzy)
				if elements.lavka.sticker_jizzy.v < 0 then elements.lavka.sticker_jizzy.v = 0 end
				if elements.lavka.sticker_jizzy_price.v < 0 then elements.lavka.sticker_jizzy_price.v = 0 end
				if elements.lavka.sticker_jizzy_price.v > 10000000 then elements.lavka.sticker_jizzy_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##25'),elements.lavka.platinum_roll_price)
				imgui.SameLine()
				imgui.InputInt(u8('Платиновая рулетка (кол-во)'),elements.lavka.platinum_roll)
				if elements.lavka.platinum_roll.v < 0 then elements.lavka.platinum_roll.v = 0 end
				if elements.lavka.platinum_roll_price.v < 0 then elements.lavka.platinum_roll_price.v = 0 end
				if elements.lavka.platinum_roll_price.v > 10000000 then elements.lavka.platinum_roll_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##26'),elements.lavka.fam_money_price)
				imgui.SameLine()
				imgui.InputInt(u8('Семейная монета (кол-во)'),elements.lavka.fam_money)
				if elements.lavka.fam_money.v < 0 then elements.lavka.fam_money.v = 0 end
				if elements.lavka.fam_money_price.v < 0 then elements.lavka.fam_money_price.v = 0 end
				if elements.lavka.fam_money_price.v > 10000000 then elements.lavka.fam_money_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##27'),elements.lavka.smazka_price)
				imgui.SameLine()
				imgui.InputInt(u8('Смазка для разгона видеокарт (кол-во)'),elements.lavka.smazka)
				if elements.lavka.smazka.v < 0 then elements.lavka.smazka.v = 0 end
				if elements.lavka.smazka_price.v < 0 then elements.lavka.smazka_price.v = 0 end
				if elements.lavka.smazka_price.v > 10000000 then elements.lavka.smazka_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##28'),elements.lavka.oxlajdauka_price)
				imgui.SameLine()
				imgui.InputInt(u8('Охлаждающая жидкость для видеокарты (кол-во)'),elements.lavka.oxlajdauka)
				if elements.lavka.oxlajdauka.v < 0 then elements.lavka.oxlajdauka.v = 0 end
				if elements.lavka.oxlajdauka_price.v < 0 then elements.lavka.oxlajdauka_price.v = 0 end
				if elements.lavka.oxlajdauka_price.v > 10000000 then elements.lavka.oxlajdauka_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##29'),elements.lavka.band_respect_price)
				imgui.SameLine()
				imgui.InputInt(u8('Бандитские респекты (кол-во)'),elements.lavka.band_respect)
				if elements.lavka.band_respect.v < 0 then elements.lavka.band_respect.v = 0 end
				if elements.lavka.band_respect_price.v < 0 then elements.lavka.band_respect_price.v = 0 end
				if elements.lavka.band_respect_price.v > 10000000 then elements.lavka.band_respect_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##30'),elements.lavka.AZ_coins_price)
				imgui.SameLine()
				imgui.InputInt(u8('AZ-Coins (кол-во)'),elements.lavka.AZ_coins)
				if elements.lavka.AZ_coins.v < 0 then elements.lavka.AZ_coins.v = 0 end
				if elements.lavka.AZ_coins_price.v < 0 then elements.lavka.AZ_coins_price.v = 0 end
				if elements.lavka.AZ_coins_price.v > 10000000 then elements.lavka.AZ_coins_price.v = 10000000 end
				----------------------------------------
				imgui.InputInt(u8('Цена  ##31'),elements.lavka.Moneta_8_god_price)
				imgui.SameLine()
				imgui.InputInt(u8('Монета 8-ой годовщины (кол-во)'),elements.lavka.Moneta_8_god)
				if elements.lavka.Moneta_8_god.v < 0 then elements.lavka.Moneta_8_god.v = 0 end
				if elements.lavka.Moneta_8_god_price.v < 0 then elements.lavka.Moneta_8_god_price.v = 0 end
				if elements.lavka.Moneta_8_god_price.v > 10000000 then elements.lavka.Moneta_8_god_price.v = 10000000 end
				----------------------------------------
			end
		imgui.EndChild()
		----------------------------------------
		imgui.EndGroup()
		imgui.End()
	end
end

function sampev.onSendClickTextDraw(textdrawId)
	if elements.state.showmodel == true then
		model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(textdrawId)
		if model ~= 0 and model ~= 65535 then
			sampAddChatMessage(string.format('Model: %d, %0.6f, %0.6f, %0.6f, %0.6f',model,rotX,rotY,rotZ,zoom),0xFF3300)
		end
	end
	if elements.state.showid == true then
		sampAddChatMessage(string.format('textdrawId: %d',textdrawId),0xFF3300)
	end
end

function sampev.onToggleSelectTextDraw(state, hovercolor)
	--------------------[RFam]--------------------
	if HideAllTextdraws then
		return false
	end
end

function sampev.onSetPlayerPos(position)
	--------------------[RFam]--------------------
	if RfamEnabled then
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Сервер изменил тебе координаты и скрипт отключился от греха.', 0xFFFFFF)
		thisScript():unload()
	end
end

function sampev.onShowTextDraw(textdrawId, data)
	--------------------[RFam]--------------------
	if HideAllTextdraws then
		return false
	end
	--------------------[Конвертация]--------------------
	if data.text:find("VC%$") and data.letterColor == -1436619914 then
		local vc_coins = string.match(data.text,'VC%$(%d+)')
		data.text = tostring(tonumber(vc_coins)*elements.config.convert.v)
	end
	if data.modelId == 1649 then
		--------------------[Первая строка]--------------------
		if data.position.x == 184.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 1 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 2 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 3 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 4 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 5 then
			elements.state.autoloot_number = 0
			--------------------[Вторая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 6 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 7 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 8 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 9 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 10 then
			elements.state.autoloot_number = 0
		--------------------[Третья строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 11 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 12 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 13 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 14 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 15 then
			elements.state.autoloot_number = 0
		--------------------[Четвертая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 16 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 17 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 18 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 19 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 20 then
			elements.state.autoloot_number = 0
		--------------------[Пятая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 21 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 22 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 23 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 24 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 25 then
			elements.state.autoloot_number = 0
		--------------------[Шестая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 26 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 27 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 28 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 29 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 30 then
			elements.state.autoloot_number = 0
		end
	end
	--------------------[Первая строка]--------------------
	if data.position.x == 209 and math.floor(data.position.y) == 186 then
		autoloot_td[1] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 186 then
		autoloot_td[2] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 186 then
		autoloot_td[3] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 186 then
		autoloot_td[4] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 186 then
		autoloot_td[5] = data.text
	--------------------[Вторая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 217 then
		autoloot_td[6] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 217 then
		autoloot_td[7] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 217 then
		autoloot_td[8] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 217 then
		autoloot_td[9] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 217 then
		autoloot_td[10] = data.text
	--------------------[Третья строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 247 then
		autoloot_td[11] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 247 then
		autoloot_td[12] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 247 then
		autoloot_td[13] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 247 then
		autoloot_td[14] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 247 then
		autoloot_td[15] = data.text
	--------------------[Четвертая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 278 then
		autoloot_td[16] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 278 then
		autoloot_td[17] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 278 then
		autoloot_td[18] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 278 then
		autoloot_td[19] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 278 then
		autoloot_td[20] = data.text
	--------------------[Пятая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 308 then
		autoloot_td[21] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 308 then
		autoloot_td[22] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 308 then
		autoloot_td[23] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 308 then
		autoloot_td[24] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 308 then
		autoloot_td[25] = data.text
	--------------------[Шестая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 339 then
		autoloot_td[26] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 339 then
		autoloot_td[27] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 339 then
		autoloot_td[28] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 339 then
		autoloot_td[29] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 339 then
		autoloot_td[30] = data.text
	end
	--------------------[Прочее - Заскринить]--------------------
	if data.modelId == 145 then sampAddChatMessage(data.modelId.." - Скин купить!", 0xFFFF00) end
	if data.modelId == 1182 then sampAddChatMessage(string.format(data.modelId.." - Железная маска 2 заскринить TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1336 then sampAddChatMessage(string.format(data.modelId.." - Рюкзак доставки заскринить TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 3877 then sampAddChatMessage(string.format(data.modelId.." - Дубина заскринить TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	--------------------[Авто-точилка аксессуаров]--------------------
	if data.modelId == 16112 or data.modelId == 1615 then
		if elements.autotoch.autotoch_active then
			lua_thread.create(function()
				if textdrawId ~= 2108 and elements.autotoch.autotoch_active == true then
					elements.autotoch.autotoch_active = false
					wait(500)
					sampSendClickTextdraw(textdrawId)
					wait(500)
					sampSendClickTextdraw(2077)
				else
					elements.autotoch.autotoch_active = false
					wait(500)
					sampSendClickTextdraw(2077)
				end
			end)
		end
	end
	--------------------[Авто-открытие сундуков]--------------------
	local ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.3" or -- PHOENIX
		ip == "185.169.134.4" or -- TUCSON
		ip == "185.169.134.43" or -- SCOTTDALE
		ip == "185.169.134.44" or -- CHANDLER
		ip == "185.169.134.45" or -- BRAINBURG
		ip == "185.169.134.5" or -- SAINT ROSE
		ip == "185.169.134.59" or -- MESA
		ip == "185.169.134.61" or -- RED ROCK
		ip == "185.169.134.107" or -- YUMA
		ip == "185.169.134.109" or -- SURPRISE
		ip == "185.169.134.166" or -- PRESCOTT
		ip == "185.169.134.171" or -- GLENDALE
		ip == "185.169.134.172" or -- KINGMAN
		ip == "185.169.134.173" or -- WINSLOW
		ip == "185.169.134.174" or -- PAYSON
		ip == "80.66.82.191" or -- GILBERT
		ip == "80.66.82.190" or -- SHOW-LOW
		ip == "80.66.82.188" or -- CASA GRANDE
		ip == "80.66.82.168" or -- PAGE
		ip == "80.66.82.159" or -- SUN CITY
		ip == "80.66.82.190" then -- QUEEN CREEK
		if elements.chest.roll_state.v == true and active then
			lua_thread.create(function()
				if data.modelId == 19918 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use then
					sampSendClickTextdraw(textdrawId + 1)
					use = false
					close = true
				end
				if close then
					sampSendClickTextdraw(65535)
					close = false
					active = false
				end
			end)
		end
		----------------------------------------
		if elements.chest.roll_state.v == true and active2 then
			lua_thread.create(function()
				if data.modelId == 1353 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use2 = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use2 then
					sampSendClickTextdraw(textdrawId + 1)
					use2 = false
					close2 = true
				end
				if close2 then
					sampSendClickTextdraw(65535)
					close2 = false
					active2 = false
				end
			end)
		end
		----------------------------------------
		if elements.chest.roll_state.v == true and active3 then
			lua_thread.create(function()
				if data.modelId == 1733 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use3 = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use3 then
					sampSendClickTextdraw(textdrawId + 1)
					use3 = false
					close3 = true
				end
				if close3 then
					sampSendClickTextdraw(65535)
					close3 = false
					active3 = false
				end
			end)
		end
		----------------------------------------
	end
	--------------------[Удаление текстдравов]--------------------
	if data.position.x == 34 and data.position.y == 230 then
		return false
	end
	if data.position.x == 37 and data.position.y == 233 then
		return false
	end
	if data.position.x == 39 and data.position.y == 235 then
		return false
	end
	if data.position.x == 18 and data.position.y == 182 then
		return false
	end
	if data.position.x == 66 and data.position.y == 232 then
		return false
	end
	if data.position.x == 66 and data.position.y == 240 then
		return false
	end
	if data.position.x == 79 and data.position.y == 248 then
		return false
	end
	if data.position.x == 85 and data.position.y == 256 then
		return false
	end
	----------------------------------------
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 32 and data.position.y == 204 then
		return false
	end
	if data.position.x == -8 and data.position.y == 198 then
		return false
	end
	if data.position.x == 70 and data.position.y == 204 then
		return false
	end
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 71 and data.position.y == 215 then
		return false
	end
	if data.position.x == 72 and data.position.y == 224 then
		return false
	end
	----------------------------------------
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 32 and data.position.y == 204 then
		return false
	end
	if data.position.x == 36 and data.position.y == 208 then
		return false
	end
	if data.position.x == -9 and data.position.y == 198 then
		return false
	end
	if data.position.x == 74 and data.position.y == 204 then
		return false
	end
	if data.position.x == 74 and data.position.y == 215 then
		return false
	end
	if data.position.x == 74 and data.position.y == 224 then
		return false
	end
	----------------------------------------
	return {textdrawId, data}
end

function sampev.onDisplayGameText(style, time, text)
	----------------------------------------
	if isCharInAnyCar(PLAYER_PED) then
		carhandle = storeCarCharIsInNoSave(PLAYER_PED)
		if getCarModel(carhandle) == 456 then
			if string.find(text,"-12000%$") then
				prodovoz_timer = os.time()+240
			end
		end
	end
	----------------------------------------
	if text:find('Go to the lottery') then
		sampAddChatMessage('['..thisScript().name..' (L){FFFFFF}] Посети лотерейную!', 0xFFFFFF)
		return false
	end
	----------------------------------------
	if text:find('-1 HP') or
	text:find('-2 HP') or
	text:find('-3 HP') or
	text:find('-4 HP') or
	text:find('-5 HP') or
	text:find('-6 HP') or
	text:find('-7 HP') or
	text:find('-8 HP') or
	text:find('-9 HP') or
	text:find('-10 HP') or
	text:find('+1 HP') or
	text:find('+2 HP') or
	text:find('+3 HP') or
	text:find('+4 HP') or
	text:find('+5 HP') or
	text:find('+6 HP') or
	text:find('+7 HP') or
	text:find('+8 HP') or
	text:find('+9 HP') or
	text:find('+10 HP') or
	text:find('You are hungry!') or
	text:find('You are very hungry!') or
	text:find('attention') then
		return false
	end
	if not isCharInAnyCar(1) then
		if text:find('Press: ~g~Y') then
			_, myId = sampGetPlayerIdByCharHandle(PLAYER_PED)
			RakNet = allocateMemory(68)
			sampStorePlayerOnfootData(myId, RakNet)
			setStructElement(RakNet, 36, 1, 64, false)
			sampSendOnfootData(RakNet)
			sampSendOnfootData(RakNet)
			freeMemory(RakNet)
		end
		if text:find('Press: ~r~N') then
			_, myId = sampGetPlayerIdByCharHandle(PLAYER_PED)
			RakNet = allocateMemory(68)
			sampStorePlayerOnfootData(myId, RakNet)
			setStructElement(RakNet, 36, 1, 128, false)
			sampSendOnfootData(RakNet)
			sampSendOnfootData(RakNet)
			freeMemory(RakNet)
		end
	end
end

function sampev.onServerMessage(color, text)
	----------------------------------------
	if RfamEnabled and (text:match("Произошла ошибка, игрок состоит в другой семьи") or text:match("Произошла ошибка, вы уже приглашали этого игрока")) then
		return false
	end
	if RfamEnabled and (text:match("Произошла ошибка, игрок состоит в другой семьи") or text:match("Произошла ошибка, вы уже приглашали этого игрока")) then
		return false
	end
	if text:match("Вы тут?") or
	text:match("Вы тут") or
	text:match("вы тут?") or
	text:match("вы тут") or
	text:match("Вы здесь?") or
	text:match("Вы здесь") or
	text:match("вы здесь?") or
	text:match("вы здесь") or
	text:match("Вы за компьютером?") or
	text:match("Вы за компьютером") or
	text:match("вы за компьютером?") or
	text:match("вы за компьютером") or
	text:match("Вы афк?") or
	text:match("Вы афк") or
	text:match("вы афк?") or
	text:match("вы афк") or
	text:match("Вы АФК?") or
	text:match("Вы АФК") or
	text:match("вы АФК?") or
	text:match("вы АФК") or
	text:match("ответ в чат") or
	text:match("ответ в /b") or
	text:match("ответ в /n") then
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Скрипт заподозрил шо до тебя доебался админ и решил выключится.', 0xFFFFFF)
		thisScript():unload()
	end
	if text:find('Администратор ') and text:find('ответил вам:') and (text:match('.+ (%d+) %+ (%d+) %+ (%d+).*') or text:match('.+ (%d+)%+(%d+)%+(%d+).*')) then
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Скрипт заподозрил шо до тебя доебался админ и решил выключится.', 0xFFFFFF)
		thisScript():unload()
	end
	----------------------------------------
	if elements.state.autoloot == true and text:find('Подождите немного...') then
		return false
	end
	----------------------------------------
	if elements.chat.chatlog.v == true and text ~= ' ' and sampGetCurrentServerAddress() ~= "127.0.0.1" then
		----------------------------------------
		if not doesDirectoryExist("moonloader\\logs\\"..sampGetCurrentServerAddress()) then createDirectory("moonloader\\logs\\"..sampGetCurrentServerAddress()) end
		----------------------------------------
		local file_logs = io.open('moonloader/logs/'..sampGetCurrentServerAddress()..'/'..os.date('%d-%m-%Y')..'.txt', 'a+')
		if file_logs ~= -1 and file_logs ~= nil then
			file_logs:write('['..os.date('%d-%m-%Y || %H:%M:%S')..']['..color..'] '..text..'\n')
			file_logs:close()
		end
	end
	--------------------[Авто-точилка аксессуаров]--------------------
	if text:find('Увы, вам не удалось улучшить предмет') and elements.autotoch.autotoch_enable.v == true then
		elements.autotoch.autotoch_active = true
		inventory(elements.autotoch.checked_inv.v)
	end
	if text:find('Успех! Вам удалось улучшить предмет') and elements.autotoch.autotoch_enable.v == true then
		number = string.match(text, 'на ++(%d+)')+0
		if number < elements.autotoch.checked_radio.v and elements.autotoch.autotoch_enable.v == true then
			elements.autotoch.autotoch_active = true
			inventory(elements.autotoch.checked_inv.v)
		end
	end
	----------------------------------------
	if text:find("купил у вас") or text:find("Вы купили") or text:find("Вы успешно купили") then
		sampfuncsLog('{FDDB6D}'..os.date('[%H:%M:%S] ')..text)
	end
	----------------------------------------
	if (text:find("В нашем магазине ты можешь приобрести нужное количество игровых денег и потратить") or
		text:find("их на желаемый тобой") or
		text:find("имеют большие возможности") or
		text:find("можно приобрести редкие") or
		text:find("которые выделят тебя из толпы")) and color == 1687547391 or
		----------------------------------------
		(text:find("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~") or
		text:find("Основные команды сервера:") or
		text:find("Пригласи друга и получи") or
		text:find("Наш сайт:")) and color == -89368321 or
		----------------------------------------
		text:find("С помощью телефона можно заказать такси") and color == -170229249 or
		----------------------------------------
		text:find("Битва за контроль грузового корабля начнется через") and color == -10270721 or
		----------------------------------------
		text:find("Ларец кастомных аксессуаров") and color == 833881343 or
		----------------------------------------
		text:find("Адвокат: ") and color == -1347440641 or
		----------------------------------------
		text:find("минут начинается распродажа одежды в секонд") and color == -65281 or
		----------------------------------------
		((text:find(" ") and string.len(text) == 1) and color == -1) or
		----------------------------------------
		(text:find("Вы можете купить складское помещение") or
		text:find("Этот тип недвижимости будет навсегда закреплен за вами и за него не нужно платить") or
		text:find("Таким образом вы можете сберечь своё имущество, даже если вас забанят") or
		text:find("В нашем магазине ты можешь приобрести нужное количество игровых денег и потратить") or
		text:find("их на желаемый тобой") and color == 1687547391) or
		----------------------------------------
		(text:find("Уважаемые жители штата! Минуточку внимания") or
		text:find("В данный момент проходит собеседование") or
		text:find("Для Вступления необходимо прибыть в") and color == 73381119) or
		----------------------------------------
		text:find("начал работу новый инкассатор") or
		text:find("Убив его, вы сможете получить деньги") or
		text:find("Со склада Армии") then
		if elements.chat.tosampfuncsspam.v == true then
			sampfuncsLog(os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removechatspam.v == true then
			return false
		end
	end
	----------------------------------------
	if (text:find("%[Семья%]") or text:find("%[Семья .Новости.%]")) and color == -1178486529 then
		if elements.chat.tosampfuncsfam.v == true then
			sampfuncsLog('{AFAFAF}'..os.date('[%H:%M:%S] ')..text)
		end
	end
	----------------------------------------
	if (text:find("кричит") and color == -253326081) then
		if elements.config.del_shout.v == true then
			return false
		end
	end
	----------------------------------------
	if text:find('Попробуйте через {FF6347}') then
		second = string.match(text,'Попробуйте через {FF6347}(%d+)')
		prodovoz_timer = os.time()+second
	end
	----------------------------------------
	if not finished and message_vr ~= nil then
		if text:find('^%[Ошибка%].*После последнего сообщения в этом чате нужно подождать') then
			lua_thread.create(function()
				local delay_autovr = 0.5
				wait(delay_autovr * 1000);
				sampSendChat('/vr ' .. message_vr)
			end)
			return false
		end
		------------------------------------
		local id = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))
		if text:match('%[%u+%] {%x+}[A-z0-9_]+%[' .. id .. '%]:') then
			finished = true
		end
		------------------------------------
	end
	----------------------------------------
	if text:find('^Вы заглушены') or text:find('Для возможности повторной отправки сообщения в этот чат') then
		finished = true
	end
	----------------------------------------
	if elements.state.buyvk ~= -1 then
		if text:find("для приобретения данной периферии") then
			elements.state.buyvk = -1
			push_message('Выключаю покупку VK-Coins.')
		end
	end
	----------------------------------------
	if not text:find(local_name) and
	((text:find("%[Механик%]") and color == -2686721) or
	(text:find("%[Развозчик продуктов%]") and color == -2686721) or
	(text:find("%[Крупье%]") and color == -2686721) or
	(text:find("%[Работник Налоговой%]") and color == -2686721) or
	(text:find("%[Инкассатор%]") and color == -2686721) or
	(text:find("%[Дальнобойщик%]") and color == -2686721) or
	(text:find("%[Развозчик металлолома%]") and color == -2686721) or
	(text:find("%[Мусорщик%]") and color == -2686721) or
	(text:find("%[Водитель автобуса%]") and color == -2686721) or
	(text:find("%[Пожарный%]") and color == -2686721) or
	(text:find("%[Водитель трамвая%]") and color == -2686721) or
	(text:find("%[Машинист электропоезда%]") and color == -2686721) or
	(text:find("%[Главный фермер%]") and color == -2686721) or
	(text:find("%[Руководитель грузчиков%]") and color == -2686721) or
	(text:find("%[Руководитель завода%]") and color == -2686721) or
	(text:find("%[Ремонтник дорог%]") and color == -2686721) or
	(text:find("%[Продавец хотдогов%]") and color == -2686721) or
	(text:find("%[Развозчик пиццы%]") and color == -2686721) or
	(text:find("%[Адвокат%]") and color == -2686721) or
	(text:find("%[Таксист%]") and color == -2686721) or
	(text:find("%[Пилот%]") and color == -2686721) or
	(text:find("%[Грузчик%]") and color == -2686721) or
	(text:find("%[PREMIUM%]") and color == -1) or
	(text:find("%[VIP%]") and color == -1) or
	(text:find("%[PREMIUM%]") and color == -213517057) or
	(text:find("%[VIP%]") and color == 1687547391) or
	(text:find("%[Семья%]") and color == -1178486529) or
	(text:find("%[Альянс") and color == -1178486529) or
	(text:find("%[F%]") and color == 766526463) or
	(text:find("%[D%]")) or
	(text:find("Подождите немного...")) or
	(text:find("Вы должны находиться рядом с багажником выбранного транспорта") and color == -1104335361) or
	(text:find("Микрофон") and color == -1863723265) or
	(text:find("очень громко кашлянул") and color == -6684673) or
	(text:find("забрал с общака") and color == -1347440641) or
	(text:find("говорит") and color == -1) or
	(text:find("кричит") and color == -253326081)) then
		if messagesFloodTab[text] ~= nil then
			if messagesFloodTab[text].Message == text and messagesFloodTab[text].Timestamp >= os.time() then
				return false
			else
				messagesFloodTab[text] =
				{
					Message = text,
					Timestamp = os.time()+(elements.chat.antiflood_time.v*60)
				}
			end
		else
			messagesFloodTab[text] =
			{
				Message = text,
				Timestamp = os.time()+(elements.chat.antiflood_time.v*60)
			}
		end
	end
end

function sampev.onSetPlayerName(playerid, name, success)
	for i = 1, #friends do
		if name:find(friends[i]) and not local_name:find(friends[i]) then
			sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..name..'['..playerid..'] заходит на сервер (2).')
			sampAddChatMessage(name..'['..playerid..'] заходит на сервер (2).', 0xFF3300)
		end
	end
	----------------------------------------
end

function sampev.onPlayerJoin(playerid, color, isNpc, nickname)
	for i = 1, #friends do
		if nickname:find(friends[i]) and not local_name:find(friends[i]) then
			sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] заходит на сервер.')
			sampAddChatMessage(nickname..'['..playerid..'] заходит на сервер.', 0xFF3300)
		end
	end
	----------------------------------------
end

function sampev.onPlayerQuit(playerid, reason)
	for i = 1, #friends do
		nickname = sampGetPlayerNickname(playerid)
		if nickname:find(friends[i]) then
			----------------------------------------
			if reason == 0 then reason_s = string.format("Ошибка")
			elseif reason == 1 then reason_s = string.format("Вышел")
			else reason_s = string.format("Кик/Бан") end
			----------------------------------------
			sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s)
			sampAddChatMessage(nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s, 0xFF3300)
		end
	end
	----------------------------------------
end

function sampev.onSetVehicleParamsEx(vehicleId, params, doors, windows)
	if elements.config.del_stream.v == true then
		return false
	end
	if params.boot == 1 then
		carid = vehicleId
	end
	if carid == vehicleId and params.boot == 0 then
		carid = -1
		printString('',0)
	end
end

function sampev.onVehicleStreamOut(vehicleId)
	if carid ~= -1 and carid == vehicleId then
		carid = -1
		printString('',0)
	end
	if sampIs3dTextDefined(vehicleId) then
		list3d[vehicleId] = nil
		sampDestroy3dText(vehicleId)
	end
end

function sampev.onPlayerStreamIn(playerId, team, model, position, rotation, color, fightingStyle)
	local friend = false
	nickname = sampGetPlayerNickname(playerId)
	for id = 1, #friends do
		if nickname:find(friends[id]) then
			friend = true
		end
	end
	if friend == false then
		if elements.config.del_stream.v == true then
			return false
		end
		if elements.config.del_stream_pl.v == true then
			return false
		end
	end
end

function sampev.onVehicleStreamIn(vehicleId, data)
	if elements.config.del_stream.v == true then
		return false
	end
	if elements.config.del_stream_veh.v == true then
		return false
	end
	--------------------[Эмулятор]--------------------
	-- if data.type > 611 or data.type < 400 then
		--------------------------------------
		-- local name_vehicle = 'Неизвестно'
		--------------------------------------
		-- if data.type == 4793 then data.type = 579 name_vehicle = 'Mercedes-Benz X Class'
		-- elseif data.type == 4794 then data.type = 560 name_vehicle = 'Jaguar XF'
		-- elseif data.type == 4796 then data.type = 483 name_vehicle = 'Dodge Grand Caravan'
		-- elseif data.type == 4797 then data.type = 475 name_vehicle = 'Dodge Charger'
		-- elseif data.type == 4798 then data.type = 579 name_vehicle = 'Ford Explorer'
		-- elseif data.type == 4799 then data.type = 579 name_vehicle = 'Ford F150'
		-- elseif data.type == 4800 then data.type = 593 name_vehicle = 'Deltaplane'
		-- elseif data.type == 4801 then data.type = 473 name_vehicle = 'Sea Shark'
		-- elseif data.type == 4802 then data.type = 451 name_vehicle = 'Lamborghini Cantenario'
		-- elseif data.type == 4803 then data.type = 411 name_vehicle = 'Ferrari 812 Superfast'
		-- elseif data.type == 6604 then data.type = 560 name_vehicle = 'Audi A6'
		-- elseif data.type == 6605 then data.type = 579 name_vehicle = 'Audi Q7'
		-- elseif data.type == 6606 then data.type = 560 name_vehicle = 'BMW M6 2020'
		-- elseif data.type == 6607 then data.type = 429 name_vehicle = 'BMW M6 1990'
		-- elseif data.type == 6608 then data.type = 560 name_vehicle = 'Mercedes CLA 45 AMG'
		-- elseif data.type == 6609 then data.type = 560 name_vehicle = 'Mercedes CLS 63 AMG'
		-- elseif data.type == 6610 then data.type = 400 name_vehicle = 'Haval H6 2.0 GDIT'
		-- elseif data.type == 6611 then data.type = 579 name_vehicle = 'Toyota Land Cruiser VXR V8 4'
		-- elseif data.type == 6612 then data.type = 534 name_vehicle = 'Lincoln Continental'
		-- elseif data.type == 6613 then data.type = 579 name_vehicle = 'Porsche Macan Turbo'
		-- elseif data.type == 6614 then data.type = 547 name_vehicle = 'Daewoo Matiz'
		-- elseif data.type == 6615 then data.type = 470 name_vehicle = 'Mercedes-AMG G63 6x6'
		-- elseif data.type == 6616 then data.type = 560 name_vehicle = 'Mercedes E-63 AMG'
		-- elseif data.type == 6617 then data.type = 444 name_vehicle = 'Monster Mutt'
		-- elseif data.type == 6618 then data.type = 556 name_vehicle = 'Monster Indonesia'
		-- elseif data.type == 6619 then data.type = 557 name_vehicle = 'Monster El Toro'
		-- elseif data.type == 6620 then data.type = 557 name_vehicle = 'Monster Grave Digger'
		-- elseif data.type == 6621 then data.type = 579 name_vehicle = 'Toyota Land Cruiser Prado'
		-- elseif data.type == 6622 then data.type = 400 name_vehicle = 'Toyota RAV4'
		-- elseif data.type == 6623 then data.type = 559 name_vehicle = 'Toyota Supra A90'
		-- elseif data.type == 6624 then data.type = 400 name_vehicle = 'UAZ'
		-- elseif data.type == 6625 then data.type = 400 name_vehicle = 'Volvo XC90 2012'
		-- elseif data.type == 12713 then data.type = 400 name_vehicle = 'Mercedes-Benz GLE 63'
		-- elseif data.type == 12714 then data.type = 559 name_vehicle = 'Renault Laguna'
		-- elseif data.type == 12715 then data.type = 560 name_vehicle = 'Mercedes-Benz CLS 53'
		-- elseif data.type == 12716 then data.type = 558 name_vehicle = 'Audi RS5'
		-- elseif data.type == 12717 then data.type = 400 name_vehicle = 'Cadillac Escalade 2020'
		-- elseif data.type == 12718 then data.type = 489 name_vehicle = 'Cyber Truck'
		-- elseif data.type == 12719 then data.type = 560 name_vehicle = 'Tesla Model C'
		-- elseif data.type == 12720 then data.type = 541 name_vehicle = 'Ford GT'
		-- elseif data.type == 12721 then data.type = 541 name_vehicle = 'Dodge Viper'
		-- elseif data.type == 12722 then data.type = 547 name_vehicle = 'Volkswagen Polo'
		-- elseif data.type == 12723 then data.type = 551 name_vehicle = 'Mitsubishi Lancer Old'
		-- elseif data.type == 12724 then data.type = 587 name_vehicle = 'Audi TT RS'
		-- elseif data.type == 12725 then data.type = 515 name_vehicle = 'Mercedes-Benz Actros'
		-- elseif data.type == 12726 then data.type = 560 name_vehicle = 'Audi S4'
		-- elseif data.type == 12727 then data.type = 429 name_vehicle = 'BMW 4-Series'
		-- elseif data.type == 12728 then data.type = 490 name_vehicle = 'Cadillac Escalade 2007'
		-- elseif data.type == 12729 then data.type = 550 name_vehicle = 'Toyota Chaser'
		-- elseif data.type == 12730 then data.type = 585 name_vehicle = 'Dacia 1300'
		-- elseif data.type == 12731 then data.type = 560 name_vehicle = 'Mitsubishi Lancer'
		-- elseif data.type == 12732 then data.type = 412 name_vehicle = 'Impala 64'
		-- elseif data.type == 12733 then data.type = 542 name_vehicle = 'Impala 67'
		-- elseif data.type == 12734 then data.type = 515 name_vehicle = 'Coca-Cola Truck'
		-- elseif data.type == 12735 then data.type = 435 name_vehicle = 'Coca-Cola Trailer'
		-- elseif data.type == 12736 then data.type = 411 name_vehicle = 'McLaren MP4'
		-- elseif data.type == 12737 then data.type = 439 name_vehicle = 'Ford Mustang Mach 1'
		-- elseif data.type == 12738 then data.type = 560 name_vehicle = 'Rolls-Royce Phantom'
		-- elseif data.type == 12739 then data.type = 554 name_vehicle = 'Pickup truck'
		-- elseif data.type == 12740 then data.type = 515 name_vehicle = 'Volvo Truck'
		-- elseif data.type == 12741 then data.type = 560 name_vehicle = 'Subaru WRX'
		-- elseif data.type == 12742 then data.type = 471 name_vehicle = 'Sherp'
		-- elseif data.type == 12743 then data.type = 574 name_vehicle = 'Christma'
		-- elseif data.type == 14119 then data.type = 560 name_vehicle = 'Audi A6 (delimobil)'
		-- elseif data.type == 14120 then data.type = 560 name_vehicle = 'Toyota Camry (delimobil)'
		-- elseif data.type == 14121 then data.type = 400 name_vehicle = 'Kia Sportage (delimobil)'
		-- elseif data.type == 14122 then data.type = 579 name_vehicle = 'Tesla Model X (delimobil)'
		-- elseif data.type == 14123 then data.type = 400 name_vehicle = 'Toyota RAV4 (delimobil)'
		-- elseif data.type == 612 then data.type = 579 name_vehicle = 'Mercedes GT63s AMG'
		-- elseif data.type == 613 then data.type = 579 name_vehicle = 'Mercedes G63 AMG'
		-- elseif data.type == 614 then data.type = 458 name_vehicle = 'Audi RS6'
		-- elseif data.type == 662 then data.type = 579 name_vehicle = 'BMW X5m'
		-- elseif data.type == 663 then data.type = 415 name_vehicle = 'Chevrolet Corvette'
		-- elseif data.type == 665 then data.type = 404 name_vehicle = 'Chevrolet Cruze'
		-- elseif data.type == 666 then data.type = 579 name_vehicle = 'Lexus LX570'
		-- elseif data.type == 667 then data.type = 480 name_vehicle = 'Porsche 911'
		-- elseif data.type == 668 then data.type = 479 name_vehicle = 'Porsche Cayenne S'
		-- elseif data.type == 699 then data.type = 466 name_vehicle = 'Bentley'
		-- elseif data.type == 793 then data.type = 559 name_vehicle = 'BMW M8'
		-- elseif data.type == 794 then data.type = 560 name_vehicle = 'Mercedes E63s AMG'
		-- elseif data.type == 909 then data.type = 559 name_vehicle = 'Mercedes S63 Coupe AMG'
		-- elseif data.type == 965 then data.type = 579 name_vehicle = 'Volkswagen Touareg'
		-- elseif data.type == 1194 then data.type = 579 name_vehicle = 'Lamborghini Urus'
		-- elseif data.type == 1195 then data.type = 579 name_vehicle = 'Audi Q8'
		-- elseif data.type == 1196 then data.type = 603 name_vehicle = 'Dodge Challenger SRT'
		-- elseif data.type == 1197 then data.type = 411 name_vehicle = 'Acura NSX'
		-- elseif data.type == 1198 then data.type = 400 name_vehicle = 'Volvo V60'
		-- elseif data.type == 1199 then data.type = 589 name_vehicle = 'Range Rover Evoque'
		-- elseif data.type == 1200 then data.type = 550 name_vehicle = 'Honda Civic Type-R'
		-- elseif data.type == 1201 then data.type = 560 name_vehicle = 'Lexus Sport-S'
		-- elseif data.type == 1202 then data.type = 475 name_vehicle = 'Ford Mustang GT'
		-- elseif data.type == 1203 then data.type = 400 name_vehicle = 'Volvo XC90'
		-- elseif data.type == 1204 then data.type = 579 name_vehicle = 'Jaguar F-pace'
		-- elseif data.type == 1205 then data.type = 507 name_vehicle = 'Kia Optima'
		-- elseif data.type == 3155 then data.type = 402 name_vehicle = 'BMW Z4 40i'
		-- elseif data.type == 3156 then data.type = 445 name_vehicle = 'Mercedes-Benz S600 W124'
		-- elseif data.type == 3157 then data.type = 400 name_vehicle = 'BMW X5 E53'
		-- elseif data.type == 3158 then data.type = 562 name_vehicle = 'Nissan Skyline R34'
		-- elseif data.type == 3194 then data.type = 522 name_vehicle = 'Ducati Diavel'
		-- elseif data.type == 3195 then data.type = 522 name_vehicle = 'Ducati Panigale'
		-- elseif data.type == 3196 then data.type = 522 name_vehicle = 'Ducati Ducnaked'
		-- elseif data.type == 3197 then data.type = 522 name_vehicle = 'Kawasaki Ninja ZX-10RR'
		-- elseif data.type == 3198 then data.type = 463 name_vehicle = 'Western'
		-- elseif data.type == 3199 then data.type = 579 name_vehicle = 'Rolls-Royce Cullinan'
		-- elseif data.type == 3200 then data.type = 500 name_vehicle = 'Volkswagen Beetle'
		-- elseif data.type == 3201 then data.type = 411 name_vehicle = 'Bugatti Divo Sport'
		-- elseif data.type == 3202 then data.type = 411 name_vehicle = 'Bugatti Chiron'
		-- elseif data.type == 3203 then data.type = 500 name_vehicle = 'Fiat 500'
		-- elseif data.type == 3204 then data.type = 579 name_vehicle = 'Mercedes-Benz GLS 2020'
		-- elseif data.type == 3205 then data.type = 579 name_vehicle = 'Mercedes G65 AMG'
		-- elseif data.type == 3206 then data.type = 411 name_vehicle = 'Lamborghini Aventador SVJ'
		-- elseif data.type == 3207 then data.type = 579 name_vehicle = 'Range Rover SVA'
		-- elseif data.type == 3208 then data.type = 507 name_vehicle = 'BMW 530i E39'
		-- elseif data.type == 3209 then data.type = 445 name_vehicle = 'Mercedes-Benz S600'
		-- elseif data.type == 3210 then data.type = 579 name_vehicle = 'Tesla Model X'
		-- elseif data.type == 3211 then data.type = 516 name_vehicle = 'Nissan LEAF'
		-- elseif data.type == 3212 then data.type = 562 name_vehicle = 'Nissan Silvia S15'
		-- elseif data.type == 3213 then data.type = 561 name_vehicle = 'Subaru Forester XT'
		-- elseif data.type == 3215 then data.type = 546 name_vehicle = 'Subaru Legacy 1989'
		-- elseif data.type == 3216 then data.type = 551 name_vehicle = 'Hyundai Sonata'
		-- elseif data.type == 3217 then data.type = 540 name_vehicle = 'BMW 750i E38'
		-- elseif data.type == 3218 then data.type = 445 name_vehicle = 'Mercedes-Benz E 55 AMG'
		-- elseif data.type == 3219 then data.type = 445 name_vehicle = 'Mercedes-Benz E500'
		-- elseif data.type == 3220 then data.type = 451 name_vehicle = 'Jackson Storm'
		-- elseif data.type == 3222 then data.type = 451 name_vehicle = 'Lightning McQueen'
		-- elseif data.type == 3223 then data.type = 525 name_vehicle = 'Sir Tow Mater'
		-- elseif data.type == 3224 then data.type = 487 name_vehicle = 'Buckingham'
		-- elseif data.type == 3232 then data.type = 579 name_vehicle = 'Infiniti FX 50'
		-- elseif data.type == 3233 then data.type = 579 name_vehicle = 'Lexus RX 450h'
		-- elseif data.type == 3234 then data.type = 400 name_vehicle = 'Kia Sportage'
		-- elseif data.type == 3235 then data.type = 400 name_vehicle = 'Volkswagen Golf R'
		-- elseif data.type == 3236 then data.type = 411 name_vehicle = 'Audi R8'
		-- elseif data.type == 3237 then data.type = 560 name_vehicle = 'Toyota Camry XV40'
		-- elseif data.type == 3238 then data.type = 560 name_vehicle = 'Toyota Camry XV70'
		-- elseif data.type == 3239 then data.type = 560 name_vehicle = 'BMW M5 E60'
		-- elseif data.type == 3240 then data.type = 560 name_vehicle = 'BMW M5 F90'
		-- elseif data.type == 3245 then data.type = 560 name_vehicle = 'Mercedes Maybach S 650'
		-- elseif data.type == 3247 then data.type = 559 name_vehicle = 'Mercedes-Benz AMG GT'
		-- elseif data.type == 3248 then data.type = 560 name_vehicle = 'Porsche Panamera Turbo'
		-- elseif data.type == 3251 then data.type = 560 name_vehicle = 'Volkswagen Passat'
		-- elseif data.type == 3254 then data.type = 477 name_vehicle = 'Chevrolet Corvette'
		-- elseif data.type == 3266 then data.type = 579 name_vehicle = 'Dodge Ram'
		-- elseif data.type == 3348 then data.type = 402 name_vehicle = 'Ford Mustang Shelby GT500'
		-- elseif data.type == 3974 then data.type = 429 name_vehicle = 'Aston Martin DB5'
		-- elseif data.type == 4542 then data.type = 494 name_vehicle = 'BMW M3 GTR'
		-- elseif data.type == 4543 then data.type = 502 name_vehicle = 'Chevrolet Camaro'
		-- elseif data.type == 4544 then data.type = 451 name_vehicle = 'Mazda RX7 Veilside FD'
		-- elseif data.type == 4545 then data.type = 506 name_vehicle = 'Mazda RX8'
		-- elseif data.type == 4546 then data.type = 477 name_vehicle = 'Mitsubishi Eclipse'
		-- elseif data.type == 4547 then data.type = 475 name_vehicle = 'Ford Mustang 289'
		-- elseif data.type == 4548 then data.type = 541 name_vehicle = 'Nissan 350Z'
		-- elseif data.type == 4774 then data.type = 560 name_vehicle = 'BMW 760li'
		-- elseif data.type == 4775 then data.type = 541 name_vehicle = 'Aston Martin One-77'
		-- elseif data.type == 4776 then data.type = 429 name_vehicle = 'Bentley Balacar'
		-- elseif data.type == 4777 then data.type = 579 name_vehicle = 'Bentley Bentayga'
		-- elseif data.type == 4778 then data.type = 602 name_vehicle = 'BMW M4 G82'
		-- elseif data.type == 4779 then data.type = 415 name_vehicle = 'BMW i8'
		-- elseif data.type == 4780 then data.type = 560 name_vehicle = 'Genesis G90'
		-- elseif data.type == 4781 then data.type = 558 name_vehicle = 'Honda Integra Type-R'
		-- elseif data.type == 4782 then data.type = 560 name_vehicle = 'BMW M3 G20'
		-- elseif data.type == 4783 then data.type = 560 name_vehicle = 'Mercedes-Benz S500 4Matic'
		-- elseif data.type == 4784 then data.type = 579 name_vehicle = 'Ford Raptor F150'
		-- elseif data.type == 4785 then data.type = 451 name_vehicle = 'Ferrari J50'
		-- elseif data.type == 4786 then data.type = 411 name_vehicle = 'Mercedes-Benz SLR McLaren'
		-- elseif data.type == 4787 then data.type = 411 name_vehicle = 'Subaru BRZ'
		-- elseif data.type == 4788 then data.type = 400 name_vehicle = 'Lada Vesta SW Cross'
		-- elseif data.type == 4789 then data.type = 602 name_vehicle = 'Porsche Taycan'
		-- elseif data.type == 4790 then data.type = 451 name_vehicle = 'Ferrari Enzo'
		-- elseif data.type == 4791 then data.type = 400 name_vehicle = 'UAZ Patriot'
		-- elseif data.type == 4792 then data.type = 404 name_vehicle = 'Volga'
		-- elseif data.type == 14124 then data.type = 411 name_vehicle = 'Nissan GTR 2017'
		-- elseif data.type == 14767 then data.type = 451 name_vehicle = 'Mercedes-AMG Project One R50'
		-- elseif data.type == 14768 then data.type = 451 name_vehicle = 'Aston Martin Valhalla'
		-- elseif data.type == 14769 then data.type = 507 name_vehicle = 'Chevrolet Aveo'
		-- elseif data.type == 14857 then data.type = 451 name_vehicle = 'BUGATTI Bolide'
		-- elseif data.type == 14884 then data.type = 434 name_vehicle = 'Yacota K5'
		-- elseif data.type == 14899 then data.type = 400 name_vehicle = 'Renault DUSTER'
		-- elseif data.type == 14904 then data.type = 451 name_vehicle = 'Ferrari Monza SP2'
		-- elseif data.type == 14905 then data.type = 479 name_vehicle = 'Mercedes-AMG G63'
		-- elseif data.type == 14906 then data.type = 434 name_vehicle = 'Hotwheels'
		-- elseif data.type == 14907 then data.type = 489 name_vehicle = 'Hummer HX'
		-- elseif data.type == 14908 then data.type = 451 name_vehicle = 'Ferrari F70'
		-- elseif data.type == 14909 then data.type = 560 name_vehicle = 'BMW M5 CS'
		-- elseif data.type == 14910 then data.type = 560 name_vehicle = 'LADA Priora'
		-- elseif data.type == 14911 then data.type = 411 name_vehicle = 'Quadra Turbo-R V-Tech'
		-- elseif data.type == 14912 then data.type = 411 name_vehicle = 'Renault TREZOR'
		-- elseif data.type == 14913 then data.type = 411 name_vehicle = 'Mercedes-Benz VISION AVTR'
		-- elseif data.type == 14914 then data.type = 510 name_vehicle = 'Specialized Stumpjumper'
		-- elseif data.type == 14915 then data.type = 510 name_vehicle = 'Santa Cruz Tallboy'
		-- elseif data.type == 14916 then data.type = 510 name_vehicle = 'Spooky Metalhead'
		-- elseif data.type == 14917 then data.type = 510 name_vehicle = 'Turner Burner'
		-- elseif data.type == 14918 then data.type = 431 name_vehicle = 'Holding Bus Company'
		-- elseif data.type == 14919 then data.type = 431 name_vehicle = 'Los-Santos Inter Bus C.'
		-- elseif data.type == 15085 then data.type = 579 name_vehicle = 'Неизвестно (CHARGER)'
		-- elseif data.type == 15098 then data.type = 411 name_vehicle = 'BMW M1'
		-- elseif data.type == 15099 then data.type = 411 name_vehicle = 'Lamborghini Countach'
		-- elseif data.type == 15100 then data.type = 472 name_vehicle = 'Nagasaki'
		-- elseif data.type == 15101 then data.type = 451 name_vehicle = 'Koenigsegg Gemera'
		-- elseif data.type == 15102 then data.type = 560 name_vehicle = 'KIA K7'
		-- elseif data.type == 15103 then data.type = 446 name_vehicle = 'Lampadati Toro'
		-- elseif data.type == 15104 then data.type = 579 name_vehicle = 'Lexus LX600'
		-- elseif data.type == 15105 then data.type = 400 name_vehicle = 'Nissan Qashqai'
		-- elseif data.type == 15106 then data.type = 430 name_vehicle = 'Predator'
		-- elseif data.type == 15107 then data.type = 559 name_vehicle = 'Volkswagen Scirocco'
		-- elseif data.type == 15108 then data.type = 446 name_vehicle = 'Longfin'
		-- elseif data.type == 15109 then data.type = 559 name_vehicle = 'Toyota GR'
		-- elseif data.type == 15110 then data.type = 595 name_vehicle = 'Wellcraft'
		-- elseif data.type == 15111 then data.type = 454 name_vehicle = 'Yacht'
		-- elseif data.type == 15112 then data.type = 454 name_vehicle = 'Boates'
		-- elseif data.type == 15113 then data.type = 579 name_vehicle = 'Неизвестно (a45)'
		-- elseif data.type == 15114 then data.type = 579 name_vehicle = 'Неизвестно (ae86)'
		-- elseif data.type == 15115 then data.type = 579 name_vehicle = 'Неизвестно (defender)'
		-- elseif data.type == 15116 then data.type = 579 name_vehicle = 'Неизвестно (mach)'
		-- elseif data.type == 15117 then data.type = 579 name_vehicle = 'Неизвестно (mazda6)'
		-- elseif data.type == 15118 then data.type = 579 name_vehicle = 'Неизвестно (R8S)'
		-- elseif data.type == 15119 then data.type = 579 name_vehicle = 'Неизвестно (SANTAFE)'
		-- elseif data.type == 15295 then data.type = 579 name_vehicle = 'Неизвестно (VELAR)'
		-- else
			-- name_vehicle = string.format("Неизвестно (%d)",data.type)
			-- data.type = 579
		-- end
		--------------------------------------
		-- sampCreate3dTextEx(vehicleId, 'Модель: {FFFFFF}'..name_vehicle..'\n{85BB65}[{FFFFFF}Доступно с лаунчера{85BB65}]', 0xFF85BB65, 0, 0, 0, 10, false, -1, vehicleId)
		-- list3d[vehicleId] = vehicleId
		--------------------------------------
		-- data.bodyColor1 = 126
		-- data.bodyColor2 = 126
		-- return {vehicleId, data}
	-- end
end

function sampev.onPlayerDeathNotification(killerid, killedid, reason)
	if elements.config.killStat.v == true then
		return false
	end
end

function sampev.onCreate3DText(id, color, position, distance, testLOS, attachedPlayerId, attachedVehicleId, text)
	if elements.config.del_opisanie_3d.v == true and position.x == 0 and position.y == 0 and position.z == -1 and distance == 7 and attachedPlayerId ~= 65535 then
		return false
	end
	-- if text:find('Settar_Halikov') then
		-- text = "{ffff00}[Moris Company]\n\n{73B461}Номер бизнеса: {FFFFFF}176\n{73B461}Тип бизнеса: {FFFFFF}Магазин 24/7\n{73B461}Владелец: {FFFFFF}Winston_Moris\n{73B461}Крыша: {FFFFFF}Байкеры"
		-- return {id, color, position, distance, testLOS, attachedPlayerId, attachedVehicleId, text}
	-- end
end

function onReceivePacket(id, bitStream)
	if reconnect_timer >= os.time() and (id ~= PACKET_DISCONNECTION_NOTIFICATION and id ~= PACKET_INVALID_PASSWORD and id ~= PACKET_CONNECTION_BANNED) then
		reconnect_timer = 0
	end
	if id == PACKET_DISCONNECTION_NOTIFICATION or id == PACKET_INVALID_PASSWORD or id == PACKET_CONNECTION_BANNED then
		sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'Server closed the connection.')
		if reconnect_timer < os.time() then
			reconnect_timer = os.time()+3
		end
	end
	if (id == PACKET_DISCONNECTION_NOTIFICATION) then
		sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'Packet disconnect notification.')
	end
	--------------------[RPC]--------------------
	name = raknetGetPacketName(id)
	if name then
		packet_incoming = id..':'..name
		if elements.state.show_packet == true then sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'onReceivePacket: '..name..' | '..id) end
	end
end

function onSendPacket(id, bitStream, priority, reliability, orderingChannel)
	--------------------[RPC]--------------------
	name = raknetGetPacketName(id)
	if name then
		packet_outcoming = id..':'..name
		if elements.state.show_packet == true then sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'onSendPacket: '..name..' | '..id) end
	end
end

function onReceiveRpc(id, bitStream)
	ip, port = sampGetCurrentServerAddress()
	--------------------[CheckBiz]--------------------
	if id == RPC_SCRSETWEATHER and ip == "185.169.134.5" and biz_listitem == 0 then
		-- auto_bizinfo(10000)
	end
	--------------------[Выключение зоны стрима]--------------------
	if elements.config.del_stream.v == true and
	(
		id == 43 or -- RPC_SCRREMOVEBUILDINGFORPLAYER
		id == 59 or -- ChatBubble
		id == 60 or -- UpdateGameTimer
		id == 79 or -- CreateExplosion
		id == 80 or -- ShowPlayerNameTagForPlayer
		id == 99 or -- MoveObject
		id == 123 -- SetNumberPlate
	)
	then
		return false
	end
	--------------------[RPC]--------------------
	name = raknetGetRpcName(id)
	if name then
		rpc_incoming = id..':'..name
		if elements.state.show_packet == true then sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'onReceiveRpc: '..name..' | '..id) end
	end
end

function onSendRpc(id, bitStream, priority, reliability, orderingChannel, shiftTs)
	--------------------[RPC]--------------------
	name = raknetGetRpcName(id)
	if name then
		rpc_outcoming = id..':'..name
		if elements.state.show_packet == true then  sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'onSendRpc: '..name..' | '..id) end
	end
end

function linkVehicleToInterior(vehicleId, interior) -- NoBalloons
	local BS = raknetNewBitStream()
	raknetBitStreamWriteInt16(BS, vehicleId)
	raknetBitStreamWriteInt8(BS, interior)
	raknetEmulRpcReceiveBitStream(65, BS)
	raknetDeleteBitStream(BS)
end

function sampev.onCreateObject(objectId, data)
	local model = data.modelId
	if data.attachToVehicleId ~= 0xFFFF then -- NoBalloons
		local result, car = sampGetCarHandleBySampVehicleId(data.attachToVehicleId)
		if result and isCarModel(car, 487) then
			if model == 2923 or model == 19131 then
				return false
			else
				for id, color in pairs(balls) do
					if model == id then
						linkVehicleToInterior(data.attachToVehicleId, 0)
						changeCarColour(car, color[1], color[2])
						return false
					end
				end
			end
		end
	end
	if elements.destroy.bucket.v == true and (model == 2404 or model == 2405 or model == 2406 or model == 2410 or model == 19601 or model == 19848) then
		return false
	end
	if elements.destroy.tree.v == true and model == 19076 then
		return false
	end
	if elements.destroy.serdce.v == true and model == 7093 then
		return false
	end
	if elements.destroy.newyear.v == true and
	model == 830 or
	model == 2892 or
	model == 3511 or
	model == 3511 or
	model == 3675 or
	model == 19756 then
		return false
	end
	if elements.destroy.xlam.v == true and 
	(model == 819 or -- Большой Куст #2
	model == 823 or -- Большой Куст #1
	model == 886 or -- Небольшое дерево #1
	model == 890 or -- Небольшое дерево #2
	model == 894 or -- INVALID_OBJECT_ID
	model == 1728 or -- Диван
	model == 2614 or -- Флаг
	model == 18659 or -- Граффити
	model == 18660 or -- Граффити
	model == 18661 or -- Граффити
	model == 18662 or -- Граффити
	model == 18665 or -- Граффити
	model == 18666 or -- Граффити
	model == 18667 or -- Граффити
	model == 19306 or -- Красный флажок
	model == 19317 or -- Красная гитара
	model == 19318 or -- Чёрно-белая гитара
	model == 19319 or -- Чёрная гитара
	model == 19525) then -- Праздничный торт
		return false
	end
	----------------------------------------
end

function sampev.onSetObjectMaterialText(objectId, data)
	--------------------[Автобазар]--------------------
	if data.align == 1 and data.fontSize == 40 then
		local veh, price = data.text:match('^([^\n]+)\n{%x+}%$(%d+)')
		if veh and price then
			price = sumFormat(tostring(price))
			sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] На продажу выставлен {FDDB6D}'..veh..'{FFFFFF} за {FDDB6D}$'..price..'{FFFFFF}.', 0xFFFFFF)
			----------------------------------------
			data.text = data.text:gsub('%$%d+', '$' .. price)
			return { objectId, data }
		end
	end
end

function skupka()
	delay_skupka = 700
	lua_thread.create(function()
		if elements.lavka.drugs.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.drugs.v..' '..elements.lavka.drugs_price.v)
		end
		if elements.lavka.materials.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 13, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.materials.v..' '..elements.lavka.materials_price.v)
		end
		if elements.lavka.fam_talon.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.fam_talon.v..' '..elements.lavka.fam_talon_price.v)
		end
		if elements.lavka.gift.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 0, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gift.v..' '..elements.lavka.gift_price.v)
		end
		if elements.lavka.cooper_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.cooper_roll.v..' '..elements.lavka.cooper_roll_price.v)
		end
		if elements.lavka.silver_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.silver_roll.v..' '..elements.lavka.silver_roll_price.v)
		end
		if elements.lavka.gold_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gold_roll.v..' '..elements.lavka.gold_roll_price.v)
		end
		if elements.lavka.xlopok.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 2, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.xlopok.v..' '..elements.lavka.xlopok_price.v)
		end
		if elements.lavka.lens.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.lens.v..' '..elements.lavka.lens_price.v)
		end
		if elements.lavka.stone.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.stone.v..' '..elements.lavka.stone_price.v)
		end
		if elements.lavka.metal.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.metal.v..' '..elements.lavka.metal_price.v)
		end
		if elements.lavka.bronze.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.bronze.v..' '..elements.lavka.bronze_price.v)
		end
		if elements.lavka.silver.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 7, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.silver.v..' '..elements.lavka.silver_price.v)
		end
		if elements.lavka.gold.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gold.v..' '..elements.lavka.gold_price.v)
		end
		if elements.lavka.euro.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 16, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.euro.v..' '..elements.lavka.euro_price.v)
		end
		if elements.lavka.gr_talon.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gr_talon.v..' '..elements.lavka.gr_talon_price.v)
		end
		if elements.lavka.antibiotiki.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 0, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.antibiotiki.v..' '..elements.lavka.antibiotiki_price.v)
		end
		if elements.lavka.prison.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 1, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.prison.v..' '..elements.lavka.prison_price.v)
		end
		if elements.lavka.zlov_moneta.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 13, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.zlov_moneta.v..' '..elements.lavka.zlov_moneta_price.v)
		end
		if elements.lavka.toch_stone.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 14, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.toch_stone.v..' '..elements.lavka.toch_stone_price.v)
		end
		if elements.lavka.bilet_6.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.bilet_6.v..' '..elements.lavka.bilet_6_price.v)
		end
		if elements.lavka.sticker_cluck.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 13, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_cluck.v..' '..elements.lavka.sticker_cluck_price.v)
		end
		if elements.lavka.sticker_binko.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 17, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_binko.v..' '..elements.lavka.sticker_binko_price.v)
		end
		if elements.lavka.sticker_jizzy.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_jizzy.v..' '..elements.lavka.sticker_jizzy_price.v)
		end
		if elements.lavka.platinum_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 14, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.platinum_roll.v..' '..elements.lavka.platinum_roll_price.v)
		end
		if elements.lavka.fam_money.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 12, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.fam_money.v..' '..elements.lavka.fam_money_price.v)
		end
		if elements.lavka.smazka.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 13, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.smazka.v..' '..elements.lavka.smazka_price.v)
		end
		if elements.lavka.oxlajdauka.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 14, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.oxlajdauka.v..' '..elements.lavka.oxlajdauka_price.v)
		end
		if elements.lavka.band_respect.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.band_respect.v..' '..elements.lavka.band_respect_price.v)
		end
		if elements.lavka.AZ_coins.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.AZ_coins.v..' '..elements.lavka.AZ_coins_price.v)
		end
		if elements.lavka.Moneta_8_god.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, 2, nil) -- Выбор между скупом и продажей
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.Moneta_8_god.v..' '..elements.lavka.Moneta_8_god_price.v)
		end
		sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Скрипт закончил выставлять товары на покупку.', 0xFFFFFF)
	end)
end

function sampev.onSetPlayerDrunk(drunkLevel)
	--sampfuncsLog(drunkLevel)
	return {1}
end

-- function sampev.onSendClientJoin(Ver, mod, nick, response, authKey, clientver, unk)
	-- clientver = 'Arizona PC'
	-- return {Ver, mod, nick, response, authKey, clientver, unk}
-- end

function sampev.onSendPlayerSync(data)
	--------------------[Анти банихоп]--------------------
	if bit.band(data.keysData, 0x28) == 0x28 then
		data.keysData = bit.bxor(data.keysData, 0x20)
	end
	--------------------[Отключение анимаций посадки в транспорт]--------------------
	for animid = 1009, 1060 do
		if animid == data.animationId then
			elements.config.anim_car.v = false
		end
	end
	----------------------------------------
end

-- local orion = 999

function sampev.onShowDialog(dialogId, style, title, button1, button2, text)
	--sampAddChatMessage(dialogId,-1)
	--sampAddChatMessage(text,-1)
	if elements.state.showmodel == true then
		sampfuncsLog(dialogId..' | '..text)
	end
	--------------------[Конвертация]--------------------
	if text:find("Стоимость: VC%$") then
		----------------------------------------
		local vc_coins = string.match(text,'Стоимость: VC%$(.+) за 1 шт.')
		no_separator = vc_coins:gsub('%.', '')
		text = text:gsub('Стоимость: VC%$(.+) за 1 шт.', separator('Стоимость: VC%$'..vc_coins..' за 1 шт.\n\nЦена на Saint Rose: $'..tonumber(no_separator)*elements.config.convert.v))
		----------------------------------------
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Цена на Vice City: $'..vc_coins..'.', 0xFFFFFF)
		sampAddChatMessage(separator('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Цена на Saint Rose: $'..tonumber(no_separator)*elements.config.convert.v), 0xFFFFFF)
		----------------------------------------
	end
	ip, port = sampGetCurrentServerAddress()
	--------------------[ДР аризоны 2022]--------------------
	-- if dialogId == 25618 then
		-- sampSendDialogResponse(dialogId, 1, nil, nil)
	-- end
	--------------------[buyvk]--------------------
	if dialogId == 25012 then
		local price_sek = string.match(title,'Всего: (.+) в сек. | {B1413D}VKoin')
		local price_hour = price_sek*3600
		title = price_sek..' в сек | '..price_hour..' в час | {B1413D}VKoin'
		return {dialogId, style, title, button1, button2, text}
	end
	--------------------[Автологин]--------------------
	if ip == "185.169.134.5" and not sampIsLocalPlayerSpawned() then
		if local_name == elements.account.my_nick.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_2.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password_2.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_3.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password_3.v)
				return false
			end
		end
	end
	if ip == "127.0.0.1" and not sampIsLocalPlayerSpawned() then
		if local_name == "Sawa_Seleznev" then
			if dialogId == 6 then
				sampSendDialogResponse(dialogId, 1, 0, "123456")
				return false
			end
		end
	end
	if ip == "185.169.134.61" and not sampIsLocalPlayerSpawned() then -- Red Rock
		if local_name == "Che_Lovek" then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, "Sawka1289")
				return false
			end
		end
	end
	if ip == "80.66.82.191" and not sampIsLocalPlayerSpawned() then -- Gilbert
		if local_name == "Sawa_Seleznev" then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, "1234565")
				return false
			end
		end
	end
	if ip == "80.66.82.190" and not sampIsLocalPlayerSpawned() then -- Show-Low
		if local_name == "Sawa_Seleznev" then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, "1234565")
				return false
			end
		end
	end
	--------------------[Автопинкод]--------------------
	if ip == "185.169.134.5" then
		if local_name == elements.account.my_nick.v then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_2.v then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode_2.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_3.v then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode_3.v)
				return false
			end
		end
	end
	if ip == "185.169.134.61" then
		if local_name == "Che_Lovek" then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, "123456")
				return false
			end
		end
	end
	--------------------[Автоподтверждение на открытие сим-карты]--------------------
	if dialogId == 9208 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Автоподтверждение на починку аксессуара]--------------------
	if dialogId == 8510 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Автоввод текста в лавку]--------------------
	if dialogId == 3020 then
		if dialogs_lavka == 0 then
			sampSendDialogResponse(dialogId, 1, 0, "Продажа и СКУП")
			return false
		else
			sampSendDialogResponse(dialogId, 1, 0, "СКУП и продажа")
			return false
		end
		dialogs_lavka = -1
	end
	if dialogId == 3030 then
		sampSendDialogResponse(dialogId, 1, 13, nil)
		return false
	end
	--------------------[Авторепорт]--------------------
	if dialogId == 32 and #message_report > 0 then
		sampSendDialogResponse(dialogId, 1, 0, message_report)
		message_report = ""
		--sampCloseCurrentDialogWithButton(0)
		return false
	end
	if dialogId == 1332 or dialogId == 1333 then
		sampSendDialogResponse(dialogId, 1, 0, nil)
		return false
	end
	--------------------[Продовоз]--------------------
	if dialogId == 2291 then
		sampSendDialogResponse(dialogId, 1, 0, "Купить")
		return false
	end
	----------------------------------------
	if dialogId == 430 then
		sampSendDialogResponse(dialogId, 1, 0, elements.config.prodovoz_edit.v)
		prods = elements.config.prodovoz_edit.v
		return false
	end
	----------------------------------------
	if dialogId == 8762 then
		if text:match('которое хотите продать бизнесу.') then
			bizz = string.match(text,'закупает {B7A51B}(%d+)')
			----------------------------------------
			biz = 0
			biz = biz+bizz
			----------------------------------------
			if biz >= prods then
				sampSendDialogResponse(dialogId, 2, 1, elements.config.prodovoz_edit.v)
				sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Скрипт продал в бизнес '..elements.config.prodovoz_edit.v..' продуктов. (1)', 0xFFFFFF)
				prods = prods-elements.config.prodovoz_edit.v
				return false
			else
				sampSendDialogResponse(dialogId, 2, 1, biz)
				sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Скрипт продал в бизнес '..biz..' продуктов. (2)', 0xFFFFFF)
				prods = prods-biz
				return false
			end
		end
	end
	--------------------[Новый автолут]--------------------
	if elements.state.autoloot == true then
		if dialogId == 8251 and elements.state.autoloot_number ~= 0 then
			sampSendDialogResponse(dialogId, 2, 1, autoloot_td[elements.state.autoloot_number])
			elements.state.autoloot_number = 0
			return false
		end
		if dialogId == 1966 then
			sampSendDialogResponse(dialogId, 1, 2, nil)
			return false
		end
	end
	--------------------[Анализ цен на ЦР]--------------------
	if dialogId == 15072 and title:find('Выберите список') then
		if analysis == 2 then
			sampSendDialogResponse(dialogId, 1, 1, nil)
			return false
		end
		----------------------------------------
		text = text .. '\n' .. '{00FF00}Проанализировать'
		return {dialogId, style, title, button1, button2, text}
	end
	----------------------------------------
	if analysis ~= nil and dialogId == 15073 then
		if last_text ~= nil and last_text == text then
			if analysis == 1 then
				analysis = 2
			else
				analysis = nil
				data_cr.last_update = os.time()
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Анализ завершён! Средние цены на товары обновлены!', 0xFFFFFF)
				----------------------------------------
				local file_analysis = io.open(path_cr, "w")
				file_analysis:write(encodeJson(data_cr))
				file_analysis:close()
			end
			sampSendDialogResponse(dialogId, 0, nil, nil)
			return false
		end
		----------------------------------------
		last_text = text
		if title:find('Средняя цена товаров при продаже') then
			parser(text, 1)
		elseif title:find('Средняя цена товаров при скупке') then
			parser(text, 2)
		end
		sampSendDialogResponse(dialogId, 1, 1, nil)
		return false
	elseif analysis ~= nil then
		analysis = nil
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Критическая ошибка! Анализ был сбит другим диалогом!', 0xFFFFFF)
		sampSendDialogResponse(dialogId, 0, nil, nil)
		return false
	end
	----------------------------------------
	if dialogId == 3082 then
		for line in text:gmatch('[^\n]+') do
			local item = line:match('.*{%x+}(.+){%x+}.*$')
			local temp = {}
			----------------------------------------
			if item == nil then
				text = text:gsub('Стоимость:[^\n]+', '%1\n{FF4040}Не удалось определить товар\n{FDDB6D}Средняя цена не может быть найдена!')
				--sampfuncsLog('Название не обнаружено: ' .. line)
				return { dialogId, style, title, button1, button2, text }
			end
			----------------------------------------
			for _, info in ipairs(title:find('Продажа предмета') and data_cr.buy or data_cr.sell) do
				if item:find(info['i'], 1, true) then
					temp[#temp + 1] = string.format('%s - {FFD900}%s', info['i'], sumFormat(tostring(info['p']))) 
				end
			end
			----------------------------------------
			if data_cr.last_update == nil then
				sampAddChatMessage('', 0xFFFFFF)
				sampAddChatMessage('', 0xFFFFFF)
				sampAddChatMessage('', 0xFFFFFF)
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Обнови средние цены на ЦР!', 0xFFFFFF)
				sampAddChatMessage('', 0xFFFFFF)
				sampAddChatMessage('', 0xFFFFFF)
				sampAddChatMessage('', 0xFFFFFF)
				return
			end
			if os.time() - data_cr.last_update <= 86400 then -- 1 day
				if #temp > 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средние цены' .. ':\n{67BE55}' .. table.concat(temp, '\n{67BE55}'))
				elseif #temp == 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена на ' .. temp[1])
				else
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена не найдена!\n{FFD900}Обнови списки на площади ЦР\n')
				end
			else
				local datetime = string.format(os.date('%d.%m.%Y', data_cr.last_update))
				if #temp > 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{FF3300}['..datetime..'] Средние цены' .. ':\n{67BE55}' .. table.concat(temp, '\n{67BE55}'))
				elseif #temp == 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{FF3300}['..datetime..'] Средняя цена на ' .. temp[1])
				else
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена не найдена!\n{FFD900}Обнови списки на площади ЦР\n')
				end
			end
			break
		end
		return { dialogId, style, title, button1, button2, text }
	end
	--------------------[BizInfo]--------------------
	if dialogId == 156 and biz_listitem < max_biz then
		----------------------------------------
		local bName = string.match(text,'Бизнес: {9ACD32}(.+)\n{FFFFFF}Банк бизнеса')
		local bName2 = bName
		--------------------------------------
		if text:find("Ларек с уличной едой") then
			bName2 = bName:gsub('Ларек с уличной едой','Ларёк')
		elseif text:find("АЗС/Магазин механики") then
			bName2 = bName:gsub('АЗС/Магазин механики','АЗС')
		elseif text:find("Аренда сельхоз техники") then
			bName2 = bName:gsub('Аренда сельхоз техники','Сельхоз')
		end
		----------------------------------------
		local bProds = string.match(text,'Продуктов: {9ACD32}(%d+)')
		if bProds == nil then
			bProds = 0
		end
		----------------------------------------
		local bTax = string.match(text,'Налог к оплате: {9ACD32}(.+)\n{FFFFFF}Цена покупки с госа')
		local bTax2 = bTax:gsub('PayDay/s','PD')
		local bTax3 = bTax2:gsub('\n','')
		----------------------------------------
		local bBank = string.match(text,'Банк бизнеса: {9ACD32}$(%d+)\n')
		----------------------------------------
		local bProfit = tostring(string.match(text,'{FFFFFF}Прибыль за сегодня: {61B23D}$(%d+){FFFFFF}'))
		----------------------------------------
		if biz_listitem == 0 then
			biz_message_1 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		if biz_listitem == 1 then
			biz_message_2 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		if biz_listitem == 2 then
			biz_message_3 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		if biz_listitem == 3 then
			biz_message_4 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		if biz_listitem == 4 then
			biz_message_5 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		if biz_listitem == 5 then
			biz_message_6 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		if biz_listitem == 6 then
			biz_message_7 = separator(string.format("{FDDB6D}%s{FFFFFF} | Продуктов: {FDDB6D}%d{FFFFFF} | Налог: {FDDB6D}%s{FFFFFF} | Прибыль за сегодня: {FDDB6D}$%s{FFFFFF} | Банк: {FDDB6D}$%d",bName2,bProds,bTax3,bProfit,bBank))
		end
		----------------------------------------
		biz_listitem = biz_listitem+1
		auto_bizinfo(0)
		sampSendDialogResponse(dialogId, 0, nil, nil)
	end
	if dialogId == 9761 then
		if nodial == true then
			nodial = false
			if biz_listitem ~= max_biz then
				sampSendDialogResponse(dialogId, 1, biz_listitem, nil)
			else
				sampSendDialogResponse(dialogId, 0, nil, nil)
				return false
			end
			sampCloseCurrentDialogWithButton(0)
		end
		----------------------------------------
		max_biz = 0
		for _ in text:gmatch("\n") do
			max_biz = max_biz+1
		end
		----------------------------------------
	end
	--------------------[Отказ показа диалогов]--------------------
	if dialogId == 0 and
	((text:find("В этом месте запрещено") and text:find("Если вы продолжите, то вы будете кикнуты!")) or
	text:find("Перед тем как подтвердить сделку, советуем") or
	text:find("Приятной игры на arizona") or
	text:find("Вы успешно купили ") or
	text:find("PIN%-код принят")) then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	if dialogId == 0 and text:find("Аз Монет при пополнении счета на нашем сайте") then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	if dialogId == 25627 then -- /vr реклама
		sampSendDialogResponse(dialogId, 0, nil, nil)
		return false
	end
	--------------------[Отказ показа диалога об мнении правительства]--------------------
	if dialogId == 15429 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Отказ показа диалога при авторизации]--------------------
	if dialogId == 15330 or dialogId == 15375 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
end

function sampev.onSendDialogResponse(dialogId, button, listboxId, input)
	-- sampAddChatMessage('dialogId: '..dialogId..' | button: '..button..' | listboxId: '..listboxId..' | input: '..input, -1)
	--------------------[Автоввод текста в лавку]--------------------
	if dialogId == 3021 then
		dialogs_lavka = listboxId
	end
	--------------------[Анализ цен на ЦР]--------------------
	if dialogId == 15072 and listboxId == 2 and button == 1 then
		analysis = 1
		last_text = nil
		data_cr = template
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Запущен анализ цен. Не открывайте до завершения другие диалоги!', 0xFFFFFF)
		return { dialogId, button, 0, input }
	end
	--------------------[Анализ цен при выставлении на продажу]--------------------
	if dialogId == 3050 and	button ~= 0 and input ~= "<<< Предыдущая страница" and input ~= "Следующая страница >>>" then
		commandPrice(input)
	end
end

function string_to_lower(str) -- Анализ цен на ЦР
	for i = 192, 223 do
		str = str:gsub(_G.string.char(i), _G.string.char(i + 32))
	end
	str = str:gsub(_G.string.char(168), _G.string.char(184))
	return str:lower()
end

function parser(text, mode) -- Анализ цен на ЦР
	text = tostring(text)
	local current = 0
	for line in text:gmatch('[^\n]+') do
		current = current + 1
		if current > 3 then
			local item, price = line:match('^(.+)\t(.+)$')
			if item and price then
				if mode == 1 then
					table.insert(data_cr.sell, {i = item, p = price})
				else
					table.insert(data_cr.buy, {i = item, p = price})
				end
			end
		end
	end
end

function sumFormat(sum) -- Анализ цен на ЦР
	count = sum:match('%d+')
	if count and #count > 3 then
		local b, e = ('%d'):format(count):gsub('^%-', '')
		local c = b:reverse():gsub('%d%d%d', '%1.')
		local d = c:reverse():gsub('^%.', '')
		return sum:gsub(count, (e == 1 and '-' or '') .. d)
	end
	return sum
end

function commandPrice(item)
	item = string_to_lower(tostring(item))
	if item ~= nil then
		local temp = {}
		for _, info_sell in ipairs(data_cr.sell) do
			if string_to_lower(info_sell['i']):find(item, 1, true) then
				local t = 
				{
					name = nil,
					sell = 'Неизвестно',
					buy = 'Неизвестно'
				}
				----------------------------------------
				t.name = info_sell['i']
				t.sell = sumFormat(tostring(info_sell['p']))
				----------------------------------------
				for _, info_buy in ipairs(data_cr.buy) do
					if info_sell['i'] == info_buy['i'] then
						t.buy = sumFormat(tostring(info_buy['p']))
						break
					end
				end
				----------------------------------------
				temp[#temp + 1] = (' > {FFFFFF}Товар: {FDDB6D}%s{FFFFFF} | На продажу: {FDDB6D}%s{FFFFFF} | На покупку: {FDDB6D}%s'):format(t.name, t.sell, t.buy)
			end
		end
		----------------------------------------
		if #temp >= 1 then
			sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Найден'.. (#temp > 1 and 'о' or '') .. ' {FDDB6D}' .. #temp .. '{FFFFFF} товар' .. (#temp > 1 and 'ов' or '') .. ':', 0xFFFFFF)
			for _, str in ipairs(temp) do
				sampAddChatMessage(str, 0xFFFFFF)
			end
			local isOld = os.time() - data_cr.last_update >= 86400
			sampAddChatMessage(('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Информация о цен' .. (#temp > 1 and 'ах' or 'е') .. ' от {FF3300}%s'):format(os.date('%d.%m.%Y ' .. (isOld and '( устарела )' or ''), data_cr.last_update)), 0xFFFFFF)
			return
		end
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Не удалось найти товар с похожим названием.', 0xFFFFFF)
		return
	end
	sampAddChatMessage('Используй: /price [название товара]', 0xAFAFAF)
end

function sampev.onPlayerEnterVehicle(playerId, vehicleId, passenger)
	--------------------[Отключение анимаций посадки в транспорт]--------------------
	if elements.config.anim_car.v == true then
		local _, ped = sampGetCharHandleBySampPlayerId(playerId)
		if _ then
			local x1, y1, z1 = getCharCoordinates(PLAYER_PED)
			local x2, y2, z2 = getCharCoordinates(ped)
			if getDistanceBetweenCoords2d(x1, y1, x2, y2) < 10 then
				return false
			end
		end
	end
	----------------------------------------
end

function sampev.onSendCommand(cmd)
	local result_ = cmd:match('^/id (.+)')
	if result_ ~= nil then
		lua_thread.create(function()
			wait(700)
			sampSendChat('/number ' .. result_)
		end)
	end
	local result = cmd:match('^/vr (.+)')
	if result ~= nil then
		finished = false
		message_vr = tostring(result)
		lua_thread.create(function()
			while not finished do
				if sampGetGamestate() ~= 3 or not sampIsLocalPlayerSpawned() then
					finished = true;
					break
				end
				if not sampIsChatInputActive() then
					local rotate = math.sin(os.clock() * 3) * 90 + 90
					local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
					local windowPosX = getStructElement(input, 0x8, 4)
					local windowPosY = getStructElement(input, 0xC, 4)
					renderDrawPolygon(windowPosX + 10, windowPosY + (renderGetFontDrawHeight(molot_10_9) / 2), 15, 15, 3, rotate, 0xFF0090FF)
					renderDrawPolygon(windowPosX + 10, windowPosY + (renderGetFontDrawHeight(molot_10_9) / 2), 15, 15, 3, -1 * rotate, 0xFFFDDB6D)
					renderFontDrawText(molot_10_9, tostring(message_vr), windowPosX + 25, windowPosY, -1)
				end
				wait(0)
			end
		end)
	end
end

function sampev.onPlayerChatBubble(playerId, color, distance, duration, message)
	if elements.config.del_stream.v == true then
		return false
	end
	if elements.config.del_stream_pl.v == true then
		return false
	end
	if not sampIsPlayerPaused(playerId) and
	(color == -1 or
	color == -253326081) and
	not message:find("{65C18C}AFK{FFFFFF}")
	then
		----------------------------------------
		r, g, b, a = explode_argb(color)
		----------------------------------------
		table.insert(chatbuble, string.format("{%06X}"..os.date("[%H:%M:%S] (D: " .. distance .. ") ") .. sampGetPlayerNickname(playerId) .. "[" .. playerId .. "]: " .. message, join_rgb(r,g,b)))
		----------------------------------------
		if #chatbuble > elements.chat.distant_count.v then
			table.remove(chatbuble, 1)
		end
		----------------------------------------
	end
end

-- function sampev.onApplyPlayerAnimation(playerId, animLib, animName, frameDelta, loop, lockX, lockY, freeze, time)
	-- sampAddChatMessage(string.format('ApplyAnimation(playerid,"%s","%s",%0.1f,%s,%s,%s,%s,%d);',animLib, animName, frameDelta, loop, lockX, lockY, freeze, time),-1)
	-- sampfuncsLog(string.format('ApplyAnimation(playerid,"%s","%s",%0.1f,%s,%s,%s,%s,%d);',animLib, animName, frameDelta, loop, lockX, lockY, freeze, time))
-- end

-- function sampev.onSetPlayerSpecialAction(actionId)
	-- sampAddChatMessage(string.format('SetPlayerSpecialAction(playerid, %d);',actionId),-1)
	-- sampfuncsLog(string.format('SetPlayerSpecialAction(playerid, %d);',actionId))
-- end

-- function sampev.onClearPlayerAnimation(playerId)
	-- sampAddChatMessage('ClearAnimations(playerid);',-1)
-- end

function sampev.onSetPlayerAttachedObject(playerId, index, create, object)
	if elements.config.del_stream.v == false and elements.config.del_stream_pl.v == false then
		model = object.modelId
		if playerId == elements.config.attach_id.v then
			sampAddChatMessage('С ID: '..playerId..' своровалась модификация. '..object.modelId..': '..getColor(object.color1)..': '..getColor(object.color2)..': '..object.color1..': '..object.color2,0xFF3300)
			SaveFileAttach(elements.config.attach_id.v,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z,object.color1,object.color2)
		end
		if sampIsLocalPlayerSpawned() and sampGetPlayerNickname(playerId) == "Roy_Shelby" then
			sampAddChatMessage('С Roy_Shelby['..playerId..'] своровалась модификация. '..object.modelId..': '..getColor(object.color1)..': '..getColor(object.color2)..': '..object.color1..': '..object.color2,0xFF3300)
			SaveFileAttach(playerId,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z,object.color1,object.color2)
		end
		if model == 3003 and playerId ~= elements.config.attach_id.v and sampGetCurrentServerAddress() ~= "127.0.0.1" then
			elements.config.attach_id.v = playerId
			elements.state.finds = playerId
			sampAddChatMessage("У игрока "..sampGetPlayerNickname(playerId).."["..playerId.."] необходимо своровать модификацию, обнови зону стрима. "..model,0xFF3300)
			printString('~g~Find enable',2000)
		end
		if model == 19085 and playerId ~= elements.config.attach_id.v then
			result, ped = sampGetCharHandleBySampPlayerId(playerId)
			if result and getCharModel(ped) == 96 then
				elements.config.attach_id.v = playerId
				elements.state.finds = playerId
				sampAddChatMessage("У игрока "..sampGetPlayerNickname(playerId).."["..playerId.."] необходимо своровать модификацию, обнови зону стрима. "..model,0xFF3300)
				printString('~g~Find enable',2000)
			end
		end
		local ip, port = sampGetCurrentServerAddress()
		if ip == "185.169.134.3" or -- PHOENIX
			ip == "185.169.134.4" or -- TUCSON
			ip == "185.169.134.43" or -- SCOTTDALE
			ip == "185.169.134.44" or -- CHANDLER
			ip == "185.169.134.45" or -- BRAINBURG
			ip == "185.169.134.5" or -- SAINT ROSE
			ip == "185.169.134.59" or -- MESA
			ip == "185.169.134.61" or -- RED ROCK
			ip == "185.169.134.107" or -- YUMA
			ip == "185.169.134.109" or -- SURPRISE
			ip == "185.169.134.166" or -- PRESCOTT
			ip == "185.169.134.171" or -- GLENDALE
			ip == "185.169.134.172" or -- KINGMAN
			ip == "185.169.134.173" or -- WINSLOW
			ip == "185.169.134.174" or -- PAYSON
			ip == "80.66.82.191" or -- GILBERT
			ip == "80.66.82.190" or -- SHOW-LOW
			ip == "80.66.82.188" or -- CASA GRANDE
			ip == "80.66.82.168" or -- PAGE
			ip == "80.66.82.159" or -- SUN CITY
			ip == "80.66.82.190" or -- QUEEN CREEK
			ip == "80.66.82.147" then -- Vice City
			--------------------[Что не показывается вообще]--------------------
			if model == 328 then return false end -- Розовый оружейный кейс
			if model == 1210 then return false end -- Коричневый кейс
			if model == 1276 and object.offset.x == 0 then return false end -- Свечение игрока
			if model == 3528 then return false end -- Дракон
			if model == 11745 then return false end -- Сумка для ноутбука
			if model == 18717 then return false end -- С модификации Закоротивший робот
			if model == 19076 then return false end -- Ёлочка на плечо
			if model == 19921 then return false end -- Красный чемодан
			----------------------------------------
			for model_id, name in pairs(model_name_anti_stealer) do
				if model_id == model then
					return
				end
			end
			----------------------------------------
			if model >= 18977 and model <= 18979 then -- Мотошлемы
				model = 18645
				if object.bone == 1 then return end
				if object.offset.x == 0.0610 then return end
			end
			----------------------------------------
			if model == 2908 and object.bone == 13 then return end -- Голова зомби в руку с модификации
			if model == 2918 and object.bone == 2 then return end -- Рюкзак с шипами с модификации Костюм для хэллоуина
			if model == 18632 and object.bone == 6 then return end -- Удочка в руку
			if model == 18890 and object.bone == 6 then return end -- Грабли в руку
			
			if model == 18954 then model = 18953 end -- Шапки
			if model == 18965 or model == 18966 then model = 18964 end -- Бандитская шапка
			
			if model == 19037 or model == 19038 then model = 19036 end -- Хоккейная маска
			if model == 19065 or model == 19066 then model = 19064 end -- Новогодняя шапка
			if model == 19137 and object.bone == 1 then return end -- Голова петуха с модификации
			if model == 19160 or model == 19161 or model == 19162 then model = 19093 end -- Кепки DUDE & Police
			if model == 19331 then model = 19330 end -- Каска пожарного
			if model == 19487 then model = 19352 end -- Конусы
			if model == 19515 then model = 19142 end -- Бронежилет
			if model == 19517 and object.bone == 1 then return end -- Крылья с модификаций
			if model == 19521 then model = 19520 end -- Фуражка офицера
			if model == 19557 and object.bone == 1 then return end -- Крылья
			if model >= 18892 and model <= 18905 then model = 18891 end -- Бандана
			if model >= 18907 and model <= 18910 then model = 18906 end -- Банданы на голову
			if model >= 18912 and model <= 18920 then model = 18911 end -- Банданы
			if model >= 18922 and model <= 18925 then model = 18921 end -- Береты
			if model >= 18927 and model <= 18935 then model = 18926 end -- Кепка передняя
			if model >= 18956 and model <= 18959 then model = 18955 end -- Кепка обратная
			if model >= 18971 and model <= 18973 then model = 18970 end -- Шляпы
			if model >= 19040 and model <= 19053 then model = 19039 end -- Часы
			if model >= 19096 and model <= 19100 then model = 19095 end -- Ковбойская шляпа
			if model >= 19102 and model <= 19120 then model = 19101 end -- Каски
			model_name_2 = ''
			for model_id, name in pairs(model_name) do
				if model_id == model then
					model_name_2 = name
				end
			end
			----------------------------------------
			object_name = string.format('%d - %s',model,model_name_2)
			----------------------------------------
			local file_attach = io.open('moonloader/stealer/'..object_name..'.notepad', 'a+')
			if file_attach ~= -1 and file_attach ~= nil then
				----------------------------------------
				_, id = sampGetPlayerIdByCharHandle(PLAYER_PED)
				skin = -1
				----------------------------------------
				if playerId == id then
					skin = getCharModel(PLAYER_PED)
				else
					lua_thread.create(function()
						result, ped = sampGetCharHandleBySampPlayerId(playerId)
						if result then
							skin = getCharModel(ped)
						end
						if not doesCharExist(ped) then
							return
						end
					end)
				end
				if skin ~= -1 then
					code_temp_2 = ""
					code_temp_2 = string.format('case %d: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',skin,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
					if string.find(file_attach:read("*all"), code_temp_2, 1, true) then
						--sampfuncsLog('{FF3300}<Копия> '..code_temp_2)
						io.close(file_attach)
						return
					end
					sampfuncsLog('{33AA33}<Добавлено> '..code_temp_2)
					SaveFileAttach(skin,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z,object.color1,object.color2)
					io.close(file_attach)
				end
			end
		end
	end
end

function SaveFileAttach(skin,modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ,color1,color2)
	if skin == elements.config.attach_id.v then
		local file_attach = io.open('moonloader/stealer/mod_'..elements.config.attach_id.v..'.notepad', 'a+')
		if file_attach ~= -1 and file_attach ~= nil then
			file_attach:write(string.format('SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %d, %d);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ,color1,color2))
			io.close(file_attach)
		end
		return
	end
	----------------------------------------
	model_name_2 = ''
	for model_id, name in pairs(model_name) do
		if model_id == modelId then
			model_name_2 = name
		end
	end
	local file_attach = io.open('moonloader/stealer/'..object_name..'.notepad', 'a+')
	if file_attach ~= -1 and file_attach ~= nil then
		if skin == 0 or skin == 74 then
			file_attach:write(string.format('case 0: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 74: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 13 or skin == 65 then
			file_attach:write(string.format('case 13: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 65: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 36 or skin == 37 then
			file_attach:write(string.format('case 36: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 37: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 51 or skin == 52 then
			file_attach:write(string.format('case 51: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 52: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 66 or skin == 67 then
			file_attach:write(string.format('case 66: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 67: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 80 or skin == 81 then
			file_attach:write(string.format('case 80: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 81: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 82 or skin == 83 or skin == 84 then
			file_attach:write(string.format('case 82: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 83: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 84: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 78 or skin == 239 then
			file_attach:write(string.format('case 78: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 239: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 86 or skin == 271 then
			file_attach:write(string.format('case 86: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 271: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 117 or skin == 118 then
			file_attach:write(string.format('case 117: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 118: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 203 or skin == 204 then
			file_attach:write(string.format('case 203: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 204: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 224 or skin == 225 then
			file_attach:write(string.format('case 224: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 225: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 247 or skin == 254 then
			file_attach:write(string.format('case 247: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 254: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 274 or skin == 275 or skin == 276 then
			file_attach:write(string.format('case 274: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 275: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 276: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 277 or skin == 278 or skin == 279 then
			file_attach:write(string.format('case 277: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 278: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 279: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 280 or skin == 300 then
			file_attach:write(string.format('case 280: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 300: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 281 or skin == 301 then
			file_attach:write(string.format('case 281: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 301: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 282 or skin == 302 then
			file_attach:write(string.format('case 282: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 302: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 283 or skin == 288 then
			file_attach:write(string.format('case 283: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 288: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 303 or skin == 304 then
			file_attach:write(string.format('case 303: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 304: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 306 or skin == 308 or skin == 309 then
			file_attach:write(string.format('case 306: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 308: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 309: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 310 or skin == 311 then
			file_attach:write(string.format('case 310: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file_attach:write(string.format('case 311: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		else
			file_attach:write(string.format('case %d: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',skin,modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		end
		io.close(file_attach)
	end
end

function auto_bizinfo(timer)
	lua_thread.create(function( ... )
		if biz_listitem == 0 then
			wait(timer)
			render_bizinfo = {}
			render_bizinfo_timer = os.time()+elements.config.bizinfo_timer.v
		end
		nodial = true
		sampSendChat('/bizinfo')
	end)
end

function cleanStreamMemoryBuffer() -- Очистка памяти
	-- адреса памяти можно взять тут https://github.com/DK22Pac/plugin-sdk/blob/master/plugin_sa/game_sa/CGame.cpp
	callFunction(0x53C500, 2, 2, true, true)
	callFunction(0x53C810, 1, 1, true)
	callFunction(0x40CF80, 0, 0)
	callFunction(0x4090A0, 0, 0)
	callFunction(0x5A18B0, 0, 0)
	callFunction(0x707770, 0, 0)
	callFunction(0x53BED0, 0, 0)
	callFunction(0x53C440, 0, 0)
	callFunction(0x53C4A0, 0, 0)
	callFunction(0x53C240, 0, 0)
	callFunction(0x409760, 0, 0)
	callFunction(0x409210, 0, 0)
	callFunction(0x40D7C0, 1, 1, -1)
	callFunction(0x40E4E0, 0, 0)
	callFunction(0x70C950, 0, 0)
	callFunction(0x408CB0, 0, 0)
	callFunction(0x40E460, 0, 0)
	callFunction(0x407A10, 0, 0)
	callFunction(0x40B3A0, 0, 0)
	callFunction(0x5BA060, 0, 0)
	memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
	memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
	local pX, pY, pZ = getCharCoordinates(PLAYER_PED)
	requestCollision(pX, pY)
	loadScene(pX, pY, pZ)
end

function inventory(var) -- Авто-точилка аксессуаров
	lua_thread.create(function()
		if var == 1 then
			sampSendClickTextdraw(2093)
			wait(500)
			sampSendClickTextdraw(2092) -- ID страницы
		elseif var == 2 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2093) -- ID страницы
		elseif var == 3 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2094) -- ID страницы
		elseif var == 4 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2095) -- ID страницы
		end
	end)
end

function onScriptTerminate(LuaScript, quitGame)
	if LuaScript == thisScript() then
		showCursor(false)
		sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Скрипт выключается =(', 0xFFFFFF)
	end
end

function rgbToHex(rgb)
    local hexadecimal = '0xFF'

    for key, value in pairs(rgb) do
        local hex = ''

        while(value > 0) do
            local index = math.fmod(value, 16) + 1
            value = math.floor(value / 16)
            hex = string.sub('0123456789ABCDEF', index, index) .. hex           
        end

        if(string.len(hex) == 0) then
            hex = '00'

        elseif(string.len(hex) == 1) then
            hex = '0' .. hex
        end

        hexadecimal = hexadecimal .. hex
    end

    return hexadecimal
end

function getColor(color)
	a, r, g, b = explode_argb(color)
	cvet = 
	{
		r,
		g,
		b
	}
	rgb = cvet
	return rgbToHex(rgb)
end

function explode_argb(color)
	return bit.band(bit.rshift(color, 24), 255), bit.band(bit.rshift(color, 16), 255), bit.band(bit.rshift(color, 8), 255), bit.band(color, 255)
end

function join_rgb(r, g, b)
	return bit.bor(bit.bor(b, bit.lshift(g, 8)), bit.lshift(r, 16))
end

local list = {}
function list:new()
	return
	{
		pos =
		{
			x = select(1,getScreenResolution()) - 222,
			y = select(2,getScreenResolution()) - 65
		},
		size =
		{
			x = 200,
			y = 0
		}
	}
end
notfList = list:new()

function onRenderNotification()
	local count = 0
	for k, v in ipairs(_message) do
		local push = false
		if v.active and v.time < os.clock() then
			v.active = false
			table.remove(_message, k)
		end
		if count < 10 then
			if not v.active then
				if v.showtime > 0 then
					v.active = true
					v.time = os.clock() + v.showtime
					v.showtime = 0
				end
			end
			if v.active then
				count = count + 1
				if v.time + 3.000 >= os.clock() then
					imgui.PushStyleVar(imgui.StyleVar.Alpha, (v.time - os.clock()) / 0.3)
					push = true
				end
				local nText = u8(tostring(v.text))
				notfList.size = imgui.GetFont():CalcTextSizeA(imgui.GetFont().FontSize, 200.0, 196.0, nText)
				notfList.pos = imgui.ImVec2(notfList.pos.x, (notfList.pos.y - (count == 1 and notfList.size.y or (notfList.size.y + 40))))
				imgui.SetNextWindowPos(notfList.pos, _, imgui.ImVec2(0.0, 0.0))
				imgui.SetNextWindowSize(imgui.ImVec2(200, notfList.size.y + imgui.GetStyle().ItemSpacing.y + imgui.GetStyle().WindowPadding.y+25))
				imgui.Begin(u8'##msg' .. k, _, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize + imgui.WindowFlags.NoScrollbar + imgui.WindowFlags.NoMove + imgui.WindowFlags.NoTitleBar)
				imgui.CenterText(script_names)
				imgui.Separator()
				imgui.TextUnformatted(nText)
				imgui.End()
				if push then
					imgui.PopStyleVar()
				end
			end
		end
	end
	notfList = list:new()
end

function imgui.Hint(str_id, hint, delay)
	local hovered = imgui.IsItemHovered()
	local animTime = 0.2
	local delay = delay or 0.00
	local show = true

	if not allHints then allHints = {} end
	if not allHints[str_id] then
		allHints[str_id] =
		{
			status = false,
			timer = 0
		}
	end

	if hovered then
		for k, v in pairs(allHints) do
			if k ~= str_id and os.clock() - v.timer <= animTime  then
				show = false
			end
		end
	end

	if show and allHints[str_id].status ~= hovered then
		allHints[str_id].status = hovered
		allHints[str_id].timer = os.clock() + (hovered and delay or 0.00)
	end

	local getContrastColor = function(col)
		local luminance = 1 - (0.299 * col.x + 0.587 * col.y + 0.114 * col.z)
		return luminance < 0.5 and imgui.ImVec4(0, 0, 0, 1) or imgui.ImVec4(1, 1, 1, 1)
	end

	local bg_col = imgui.GetStyle().Colors[imgui.Col.Button]
	local t_col = getContrastColor(bg_col)

	imgui.PushStyleColor(imgui.Col.PopupBg, bg_col)
	imgui.PushStyleColor(imgui.Col.Text, t_col)
	if show then
		local between = os.clock() - allHints[str_id].timer
		if between <= animTime then
			local s = function(f) 
				return f < 0.0 and 0.0 or (f > 1.0 and 1.0 or f)
			end
			local alpha = hovered and s(between / animTime) or s(1.00 - between / animTime)
			imgui.PushStyleVar(imgui.StyleVar.Alpha, alpha)
			imgui.SetTooltip(hint)
			imgui.PopStyleVar()
		elseif hovered then
			imgui.SetTooltip(hint)
		end
	end
	imgui.PopStyleColor(2)
end

function imgui.CenterText(text) 
	local width = imgui.GetWindowWidth()
	local calc = imgui.CalcTextSize(text)
	imgui.SetCursorPosX(width / 2 - calc.x / 2)
	imgui.Text(text)
end

function imgui.TextColoredRGB(text)
	local width = imgui.GetWindowWidth()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local ImVec4 = imgui.ImVec4

	local getcolor = function(color)
		if color:sub(1, 6):upper() == 'SSSSSS' then
			local r, g, b = colors[1].x, colors[1].y, colors[1].z
			local a = tonumber(color:sub(7, 8), 16) or colors[1].w * 255
			return ImVec4(r, g, b, a / 255)
		end
		local color = type(color) == 'string' and tonumber(color, 16) or color
		if type(color) ~= 'number' then return end
		local r, g, b, a = explode_argb(color)
		return imgui.ImColor(r, g, b, a):GetVec4()
	end

	local render_text = function(text_)
		for w in text_:gmatch('[^\r\n]+') do
			local textsize = w:gsub('{.-}', '')
			local text_width = imgui.CalcTextSize((textsize))
			local text, colors_, m = {}, {}, 1
			w = w:gsub('{(......)}', '{%1FF}')
			while w:find('{........}') do
				local n, k = w:find('{........}')
				local color = getcolor(w:sub(n + 1, k - 1))
				if color then
					text[#text], text[#text + 1] = w:sub(m, n - 1), w:sub(k + 1, #w)
					colors_[#colors_ + 1] = color
					m = n
				end
				w = w:sub(1, n - 1) .. w:sub(k + 1, #w)
			end
			if text[0] then
				for i = 0, #text do
					imgui.TextColored(colors_[i] or colors[1], (text[i]))
					imgui.SameLine(nil, 0)
				end
				imgui.NewLine()
			else
				imgui.Text((w))
			end
		end
	end
	render_text(text)
end

function imgui.CenterTextColored(text) 
	local text2 = text:gsub('{(......)}','')
	local width = imgui.GetWindowWidth()
	local calc = imgui.CalcTextSize(text2)
	imgui.SetCursorPosX(width / 2 - calc.x / 2)
	imgui.TextColoredRGB(text)
end

function imgui.CenterWindowText(text,typetext)
	typetext = typetext or imgui.Text
	local windSZ = imgui.GetWindowSize()
	if typetext == imgui.TextColoredRGB then
		local imguiRenderText = text
		text = text:gsub('{(......)}','')
		local txtSZ = imgui.CalcTextSize(text)
		imgui.SetCursorPos(imgui.ImVec2(windSZ.x/2 - txtSZ.x / 2,windSZ.y/2 - txtSZ.y / 2))
		typetext(imguiRenderText)
	else
		local txtSZ = imgui.CalcTextSize(text)
		imgui.SetCursorPos(imgui.ImVec2(windSZ.x/2 - txtSZ.x / 2,windSZ.y/2 - txtSZ.y / 2))
		typetext(text)
	end
end

function onWindowMessage(msg, wparam, lparam)
	--------------------[ALT+Enter fix]--------------------
	if msg == 261 and wparam == 13 then consumeWindowMessage(true, true) end
	--------------------[Закрытие /chat на Esc]--------------------
	if msg == 0x100 or msg == 0x101 then
		if (wparam == 0x1B and windowstate.v) and not isPauseMenuActive() then
			consumeWindowMessage(true, false)
			if msg == 0x101 then
				windowstate.v = false
			end
		end
	end
end

function sampEditChatAlpha(alpha)
    local samp = getModuleHandle("samp.dll")
    if samp ~= nil then
        memory.write(samp + 0x6392F, alpha, 4, true)
        memory.write(samp + 0x63B3B, alpha, 4, true)
        memory.write(samp + 0x63B68, alpha, 4, true)
        memory.write(samp + 0x63B94, alpha, 4, true)

        memory.write(samp + 0x6392F, alpha, 4, true)
        memory.write(samp + 0x63973, alpha, 4, true)
        memory.write(samp + 0x639AC, alpha, 4, true)
        memory.write(samp + 0x639E8, alpha, 4, true)
        memory.write(samp + 0x63A24, alpha, 4, true)
        memory.write(samp + 0x63A5D, alpha, 4, true)
        memory.write(samp + 0x63A99, alpha, 4, true)
        memory.write(samp + 0x63ADC, alpha, 4, true)
    end
end

function autoCarKey()
	local run = false
	addEventHandler("onReceiveRpc", function(id, bs)
		if id == RPC_SCRCLIENTMESSAGE then
			local color = raknetBitStreamReadInt32(bs)
			local text = raknetBitStreamReadString(bs, raknetBitStreamReadInt32(bs))
			if text:match("Необходимо вставить ключи в зажигание. Используйте:") and color == -1347440641 then
				sampSendChat("/key")
				run = true
				lua_thread.create(function()
					wait(500)
					sampSendChat("/engine")
					run = false
				end)
				return false
			end
			if text:match("заглушил%(а%) двигатель") and color == -1029514497 then
				if text:match(tostring(local_name)) and local_name:len() > 0 then
					run = true
					lua_thread.create(function()
						wait(0)
						sampSendChat("/key")
						wait(800)
						run = false
					end)
				end
			end
			if text:match("В этом транспорте закончилось топливо.") and color == -1347440641 then
				sampAddChatMessage('В этом транспорте закончилось топливо.', 0xAFAFAF)
				sampSendChat("/key")
				run = false
			end
			if text:match("Чтобы вызвать механика, используйте телефон") and color == -1347440641 then
				sampSendChat("/key")
				run = false
			end
			if text:match("Вы не в своем авто") and run then
				return false
			end
		end
	end)
end

function autoALT()
	while true do
		wait(0)
		if elements.state.alt == true and not sampIsChatInputActive() then
			setVirtualKeyDown(key.VK_MENU, true)
			wait(0)
			setVirtualKeyDown(key.VK_MENU, false)
		end
	end
end

function autoSPACE()
	while true do
		wait(0)
		if elements.state.alt == true and not sampIsChatInputActive() then
			setVirtualKeyDown(key.VK_SHIFT, true)
			wait(0)
			setVirtualKeyDown(key.VK_SHIFT, false)
		end
	end
end

function renderDateTime()
	while true do
		wait(0)
		local ip, port = sampGetCurrentServerAddress()
		local sx, sy = getScreenResolution()
		if elements.config.renderTime.v == true and (ip == "185.169.134.3" or -- PHOENIX
			ip == "185.169.134.4" or -- TUCSON
			ip == "185.169.134.43" or -- SCOTTDALE
			ip == "185.169.134.44" or -- CHANDLER
			ip == "185.169.134.45" or -- BRAINBURG
			ip == "185.169.134.5" or -- SAINT ROSE
			ip == "185.169.134.59" or -- MESA
			ip == "185.169.134.61" or -- RED ROCK
			ip == "185.169.134.107" or -- YUMA
			ip == "185.169.134.109" or -- SURPRISE
			ip == "185.169.134.166" or -- PRESCOTT
			ip == "185.169.134.171" or -- GLENDALE
			ip == "185.169.134.172" or -- KINGMAN
			ip == "185.169.134.173" or -- WINSLOW
			ip == "185.169.134.174" or -- PAYSON
			ip == "80.66.82.191" or -- GILBERT
			ip == "80.66.82.190" or -- SHOW-LOW
			ip == "80.66.82.188" or -- CASA GRANDE
			ip == "80.66.82.168" or -- PAGE
			ip == "80.66.82.159" or -- SUN CITY
			ip == "80.66.82.190") then -- QUEEN CREEK
			local tWeekdays = 
			{
				[0] = 'Воскресенье',
				[1] = 'Понедельник',
				[2] = 'Вторник',
				[3] = 'Среда',
				[4] = 'Четверг',
				[5] = 'Пятница',
				[6] = 'Суббота'
			}
			----------------------------------------
			local kd_vr = 0
			if vr_timer-os.time() > 0 then
				kd_vr = vr_timer-os.time()
			end
			----------------------------------------
			local kd_fam = 0
			if fam_timer-os.time() > 0 then
				kd_fam = fam_timer-os.time()
			end
			----------------------------------------
			local kd_al = 0
			if al_timer-os.time() > 0 then
				kd_al = al_timer-os.time()
			end
			----------------------------------------
			local kd_zeks = 0
			if autozeks_timer-os.time() > 0 then
				kd_zeks = autozeks_timer-os.time()
			end
			----------------------------------------
			local kd_chest = 0
			if chest_timer_1-os.time() > 0 then
				kd_chest = chest_timer_1-os.time()
			end
			----------------------------------------
			renderFontDrawText(molot_8_5, string.format("[%02d.%02d.%02d || %02d.%02d.%02d] (%s)\n[/vr: %d] [/fam: %d] [/al: %d] [/zeks: %d] [chest: %d]",
			os.date("%d"),os.date("%m"),os.date("%Y"),
			os.date("%H"),os.date("%M"),os.date("%S"),
			tWeekdays[tonumber(os.date("%w"))],
			kd_vr,
			kd_fam,
			kd_al,
			kd_zeks,
			kd_chest), sx / 50, sy - 30, 0xAAFFFFFF)
		end
	end
end

function autoOpenChest()
	local ip, port = sampGetCurrentServerAddress()
	while true do
		wait(0)
		if elements.chest.roll_state.v == true and
			elements.state.buyvk == -1 and
			elements.state.autoloot == false and
			elements.autotoch.autotoch_enable.v == false and
			(ip == "185.169.134.3" or -- PHOENIX
			ip == "185.169.134.4" or -- TUCSON
			ip == "185.169.134.43" or -- SCOTTDALE
			ip == "185.169.134.44" or -- CHANDLER
			ip == "185.169.134.45" or -- BRAINBURG
			ip == "185.169.134.5" or -- SAINT ROSE
			ip == "185.169.134.59" or -- MESA
			ip == "185.169.134.61" or -- RED ROCK
			ip == "185.169.134.107" or -- YUMA
			ip == "185.169.134.109" or -- SURPRISE
			ip == "185.169.134.166" or -- PRESCOTT
			ip == "185.169.134.171" or -- GLENDALE
			ip == "185.169.134.172" or -- KINGMAN
			ip == "185.169.134.173" or -- WINSLOW
			ip == "185.169.134.174" or -- PAYSON
			ip == "80.66.82.191" or -- GILBERT
			ip == "80.66.82.190" or -- SHOW-LOW
			ip == "80.66.82.188" or -- CASA GRANDE
			ip == "80.66.82.168" or -- PAGE
			ip == "80.66.82.159" or -- SUN CITY
			ip == "80.66.82.190") then -- QUEEN CREEK
			if elements.chest.roll_standart.v == true and chest_timer_1 <= os.time() and chest_timer_1 ~= 0 then
				chest_timer_1 = 0
				chest_timer_2 = os.time()+2
				active = true
				sampSendChat("/invent")
			end
			if elements.chest.roll_platinum.v == true and chest_timer_2 <= os.time() and chest_timer_2 ~= 0 then
				chest_timer_2 = 0
				chest_timer_3 = os.time()+2
				sampSendClickTextdraw(65535)
				active2 = true
				sampSendChat("/invent")
			end
			if elements.chest.roll_maska.v == true and chest_timer_3 <= os.time() and chest_timer_3 ~= 0 then
				chest_timer_3 = 0
				chest_timer_1 = os.time()+(elements.chest.roll_wait.v*60)
				sampSendClickTextdraw(65535)
				active3 = true
				sampSendChat("/invent")
			end
		end
	end
end

function autoTrunk()
	while true do
		wait(0)
		if isKeyDown(VK_MENU) and sampGetCurrentServerAddress() ~= "127.0.0.1" then
			for _, carhandle in ipairs(getAllVehicles()) do
				if carhandle then
					local x, y, z = getCarCoordinates(carhandle)
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local result, car = sampGetVehicleIdByCarHandle(carhandle)
					if result then
						if getDistanceBetweenCoords3d(mypos_x, mypos_y, mypos_z, x, y, z) < 5 then
							sampSendChat("/trunk "..car)
							wait(400)
							break
						end
					end
				end
			end
		end
	end
end

function setWeatherTime()
	while true do
		wait(0)
		if elements.config.set_time.v ~= memory.read(0xC81320, 2, false) then
			local bs = raknetNewBitStream()
			raknetBitStreamWriteInt8(bs, elements.config.set_time.v)
			raknetBitStreamWriteInt8(bs, 0)
			raknetEmulRpcReceiveBitStream(29, bs)
			raknetDeleteBitStream(bs)
		end
		if elements.config.set_weather.v ~= memory.read(0xB70153, 1, false) then
			local bs = raknetNewBitStream()
			raknetBitStreamWriteInt8(bs, elements.config.set_weather.v)
			raknetEmulRpcReceiveBitStream(152, bs)
			raknetDeleteBitStream(bs)
		end
	end
end

function autoPiar()
	while true do
		wait(0)
		if sampGetCurrentServerAddress() == "185.169.134.5" then
			--------------------[Автопиар /vr]--------------------
			if elements.autopiar.vr_active.v and vr_timer == os.time() then
				if elements.autopiar.vr_text.v == '' and elements.autopiar.vr_text_2.v == '' then
					elements.autopiar.vr_active.v = false	
				else
					--------------------------------
					vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
					--------------------------------
					if elements.autopiar.vr_text.v == '' then
						sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text_2.v))
					elseif elements.autopiar.vr_text_2.v == '' then
						sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
					else
						--------------------------------
						math.randomseed(os.time())
						local rand_vr = math.random(2)
						--------------------------------
						if rand_vr == 1 then
							sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
						else
							sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text_2.v))
						end
						--------------------------------
					end
				end
			end
			--------------------[Автопиар /fam]--------------------
			if elements.autopiar.fam_active.v and fam_timer == os.time() then
				if elements.autopiar.fam_text.v == '' and elements.autopiar.fam_text_2.v == '' then
					elements.autopiar.fam_active.v = false	
				else
					--------------------------------
					fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
					--------------------------------
					if elements.autopiar.fam_text.v == '' then
						sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text_2.v))
					elseif elements.autopiar.fam_text_2.v == '' then
						sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
					else
						--------------------------------
						math.randomseed(os.time())
						local rand_fam = math.random(2)
						--------------------------------
						if rand_fam == 1 then
							sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
						else
							sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text_2.v))
						end
						--------------------------------
					end
				end
			end
			--------------------[Автопиар /al]--------------------
			if elements.autopiar.al_active.v and al_timer == os.time() then
				if elements.autopiar.al_text.v == '' and elements.autopiar.al_text_2.v == '' then
					elements.autopiar.al_active.v = false	
				else
					--------------------------------
					al_timer = os.time()+(elements.autopiar.al_delay.v*60)
					--------------------------------
					if elements.autopiar.al_text.v == '' then
						sampSendChat(u8:decode('/al '..elements.autopiar.al_text_2.v))
					elseif elements.autopiar.al_text_2.v == '' then
						sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
					else
						--------------------------------
						math.randomseed(os.time())
						local rand_al = math.random(2)
						--------------------------------
						if rand_al == 1 then
							sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
						else
							sampSendChat(u8:decode('/al '..elements.autopiar.al_text_2.v))
						end
						--------------------------------
					end
				end
			end
		end
	end
end

function autoLoot()
	local sx, sy = getScreenResolution()
	while true do
		wait(0)
		if elements.state.autoloot == true then
			renderFontDrawText(arial_12_5,'autoloot {33AA33}enable', sx / 20, sy - 260, 0xFF3300FF)
			for i = 2000, 2160 do
				if sampTextdrawIsExists(i) then
					local model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(i)
					if model ~= 1649 then
						x, y = sampTextdrawGetPos(i)
						--------------------[Первая строка]--------------------
						if x == 184.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 1
						elseif x == 211 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 2
						elseif x == 237.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 3
						elseif x == 264 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 4
						elseif x == 290.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 5
						--------------------[Вторая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 6
						elseif x == 211 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 7
						elseif x == 237.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 8
						elseif x == 264 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 9
						elseif x == 290.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 10
						--------------------[Третья строка]--------------------
						elseif x == 184.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 11
						elseif x == 211 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 12
						elseif x == 237.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 13
						elseif x == 264 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 14
						elseif x == 290.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 15
						--------------------[Четвертая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 16
						elseif x == 211 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 17
						elseif x == 237.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 18
						elseif x == 264 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 19
						elseif x == 290.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 20
						--------------------[Пятая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 21
						elseif x == 211 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 22
						elseif x == 237.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 23
						elseif x == 264 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 24
						elseif x == 290.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 25
						--------------------[Шестая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 26
						elseif x == 211 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 27
						elseif x == 237.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 28
						elseif x == 264 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 29
						elseif x == 290.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 30
						end
					end
				end
			end
		end
	end
end

function functionNicks()
	local sx, sy = getScreenResolution()
	while true do
		wait(0)
		if elements.state.nicks == true then
			local players_count = 0
			for i = 0, sampGetMaxPlayerId(true) do -- true - максимальный ID в зоне стрима
				local result, ped = sampGetCharHandleBySampPlayerId(i)
				if result and doesCharExist(ped) then
					players_count = players_count + 1
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
					local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
					----------------------------------------
					local playername = sampGetPlayerNickname(i)
					local color = sampGetPlayerColor(i)
					----------------------------------------
					local afk = ""
					if sampIsPlayerPaused(i) then
						afk = "{FF3300}(AFK)"
					end
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 1, getColor(color))
					renderFontDrawText(arial_9_5, playername..'['..i..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
				end
			end
			if players_count < 2 then
				renderFontDrawText(arial_12_5,'Игроков в зоне стрима: '..players_count, sx / 5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial_12_5,'Игроков в зоне стрима: '..players_count, sx / 5, sy - 30, 0xFFFF0000)
			end
		end
	end
end

function functionFinds()
	while true do
		wait(0)
		if elements.state.finds ~= 65535 then
			if sampIsPlayerConnected(elements.state.finds) then
				local result, ped = sampGetCharHandleBySampPlayerId(elements.state.finds) 
				if result and doesCharExist(ped) then
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
					local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					local distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
					local playername = sampGetPlayerNickname(elements.state.finds)
					local color = sampGetPlayerColor(elements.state.finds)
					----------------------------------------
					local afk = ""
					if sampIsPlayerPaused(elements.state.finds) then
						afk = "{FF3300}(AFK)"
					end
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
					renderFontDrawText(arial_12_5, playername..'['..elements.state.finds..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
				end
			else
				elements.state.finds = 65535
				push_message('Выключаю поиск игрока (disconnect).')
			end
		end
	end
end

function renderDeer()
	local sx, sy = getScreenResolution()
	while true do
		wait(0)
		if elements.state.olen == true then
			local olen_count = 0
			for _, i in pairs(getAllObjects()) do
				if getObjectModel(i) == 19315 then
					olen_count = olen_count + 1
					if isObjectOnScreen(i) then
						local result, oX, oY, oZ = getObjectCoordinates(i)
						------------------------------------
						local x1, y1 = convert3DCoordsToScreen(oX,oY,oZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						local distance = string.format("%.0f",getDistanceBetweenCoords3d(oX, oY, oZ, PlayerX, PlayerY, PlayerZ))
						------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, 0xFF3300FF) 
						renderFontDrawText(arial_12_5,"{FF0000}Олень: {3300FF}"..distance, x1, y1, -1)
					end
				end
			end
			if olen_count == 0 then
				renderFontDrawText(arial_12_5,'Оленей в зоне стрима: '..olen_count, sx / 2.5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial_12_5,'Оленей в зоне стрима: '..olen_count, sx / 2.5, sy - 30, 0xFFFF0000)
			end
		end
	end
end

function renderPacket()
	while true do
		wait(0)
		if elements.state.show_packet == true then
			local packet_x = 35
			local packet_y = 450
			local rpc_x = 35
			local rpc_y = 490
			renderFontDrawText(arial_12_5, 'INCOMING Packet: {FFFFFF}'..packet_incoming..'\n{FFFF00}OUTCOMING Packet: {FFFFFF}'..packet_outcoming, packet_x, packet_y, 0xFFFF0000)
			renderFontDrawText(arial_12_5, 'INCOMING RPC: {FFFFFF}'..rpc_incoming..'\n{FFFF00}OUTCOMING RPC: {FFFFFF}'..rpc_outcoming, rpc_x, rpc_y, 0xFFFF0000)
		end
	end
end

function renderOpenBagajnik()
	local ip, port = sampGetCurrentServerAddress()
	while true do
		wait(0)
		if ip == "185.169.134.3" or -- PHOENIX
			ip == "185.169.134.4" or -- TUCSON
			ip == "185.169.134.43" or -- SCOTTDALE
			ip == "185.169.134.44" or -- CHANDLER
			ip == "185.169.134.45" or -- BRAINBURG
			ip == "185.169.134.5" or -- SAINT ROSE
			ip == "185.169.134.59" or -- MESA
			ip == "185.169.134.61" or -- RED ROCK
			ip == "185.169.134.107" or -- YUMA
			ip == "185.169.134.109" or -- SURPRISE
			ip == "185.169.134.166" or -- PRESCOTT
			ip == "185.169.134.171" or -- GLENDALE
			ip == "185.169.134.172" or -- KINGMAN
			ip == "185.169.134.173" or -- WINSLOW
			ip == "185.169.134.174" or -- PAYSON
			ip == "80.66.82.191" or -- GILBERT
			ip == "80.66.82.190" or -- SHOW-LOW
			ip == "80.66.82.188" or -- CASA GRANDE
			ip == "80.66.82.168" or -- PAGE
			ip == "80.66.82.159" or -- SUN CITY
			ip == "80.66.82.190" or -- QUEEN CREEK
			ip == "80.66.82.147" then -- Vice City
			if carid ~= -1 then
				result, carhandle = sampGetCarHandleBySampVehicleId(carid)
				if carhandle ~= -1 then
					-- if carid >= 858 then
					if carid >= 0 then
						local x, y, z = getCarCoordinates(carhandle)
						local name_vehicle = getNameOfVehicleModel(getCarModel(carhandle))
						
						if name_vehicle ~= nil then
							----------------------------------------
							printString('~p~OPEN BAGAJHUK~n~'..name_vehicle..'['..carid..']',1000)
							----------------------------------------
							local x2, y2 = convert3DCoordsToScreen(x, y, z)
							local PlayerX3, PlayerY3, PlayerZ3 = getCharCoordinates(PLAYER_PED)
							local PlayerX4, PlayerY4 = convert3DCoordsToScreen(PlayerX3, PlayerY3, PlayerZ3)
							local distance = string.format("%.0f",getDistanceBetweenCoords3d(x, y, z, PlayerX3, PlayerY3, PlayerZ3))
							----------------------------------------
							renderDrawLine(PlayerX4, PlayerY4, x2, y2, 2, 0x8B00FFFF) 
							renderFontDrawText(arial_12_5,"{8B00FF}"..name_vehicle.."["..carid.."]\nБагажник: {3300FF}"..distance, x2, y2, -1)
						end
					end
				else
					carid = -1
				end
			end
		end
	end
end

function renderTextdraws()
	while true do
		wait(0)
		--------------------[ID's текстдравов]--------------------
		if elements.state.showid == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					local x, y = sampTextdrawGetPos(i)
					local x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					renderFontDrawText(molot_8_5, i, x1, y1, 0xFFBEBEBE)
				end
			end
		end
		--------------------[X / Y текстдравов]--------------------
		if elements.state.showpos == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					local x, y = sampTextdrawGetPos(i)
					local x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					renderFontDrawText(molot_8_5, 'x: '..math.floor(x)..'\ny: '..math.floor(y), x1, y1, 0xFFBEBEBE)
				end
			end
		end
		--------------------[MODEL's текстдравов]--------------------
		if elements.state.showmodel == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					local x, y = sampTextdrawGetPos(i)
					local x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					local model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(i)
					if model ~= 0 and model ~= 1649 then
						renderFontDrawText(molot_8_5, model, x1, y1, 0xFFBEBEBE)
					end
				end
			end
		end
	end
end

function renderProdovoz()
	while true do
		wait(0)
		----------------------------------------
		if prodovoz_timer >= os.time() then
			printString(string.format('~g~OTKAT: %d cek',prodovoz_timer-os.time()),2000)
			if prodovoz_timer == os.time() then
				sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Ты снова можешь закупить продукты.', 0xFFFFFF)
				prodovoz_timer = 0
			end
		end
		----------------------------------------
		if isCharInAnyCar(PLAYER_PED) and getCarModel( storeCarCharIsInNoSave(PLAYER_PED) ) == 456 then
			for i = 0, 2048 do
				if sampIs3dTextDefined(i) then
					local text, color, posX, posY, posZ, distance, ignoreWalls, player, vehicle = sampGet3dTextInfoById(i)
					if text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин 24/7') and text:find('продуктов с разгрузочной станции.') or
						text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин аксессуаров') and text:find('продуктов с разгрузочной станции.') or
						text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин одежды') and text:find('продуктов с разгрузочной станции.') then
						----------------------------------------
						local buy_prods = string.match(text,'Скупает {CBB42F}(%d+)')
						local price_prods = string.match(text,'предмета: {CBB42F}(%d+)')
						----------------------------------------
						local x10, y10 = convert3DCoordsToScreen(posX, posY, posZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						local distance = string.format("%.0f",getDistanceBetweenCoords3d(posX, posY, posZ, PlayerX, PlayerY, PlayerZ))
						----------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x10, y10, 2, 0xFF3300FF)
						renderFontDrawText(arial_12_5,'{CBB42F}Бизнес скупает {33AA33}'..buy_prods..'{CBB42F} продуктов\nСтоимость 1 продукта {33AA33}'..price_prods..'${CBB42F}\nДистанция: {3300FF}'..distance..'м.', x10, y10, -1)	
					end
				end
			end
		end
	end
end

-- function renderQuest()
	-- while true do
	-- wait(0)
	----------------------------------
		-- for i = 0, 2048 do
			-- if sampIs3dTextDefined(i) then
				-- local text, color, posX, posY, posZ, distance, ignoreWalls, player, vehicle = sampGet3dTextInfoById(i)
				-- if text:find('ALT') then
					----------------------------------
					-- local x10, y10 = convert3DCoordsToScreen(posX, posY, posZ)
					-- local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
					-- local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					-- local distance = string.format("%.0f",getDistanceBetweenCoords3d(posX, posY, posZ, PlayerX, PlayerY, PlayerZ))
					----------------------------------
					-- renderDrawLine(PlayerX2, PlayerY2, x10, y10, 2, 0xFF3300FF)
					-- renderFontDrawText(arial_12_5,'Предмет', x10, y10, -1)	
				-- end
			-- end
		-- end
	-- end
-- end

function renderCalculator()
	while true do
		wait(0)
		--------------------[Калькулятор]--------------------
		local text = sampGetChatInputText()
		----------------------------------------
		if text:find('%d+') and text:find('[-+/*^%%]') and not text:find('%a+') and text ~= nil then
			ok, number = pcall(load('return '..text))
			result_calc = 'Результат: '..number
		end
		----------------------------------------
		if text:find('%d+%%%*%d+') then
			number1, number2 = text:match('(%d+)%%%*(%d+)')
			number = number1*number2/100
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number
		end
		----------------------------------------
		if text:find('%d+%%%/%d+') then
			number1, number2 = text:match('(%d+)%%%/(%d+)')
			number = number2/number1*100
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number
		end
		----------------------------------------
		if text:find('%d+/%d+%%') then
			number1, number2 = text:match('(%d+)/(%d+)%%')
			number = number1*100/number2
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number..'%'
		end
		----------------------------------------
		if text == '' then
			ok = false
		end
		imgui.Process = ok
	end
end

function autoClickKey()
	while true do
		wait(0)
		--------------------[Авто-сбор шара]--------------------
		local text = sampTextdrawGetString(2069)
		if text:match("%[ ~p~%u+~w~ %]") then
			setGameKeyState(16, 255) -- Shift
			setGameKeyState(21, 255) -- Alt
			setGameKeyState(9, 255)
			wait(0)
			setGameKeyState(16, 0) -- Shift
			setGameKeyState(21, 0) -- Alt
			setGameKeyState(9, 0)
		end
		--------------------[Авто-N/Y]--------------------
		local text = sampTextdrawGetString(2062)
		if text:match("Press_N") then
			setGameKeyState(10, 255) -- N
			wait(0)
			setGameKeyState(10, 0) -- N
		end
		if text:match("Press_Y") then
			setGameKeyState(11, 255) -- Y
			wait(0)
			setGameKeyState(11, 0) -- Y
		end
	end
end

function autoBuyVK()
	while true do
		wait(0)
		if elements.state.buyvk ~= -1 and sampIsDialogActive() then
			if sampGetCurrentDialogId() == 25012 then
				sampSendDialogResponse(25012, 1, elements.state.buyvk, nil)
			end
			wait(100)
			if sampGetCurrentDialogId() == 25013 then
				sampSendDialogResponse(25013, 1, 0, nil)
			end
		end
	end
end

function autoZeks()
	while true do
		wait(0)
		if elements.config.autozeks.v == true and sampGetCurrentServerAddress() == "185.169.134.5" then
			if autozeks_timer <= os.time() then
				sampSendChat("/zeks")
				autozeks_timer = os.time()+9
			end
		end
	end
end

function offAnims()
	while true do
		wait(0)
		if animStatus and not (sampIsChatInputActive() or sampIsDialogActive() or isSampfuncsConsoleActive()) then
			if sampGetPlayerIdByCharHandle(PLAYER_PED) and isKeyJustPressed(32) then
				taskPlayAnim(PLAYER_PED,"crry_prtial","CARRY",4.0,false,false,false,false,-1)
				animStatus = false
			end
		end
	end
end

function number_separator(n)
	local left, num, right = string.match(n,'^([^%d]*%d)(%d*)(.-)$')
	return left..(num:reverse():gsub('(%d%d%d)','%1.'):reverse())..right
end

function separator(text)
	if text:find("$") then
	    for S in string.gmatch(text, "%$%d+") do
	    	local replace = number_separator(S)
	    	text = string.gsub(text, S, replace)
	    end
	    for S in string.gmatch(text, "%d+%$") do
	    	S = string.sub(S, 0, #S-1)
	    	local replace = number_separator(S)
	    	text = string.gsub(text, S, replace)
	    end
	end
	return text
end

function sampGetCurentPlayerID()
	local r, id = sampGetPlayerIdByCharHandle(PLAYER_PED)
	if not r then return nil
	else return id end
end

function ApplyAnimation(name, nameLib, speed, loop, lockX, lockY, lockF)
	if not isCharInAnyCar(PLAYER_PED) then
		animStatus = true
		taskPlayAnim(PLAYER_PED, name, nameLib, speed, loop, lockX, lockY, lockF, -1)
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Для отключения анимации нажми SPACE.', 0xFFFFFF)
	else
		sampAddChatMessage('{FF3300}x{AFAFAF} Невозможно использовать в транспорте.',0xAFAFAF)
	end
end

function autoupdate(json_url, prefix, url)
	sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Проверка обновлений...', 0xFFFFFF)
	local dlstatus = require('moonloader').download_status
	local json = getWorkingDirectory() .. '\\'..script_names..'-version.json'
	if doesFileExist(json) then os.remove(json) end
	downloadUrlToFile(json_url, json,
		function(id, status, p1, p2)
			if status == dlstatus.STATUSEX_ENDDOWNLOAD then
				if doesFileExist(json) then
					local file_autoupdate = io.open(json, 'r')
					if file_autoupdate then
						local info = decodeJson(file_autoupdate:read('*a'))
						updatelink = info.updateurl
						updateversion = info.latest
						file_autoupdate:close()
						os.remove(json)
						if updateversion > thisScript().version then
							lua_thread.create(function(prefix)
								local dlstatus = require('moonloader').download_status
								sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Доступно новое обновление! Пытаюсь обновиться c '..thisScript().version..' на '..updateversion, 0xFFFFFF)
								wait(250)
								downloadUrlToFile(updatelink, thisScript().path,
									function(id3, status1, p13, p23)
										if status1 == dlstatus.STATUS_DOWNLOADINGDATA then
										elseif status1 == dlstatus.STATUS_ENDDOWNLOADDATA then
											sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Мы успешно обновились до версии '..updateversion..'.', 0xFFFFFF)
											goupdatestatus = true
											lua_thread.create(function()
												wait(500)
												thisScript():reload()
											end)
										end
										if status1 == dlstatus.STATUSEX_ENDDOWNLOAD then
											if goupdatestatus == nil then
												sampAddChatMessage('['..thisScript().name..'{FFFFFF}] К сожалению не удалось обновить скрипт.', 0xFFFFFF)
												update = false
											end
										end
									end
								)
								end, prefix
							)
						else
							sampAddChatMessage('['..thisScript().name..' (L) '..thisScript().version..'{FFFFFF}] Обновлений не найдено.', 0xFFFFFF)
							update = false
						end
					end
				else
					update = false
				end
			end
		end
	)
	while
		update ~= false
	do
		wait(100)
	end
end

function theme()
	imgui.SwitchContext()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local clr = imgui.Col
	local ImVec4 = imgui.ImVec4
	local ImVec2 = imgui.ImVec2

	style.WindowPadding = imgui.ImVec2(8, 8)
	style.WindowRounding = 6
	style.ChildWindowRounding = 5
	style.FramePadding = imgui.ImVec2(5, 3)
	style.FrameRounding = 3.0
	style.ItemSpacing = imgui.ImVec2(5, 4)
	style.ItemInnerSpacing = imgui.ImVec2(4, 4)
	style.IndentSpacing = 21
	style.ScrollbarSize = 10.0
	style.ScrollbarRounding = 13
	style.GrabMinSize = 8
	style.GrabRounding = 1
	style.WindowTitleAlign = imgui.ImVec2(0.5, 0.5)
	style.ButtonTextAlign = imgui.ImVec2(0.5, 0.5)

	colors[clr.Text]					= ImVec4(0.95, 0.96, 0.98, 1.00);
	colors[clr.TextDisabled]			= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v);
	colors[clr.WindowBg]				= ImVec4(0.14, 0.14, 0.14, 0.95);
	colors[clr.ChildWindowBg]			= ImVec4(0.17, 0.17, 0.17, 1.00);
	colors[clr.PopupBg]					= ImVec4(0.08, 0.08, 0.08, 0.94);
	colors[clr.Border]					= ImVec4(0.14, 0.14, 0.14, 1.00);
	colors[clr.BorderShadow]			= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v);
	colors[clr.FrameBg]					= ImVec4(0.22, 0.22, 0.22, 1.00);
	colors[clr.FrameBgHovered]			= ImVec4(0.18, 0.18, 0.18, 1.00);
	colors[clr.FrameBgActive]			= ImVec4(0.10, 0.10, 0.10, 1.00);
	colors[clr.TitleBg]					= ImVec4(0.14, 0.14, 0.14, 0.81);
	colors[clr.TitleBgActive]			= ImVec4(0.12, 0.12, 0.12, 1.00); -- Шапка
	colors[clr.TitleBgCollapsed]		= ImVec4(0.00, 0.00, 0.00, 0.51);
	colors[clr.MenuBarBg]				= ImVec4(0.20, 0.20, 0.20, 1.00);
	colors[clr.ScrollbarBg]				= ImVec4(0.02, 0.02, 0.02, 0.39); -- Скролл бар
	colors[clr.ScrollbarGrab]			= ImVec4(0.36, 0.36, 0.36, 1.00); -- Скролл бар
	colors[clr.ScrollbarGrabHovered]	= ImVec4(0.18, 0.22, 0.25, 1.00); -- Скролл бар
	colors[clr.ScrollbarGrabActive]		= ImVec4(0.24, 0.24, 0.24, 1.00); -- Скролл бар
	colors[clr.ComboBg]					= ImVec4(0.24, 0.24, 0.24, 1.00);
	colors[clr.CheckMark]				= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v);
	colors[clr.SliderGrab]				= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v);
	colors[clr.SliderGrabActive]		= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v);
	colors[clr.Button]					= ImVec4(0.22, 0.22, 0.22, 1.00); -- Кнопки
	colors[clr.ButtonHovered]			= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v); -- Mouse Select Кнопки
	colors[clr.ButtonActive]			= ImVec4(1.00, 0.39, 0.39, 1.00); -- Кнопки во время нажатия
	colors[clr.Header]					= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v); -- Заголовки
	colors[clr.HeaderHovered]			= ImVec4(0.22, 0.22, 0.22, 1.00); -- Mouse Select Заголовки
	colors[clr.HeaderActive]			= ImVec4(1.00, 0.39, 0.39, 1.00); -- Заголовки во время нажатия
	colors[clr.ResizeGrip]				= ImVec4(elements.config.theme_colorR.v, elements.config.theme_colorG.v, elements.config.theme_colorB.v, elements.config.theme_colorA.v);
	colors[clr.ResizeGripHovered]		= ImVec4(0.22, 0.22, 0.22, 1.00);
	colors[clr.ResizeGripActive]		= ImVec4(1.00, 0.19, 0.19, 1.00);
	colors[clr.CloseButton]				= ImVec4(0.40, 0.39, 0.38, 0.16); -- Фон Крестика
	colors[clr.CloseButtonHovered]		= ImVec4(0.40, 0.39, 0.38, 0.39); -- Mouse Select Крестик
	colors[clr.CloseButtonActive]		= ImVec4(0.40, 0.39, 0.38, 1.00); -- Крестик во время нажатия
	colors[clr.PlotLines]				= ImVec4(0.61, 0.61, 0.61, 1.00);
	colors[clr.PlotLinesHovered]		= ImVec4(1.00, 0.43, 0.35, 1.00);
	colors[clr.PlotHistogram]			= ImVec4(1.00, 0.39, 0.39, 1.00);
	colors[clr.PlotHistogramHovered]	= ImVec4(1.00, 0.18, 0.18, 1.00);
	colors[clr.TextSelectedBg]			= ImVec4(1.00, 0.32, 0.32, 1.00);
	colors[clr.ModalWindowDarkening]	= ImVec4(0.26, 0.26, 0.26, 0.60);
end
theme()

function patch() -- Быстрая загрузка
	if memory.getuint8(0x748C2B) == 0xE8 then
		memory.fill(0x748C2B, 0x90, 5, true)
	elseif memory.getuint8(0x748C7B) == 0xE8 then
		memory.fill(0x748C7B, 0x90, 5, true)
	end
	if memory.getuint8(0x5909AA) == 0xBE then
		memory.write(0x5909AB, 1, 1, true)
	end
	if memory.getuint8(0x590A1D) == 0xBE then
		memory.write(0x590A1D, 0xE9, 1, true)
		memory.write(0x590A1E, 0x8D, 4, true)
	end
	if memory.getuint8(0x748C6B) == 0xC6 then
		memory.fill(0x748C6B, 0x90, 7, true)
	elseif memory.getuint8(0x748CBB) == 0xC6 then
		memory.fill(0x748CBB, 0x90, 7, true)
	end
	if memory.getuint8(0x590AF0) == 0xA1 then
		memory.write(0x590AF0, 0xE9, 1, true)
		memory.write(0x590AF1, 0x140, 4, true)
	end
end
patch()