--script_name("{330000}Ar{430006}iz{53000b}on{64000d}a H{75000e}el{86000d}pe{97000a}r")
script_name("{0d00ff}Ar{2900ff}iz{3900ff}on{4500ff}a H{4f00ff}el{5800ff}pe{6000ff}r")
local script_names = "Arizona Helper"

script_version('4.75')
script_author("metk1u")

local script_vers = 104

local coords = 
{
	{-2878.6, 2566.78, 261.623, 1}, {578.14, 391.6, 9.52, 1}, {-767.179, -634.492, 65.9385, 1}, {514.602, -1807.3, 5.60423, 1}, {-1315.13, -1500.91, 21.61, 1}, 
	{-2796.82, 234.58, 5.94, 1}, {-818.117, 2829.21, 1501.79, 1}, {-2378.54, 2490.19, 7.11762, 1}, {-1791.88, 2902.3, 54.8041, 0}, {-1708.63, 2548.91, 102.403, 1}, 
	{-1522.81, 2707.73, 54.5414, 1}, {-1441.44, 2798.72, 85.2168, 1}, {-1313.77, 2541.4, 86.5095, 1}, {-801.438, 2776.11, 44.7718, 1}, {-599.154, 2606.75, 64.6538, 1}, 
	{387.734, 2613.13, 15.1859, 1}, {1434.82, 2517.38, 9.60862, 1}, {1564.12, 2862.23, 9.50327, 1}, {1952.56, 2728.77, 9.58187, 1}, {2227.56, 2537.82, 9.8843, 1}, 
	{2369.33, 2796.52, 9.54315, 1}, {1338.95, -1792.42, 12.2595, 1}, {2647.71, 2729.59, 9.56223, 1}, {2788.85, 2536.9, 9.58631, 1}, {2813.89, 2931.56, 28.4195, 1}, 
	{-2638.24, 2327.49, 7.06923, 1}, {-2606.56, 2245.97, 4.60404, 1}, {-2661.93, 2193.42, 51.6087, 1}, {-2091.86, 2313.32, 25.9141, 0}, {-1657.3, 2244.11, 15.722, 1}, 
	{-1710.74, 2110.3, 24.9909, 1}, {-1158.2, 2215.32, 93.2691, 1}, {-1146.9, 2343.85, 96.9653, 1}, {761.799, 2078.89, 5.40633, 1}, {1096.69, 2123.14, 9.52043, 1}, 
	{1618.02, 2212.91, 9.55198, 1}, {1786.93, 2159.96, 11.7232, 0}, {1891.05, 2012.86, 6.36527, 1}, {2383.02, 2012.41, 9.88537, 1}, {2626.4, 2185.34, 9.71282, 1}, 
	{2657.16, 2309.32, 10.8203, 0}, {2592.02, 2391.65, 15.8071, 1}, {-1771.28, 1978.39, 14.4526, 1}, {-1513.6, 1971.61, 47.1603, 1}, {-606.568, 1832.35, 5.85018, 1}, 
	{-531.054, 1807.34, 137.521, 1}, {-521.42, 1649.1, -0.22815, 1}, {-183.337, 1888.64, 114.395, 1}, {1368.92, 1916.1, 9.59057, 1}, {1693.3, 1953.77, 9.78182, 1}, 
	{2032.57, 1728.36, 9.51405, 1}, {2675.73, 1661.19, 9.73563, 1}, {-2910.57, 1210.99, 0.89121, 1}, {-2802.02, 1194.18, 19.5709, 1}, {-2681.24, 1262.4, 15.7395, 1}, 
	{-2547.49, 1229.62, 36.1455, 1}, {-2452.23, 1005.49, 45.7741, 1}, {-2298.91, 1095.45, 69.9223, 1}, {-1970.75, 993.301, 57.388, 1}, {-1895.22, 1264.94, 20.4278, 1}, 
	{-1809.82, 1406.42, 5.86155, 1}, {-1740.16, 1234.39, 6.3459, 1}, {-1643.61, 1323.49, 1.71206, 1}, {-220.102, 1401.69, 68.6655, 1}, {102.492, 1019.75, 12.3152, 1}, 
	{1279.51, 1179.57, 9.54895, 1}, {1486.42, 1107.67, 9.56224, 1}, {1751.78, 1477.56, 9.5184, 1}, {2758.67, 1460.39, 9.5592, 1}, {-2877, 519.103, -0.65761, 1}, 
	{-2687.66, 771.777, 42.3904, 1}, {-2586.41, 867.345, 57.2109, 1}, {-2500.29, 940.168, 61.3867, 1}, {-2321.08, 534.314, 43.4735, 1}, {-2218.75, 964.7, 78.9423, 1}, 
	{-2172.23, 833.454, 68.4769, 1}, {-1955.38, 764.659, 54.4665, 1}, {-1398.13, 678.462, 1.78513, 1}, {-720.957, 687.53, 5.43983, 1}, {1420.51, 905.624, 10.9297, 0}, 
	{1531.85, 925.756, 9.49611, 1}, {1691.2, 890.222, 9.54726, 1}, {2801.42, 695.427, 8.79808, 1}, {-2665.44, 144.834, 3.15551, 1}, {-2644.73, 205.761, 3.09554, 1}, 
	{-2618.54, 417.879, 3.01013, 1}, {-2540.48, 204.961, 9.85806, 1}, {-2516.62, 267.806, 21.4084, 1}, {-1381.56, 89.1305, 1.67274, 1}, {-592.001, 162.934, 19.8715, 1}, 
	{386.02, 79.9867, 3.67252, 1}, {1018.62, 164.008, 30.7292, 1}, {1253.09, 365.005, 18.2851, 1}, {-2753.8, -180.006, 5.76931, 1}, {-2754.33, -416.241, 5.64813, 1}, 
	{-2633.57, -309.622, 6.99836, 1}, {-2538.33, -301.498, 26.1641, 1}, {-2438.95, -294.56, 39.1314, 1}, {-2455.34, -139.799, 24.8976, 1}, {-2479.26, -33.4793, 32.3406, 1}, 
	{-2183.66, -435.824, 34.7828, 1}, {-1128.93, -150.148, 12.9581, 1}, {-904.665, -113.447, 55.3798, 1}, {-488.254, -171.718, 76.9443, 1}, {285.178, -30.1081, 1.00885, 1}, 
	{1562.12, -337.72, 13.889, 1}, {1774.98, -375.948, 85.722, 1}, {-2942.91, -679.805, -0.36174, 1}, {-2665.78, -716.145, 62.3053, 1}, {-1507.72, -905.577, 183.845, 1}, 
	{-1111.71, -748.102, 30.7602, 1}, {2572.7, -634.422, 134.543, 1}, {-2515.89, -1034.21, 102.696, 1}, {-2499.86, -1142.27, 141.239, 1}, {-2133.4, -1413.64, 198.723, 1}, 
	{-1591.98, -1345.45, 48.1512, 1}, {-1365.29, -1374.25, 143.094, 1}, {-206.244, -1018.09, 16.3022, 1}, {164.188, -1260.61, 71.9953, 1}, {230.846, -1391.44, 51.8677, 1}, 
	{633.826, -1172.81, 37.8084, 1}, {813.007, -1267.99, 12.2605, 1}, {848.089, -1359.79, 12.3194, 1}, {856.703, -1476.42, 13.097, 1}, {962.894, -1251.63, 15.72, 1}, 
	{1084.11, -1187.01, 18.3092, 0}, {1293.32, -1210.96, 12.4432, 1}, {1386.82, -992.381, 29.4842, 1}, {1830.59, -1145.55, 22.5787, 1}, {2094.34, -1429.77, 22.5141, 1}, 
	{21, -1123.87, 29.2587, 1}, {2485.35, -1071.16, 65.5284, 1}, {2549.77, -1332.7, 32.8686, 1}, {2785.59, -1087.69, 29.4599, 1}, {-2969.78, -1716.95, -0.3379, 1}, 
	{-2380.35, -1698.97, 467.388, 1}, {-2013.78, -1605.43, 141.858, 1}, {-1131.43, -1759.32, 114.55, 1}, {-497.869, -1952.25, 35.7327, 1}, {-209.757, -1576.14, 5.19303, 1}, 
	{412.494, -1812.73, 4.23272, 1}, {757.196, -1818.2, 11.7374, 1}, {824.38, -1699.62, 12.2481, 1}, {1023.7, -1526.53, 12.7448, 1}, {1238.46, -1640.37, 12.3171, 1}, 
	{1266.89, -1724.46, 12.7872, 1}, {1477.63, -1934.67, 22.4749, 1}, {2518.3, -1978.54, 12.1689, 1}, {2539.67, -1590.54, 20.7093, 1}, {-2263.01, -2835.84, -0.42964, 1}, 
	{-2228.89, -2567.32, 30.599, 1}, {-2188.22, -2419.4, 29.3557, 1}, {-1849.25, -2419.64, 42.7941, 1}, {-1651.32, -2436.89, 97.209, 1}, {-1641.1, -2305.57, 59.3222, 1}, 
	{-1551.62, -2403.37, 32.558, 0}, {-1463.39, -2643.12, 40.6103, 1}, {-1043.35, -2418.78, 60.4559, 1}, {-928.631, -2547.54, 113.71, 1}, {-412.773, -2167.82, 80.8633, 1}, 
	{-5.04887, -2490.46, 36.2891, 1}, {1010.8, -2083.37, 11.8847, 1}, {1102.14, -2236.12, 48.1534, 1}, {1201.77, -2303.01, 13.4563, 1}, {1224.62, -2131.43, 57.6836, 1}, 
	{1495.65, -2091.51, 27.655, 1}, {1586, -2016.62, 34.7464, 1}, {1600.91, -2716.88, 13.5391, 0}, {2191.97, -2701.53, 13.5469, 0}, {2569.68, -2187.01, 12.281, 1}, 
	{-1656.55, 2909.02, 51.0157, 1}, {274.551, 2930.09, -0.04081, 1}, {1196.45, 2858.76, 9.8235, 1}, {2235.27, 2812.27, 9.63092, 1}, {2057.14, 2148.84, 9.62282, 1}, 
	{2262.33, 2563.36, 9.56324, 1}, {2635.59, 2829.15, 22.8277, 1}, {-2500.56, 2274.85, 3.69014, 1}, {-2499.87, 2231.65, 3.68482, 1}, {-1183.99, 2197.18, 86.2022, 0}, 
	{-2667.37, 1598.76, 2.01039, 1}, {-2179.91, 1057.27, 86.8861, 1}, {1652.77, 1383.91, 9.52284, 1}, {1950.85, 1938.91, 11.0792, 0}, {1990.29, 1377.12, 7.99589, 1}, 
	{2150.42, 1599.02, 19.165, 1}, {-2886.91, 957.838, 43.0216, 1}, {-2778.02, 782.707, 58.1557, 1}, {-2513.93, 132.038, 21.0134, 1}, {-2183.52, 636.085, 48.1307, 1}, 
	{-1868.64, 100.819, 15.7728, 1}, {268.77, -306.638, 1.57812, 0}, {2016.49, 903.902, 9.56787, 1}, {2892.12, 814.24, 11.4223, 1}, {-1954.73, -750.819, 34.8931, 1}, 
	{1227.58, -869.813, 41.5483, 1}, {-1558.18, -2725.15, 47.5206, 1}, {-1191.93, -2575.94, 1.43932, 0}, {756.428, -1477.2, 11.4415, 1}, {866.261, -1751.56, 12.2734, 1}, 
	{2381.45, -1555.94, 22.7727, 1}, {2815.3, -1212.59, 23.9245, 1}, {2752.41, -1284.17, 55.3181, 1}, {-2545.18, 936.006, 63.7139, 1}, {2874.95, 2522.33, 9.78442, 1}, 
	{1236.43, -1937.9, 37.9958, 1}, {-44.4519, -2871.43, 28.2789, 1}, {-1774.08, 1310.43, 7.1875, 0}, {328.489, -1758.82, 3.18533, 1}, {693.551, -1634.7, 2.15345, 1}, 
	{2599.13, -1885.32, 4.8263, 0}, {-2554.2, 454.845, 14.6419, 0}, {2420.66, 1789.21, 9.63241, 1}, {2343.88, -2156.19, 12.2206, 1}, {-2846.84, -1157.79, 11.9614, 1}, 
	{-494.904, -1881.4, 6.33976, 1}, {-2011.55, -1077.52, 46.089, 1}, {-814.898, -1297.54, 78.7468, 1}, {2066.91, 2251.35, 8.58222, 1}, {2745.5, 2762.33, 9.48828, 1}, 
	{2504.13, 1006.41, 77.1407, 1}, {-2229.37, 138.467, 34.0155, 1}, {952.452, -1695.47, 12.2532, 1}, {2500.97, 2143.3, 9.68857, 1}, {1539.71, -985.462, 35.9553, 1}, 
	{2002.44, 1668, 11.0618, 1}, {1738.66, 2288.33, 9.60005, 1}, {1163.99, 699.453, 9.45416, 1}, {-1337.45, 2095.89, 40.2034, 1}, {2468.07, 675.906, 9.54242, 1}, 
	{1430.14, 2268.79, 10.0122, 1}, {1179.43, -346.887, 55.1543, 1}, {2831.67, 2245.74, 9.73089, 1}, {-2718.2, 76.0714, 3.09266, 1}, {497.676, -217.144, 14.2953, 1}, 
	{2579.77, 2082.27, 9.54141, 1}, {-525.639, -2702.27, 142.87, 1}, {2774.85, 317.622, 2.40274, 1}, {-339.396, -296.534, 10.317, 1}, {1083.74, -2028.46, 55.3729, 1}, 
	{872.256, -1545.17, 12.3196, 1}, {153.063, -1498.31, 11.0706, 1}, {2177.89, 1482.8, 9.566, 1}, {1925.3, 2782.01, 9.51348, 1}, {1786.79, 2077.36, 9.54741, 1}, 
	{1085.22, -1903.57, 20.5189, 1}, {652.963, -1891.11, 2.56912, 1}, {-2194.34, -2332.13, 29.3995, 1}, {245.312, -43.9376, 0.28448, 1}, {679.151, -1497.66, 13.6363, 1}, 
	{-1416.51, -2419.95, 31.8473, 1}, {-2757.89, 90.7707, 5.70753, 1}, {780.385, -1684.96, 2.86449, 1}, {-2070.73, 1030.85, 58.9517, 1}, {1407.77, 2164.23, 10.7817, 1}, 
	{-2184.88, 2754.51, 164.46, 1}, {-2312.84, -2014.39, 243.125, 1}, {-328.627, -2131.01, 29.3583, 1}, {-91.0179, -1419.08, 4.32593, 1}, {1708.23, 2841, 9.56706, 1}, 
	{-1316.61, -1341.72, 144.622, 1}, {1416.73, 2209.09, 22.8743, 1}, {-490.455, 2381.6, 82.4634, 1}, {-2207.17, 1138.03, 91.1997, 1}, {-1494.14, -1164.2, 122.846, 1}, 
	{-301.169, 1914.38, 48.4876, 1}, {2299.23, -375.989, 54.8201, 1}, {-2613.35, -988.187, 13.4587, 1}, {675.342, -1554.81, 14.1413, 1}, {-2294.97, 640.211, 40.6966, 1}, 
	{2011.03, 2224.25, 9.56758, 1}, {784.031, -1743.94, 12.2306, 1}, {2395.21, -2495.13, 13.6476, 1}, {-896.464, 1864.72, 115.261, 0}, {-2468.72, 1050.01, 54.1813, 1}, 
	{-1664.48, 979.585, 48.0926, 1}
};
local textklad =
{
	["Red-Rock?"] = "3",
	["В каком году Conor ушел с поста ГА на сервере Chandler"] = "2016",
	["В каком году Conor ушёл с поста ГА на сервере Chandler"] = "2016",
	["В каком году был добавлен депозит"] = "2017",
	["В каком году был открыт сервер Mesa"] = "2018",
	["В каком месяце Conor стал спец.администратором"] = "Январь",
	["В каком месяце был добавлен информационный центр"] = "Март",
	["В каком месяце ввели покраску куратора на форуме проекта"] = "Декабрь",
	["В честь кого установлен памятник недалеко от моста ЛС-СФ"] = "Ричи",
	["Вечно ждущий NPC на вокзале ЛС"] = "Джереми",
	["Висит на спине, но не гитара, быстрый и юркий, но не велосипед"] = "Скейт",
	["Горячие вакансии"] = "Николай",
	["Дата выхода обновления позволившего зарабатывать реальные деньги в игре аризона рп"] = "16,07,19",
	["Дата выхода обновления, позволившего зарабатывать реальные деньги в игре"] = "16.07.19",
	["Дата добавления корабля для мафий в формате xx.xx.xx"] = "19.06.16",
	["Дата регистрации спец.администратора Sam_Mason на форуме в формате xx.xx.xx"] = "27.04.15",
	["Из какой страны привозят контейнеры для аукциона"] = "Германия",
	["Каждый проходит через это при начале игры"] = "Регистрация",
	["Как звали третьего по счету ГА на сервере Scottdale"] = "Владислав",
	["Как зовут квестового NPC в деревне Montgomery"] = "Майкл",
	["Как зовут квестового NPC в деревне Монтгомери"] = "Майкл",
	["Как зовут начальника Магнуса"] = "Эрих",
	["Какая наименьшая гос.цена у любого бизнеса на сервере"] = "6.000.000",
	["Какая работа в центре занятости открывается на 6 уровне"] = "Инкассатор",
	["Какая работа доступна в ЦЗ на 1 лвл-е"] = "Таксист",
	["Какая работа доступна в Центре Занятости на 1 лвл-е"] = "Таксист",
	["Какая фамилия у разработчика Альберта"] = "Миронов",
	["Какая цена была у Titan VIP в AZ монетах изначально"] = "2000",
	["Каков возраст самого молодого ГА"] = "14",
	["Какое название самого дорогого контейнера"] = "Bussiness",
	["Какое название у лучшего типа контейнера на английском"] = "Business",
	["Какое название у лучшего типа контейнеров на английском"] = "Business",
	["Какой NPC ждёт на вокзале ЛС"] = "Джереми",
	["Какой аксессуар может сидеть на плече"] = "Попугай",
	["Какой налог нужен для слета дома"] = "104000",
	["Какой ник в игре у Валика"] = "Farmer",
	["Какой ник у Валика"] = "Farmer",
	["Какой урон наносит удар с кулака при 0"] = "1.32",
	["Какой урон наносит удар с кулака при 0% силы по игроку с 0%% мускулатуры"] = "1.32",
	["Какой урон наносит удар с кулака при 100 силы по игроку с 0 мускулатуры"] = "11.32",
	["Какой урон наносит удар с кулака при 100%% силы по игроку с 0%% мускулатуры"] = "11.32",
	["Количество ГА, которое когда-либо были на сервере Yuma"] = "1",
	["Количество ГА, которые когда-либо были на сервере Mesa"] = "2",
	["Количество ГА, которые когда-либо были на сервере Red-Rock"] = "3",
	["Количество ГА, которые когда-либо были на сервере Yuma"] = "1",
	["Количество домов на сервере за AZ монеты"] = "15",
	["Количество лавок на Центральном Рынке"] = "30",
	["Количество работ в центре занятости"] = "19",
	["Количество серверов с самым длинным названием"] = "3",
	["Количество фракций на сервере"] = "27",
	["Красная, как яблоко, наклейка с белой надписью"] = "Supreme",
	["Кто закопал эти клады"] = "Дмитрий",
	["Кто однорукий всегда стоит в казино"] = "Бандит",
	["Кто однорукий постоянно стоит в казино"] = "Бандит",
	["Кто пишет эту систему глубочайщей ночью"] = "Альберт",
	["Кто работает ночами над модом"] = "Альберт",
	["Лысый, смешной, большой и злой"] = "Conor",
	["Любит репорт отвечать, игрокам всем помогать"] = "Хелпер",
	["Максимальная ставка в одноруком бандите"] = "5000",
	["Максимальная цена на оружие в АММО для владельцев бизнеса"] = "50000",
	["Максимальное количество EXP которое может выпасть с контейнера"] = "80",
	["Максимальное количество EXP, которое может выпасть с контейнера"] = "80",
	["Максимальное количество бронзовых рулеток в 1 слоте инвентаря"] = "100",
	["Максимальное количество дерева в 1 слоте инвентаря"] = "10000",
	["Максимальное количество слотов для машин у 1 игрока"] = "5",
	["Максимальный онлайн на проекте Arizona за все время"] = "100000",
	["Максимальный срок"] = "180000",
	["Месяц ввода покраски на форуме"] = "Декабрь",
	["Минимальная сумма пожертвования в благотворительность"] = "10000",
	["Накануне праздник, вышла обнова - это любимая наша"] = "Аризона",
	["Напишите Nick_Name главного администратора 3-го сервера"] = "Xavier_Cooper",
	["Напишите Nick_Name главного администратора 6-го сервера"] = "Diana_Mironova",
	["Напишите Nick_Name главного администратора 9-го сервера"] = "Leonardo_Toren",
	["Ник администратора который занимал пост ГА на двух разных серверах"] = "Conor",
	["Ник администратора, который занимал пост ГА на двух разных серверах"] = "Conor",
	["Ник главного администратора сервера Tucson, который был назначен после ухода Dmitriy_Prise"] = "Steff_Kingston",
	["С какого сервера пошло понятие 13"] = "Scottdale",
	["С кем связано словосочетание"] = "Николай",
	["Самая популярна игра в казино"] = "Кости",
	["Самая популярная игра в казино"] = "Кости",
	["Самый крупный ютубер на 1 октября 2019 года"] = "Delorenzy",
	["Сервер Аризоны"] = "Scottdale",
	["Сервер Аризоны, который чаще всего занимает 1 место по онлайну"] = "Scottdale",
	["Сколько АЗ стоит в донате 8000 семейной репутации"] = "2400",
	["Сколько было серверов 1 октября 2017 года"] = "6",
	["Сколько всего стилей форума"] = "3",
	["Сколько всего фракций на аризоне"] = "27",
	["Сколько лавок на центральном рынке"] = "30",
	["Сколько лет самому молодому ГА"] = "14",
	["Сколько минут нужно отыграть для получения PayDay"] = "20",
	["Сколько нужно EXP для получения 12 уровня, если сейчас у тебя 1 lvl 0 exp"] = "308",
	["Сколько нужно EXP для получения 25 уровня, если сейчас у тебя 22 lvl 20 exp"] = "268",
	["Сколько нужно EXP для получения 39 уровня, если сейчас у тебя 1 lvl 4 exp"] = "3112",
	["Сколько нужно EXP для получения 40 уровня, если сейчас у тебя 3 lvl 2 exp"] = "3254",
	["Сколько нужно перевезти пицц, чтобы выполнить начальный квест"] = "15",
	["Сколько работ есть в Центре Занятости"] = "14-16",
	["Сколько серверов было 1 октября 2017 года"] = "6",
	["Сколько стоило 1 евро в день выпуска"] = "3000",
	["Сколько существует стилей форума"] = "3",
	["Сколько талонов в день можно получать с семейных квестов"] = "11",
	["Сколько энергии пополняется каждый PayDay при 75"] = "17.5",
	["Собирает яйца птица, ни павлин и ни синица"] = "Попугай",
	["Стандартное количество ХП у автомобиля"] = "1500",
	["Старый, мудрый, 05го дежурный"] = "Николай",
	["Увеличивает скорость, но не чит, добавляет наклейку, но не Supreme"] = "TwinTurbo",
	["Фамилия администратора с ником Kory_McGregor"] = "Мясников",
	["Число спец.администраторов, которое было за всё время на проекте"] = "3",
	["Что может объединить 1000 игроков на сервере"] = "Семья",
	["Что нужно сделать или получить для выполнения первого начального квеста"] = "Паспорт",
	["Что объединяет"] = "Семья",
	["Это бывает 7 раз в неделю, 24 раза в сутки. Что это"] = "Payday",
	["администратора 3-го сервера"] = "Xavier_Cooper",
	["администратора 6-го сервера"] = "Diana_Mironova", 
	["администратора 9-го сервера"] = "Leonardo_Toren",
	["аксимальный срок деморгана в секундах"] = "180000",
	["были на сервере Mesa"] = "3",
	["были на сервере Yuma"] = "1",
	["главного администратора 6-го сервера"] = "Diana_Mironova",
	["которое было за все время на проекте"] = "3",
	["которые когда-либо были на сервере Mesa"] = "2",
	["которые когда-либо были на сервере Red-Rock"] = "3",
	["которые когда-либо были на сервере Yuma"] = "1",
	["на сервере Mesa"] = "2",
	["недалеко от моста"] = "Ричи",
	["первого уровня"] = "Таксист",
	["установлен памятник"] = "Ричи",
	["цена у любого бизнеса на сервере"] = "6000000",
	["энергии пополняется каждый"] = "1.32",
	["энергии пополняется каждый"] = "17.5",
	["это любимая наша"] = "Аризона",
};
local model_name =
{
	[321] = "Дилдо на спину #1",
	[323] = "Дилдо на спину #3",
	[326] = "Трость на спину",
	[333] = "Клюшка на спину",
	[338] = "Кий на спину",
	[341] = "Бензопила на спину",
	[361] = "Огнемёт на спину",
	[362] = "Миниган на спину",
	[363] = "Портфель террориста",
	[371] = "Рюкзак (парашют)",
	[881] = "Ёлка",
	[1114] = "Очки сварщика",
	[1186] = "Рюкзак трансформер",
	[1254] = "Череп на грудь",
	[1274] = "Доллар на грудь",
	[1275] = "Рубашечка на грудь",
	[1276] = "Сувенир на спину",
	[1487] = "Бутылка на спину",
	[1609] = "Черепаха на спину",
	[2045] = "Бита с шипами",
	[2061] = "Патрон на грудь",
	[2102] = "Колонка на спину",
	[2226] = "Бумбокс",
	[2404] = "Доска для серфинга",
	[2429] = "Реактивный ранец",
	[2469] = "Самолётик на спину",
	[2590] = "Коса на спину",
	[2690] = "Огнетушитель на спину",
	[2711] = "С модификации Киборг",
	[2712] = "Метла на спину",
	[2782] = "Устрица на спину & Раптор",
	[2908] = "Голова зомби",
	[2918] = "Рюкзак с шипами",
	[2983] = "Штурвал за спиной",
	[3026] = "Рюкзак",
	[3056] = "Магнит на спину",
	[3070] = "Скайборд",
	[3031] = "Ранец вертолёт",
	[3273] = "Ранец охотники на приведений",
	[3385] = "Рюкзак будущего",
	[8483] = "Маска череп",
	[11704] = "Маска демона",
	[11747] = "Палка с модификации",
	[14608] = "Копье бога",
	[16368] = "Красная шляпа",
	[18632] = "Рыболовная удочка на спину",
	[18633] = "Балонный ключ на спину",
	[18634] = "Лом на спину",
	[18635] = "Молоток на спину",
	[18636] = "Кепка Police",
	[18638] = "Каска строителя",
	[18645] = "Мотошлем",
	[18782] = "Печенька на голову",
	[18890] = "Грабли на спину",
	[18906] = "Бандана на голову",
	[18911] = "Бандана",
	[18921] = "Берет",
	[18926] = "Кепка передняя",
	[18947] = "Шляпка",
	[18952] = "Шлем для бокса",
	[18953] = "Тёплая Шапка",
	[18955] = "Кепка обратная",
	[18963] = "Голова CJ",
	[18964] = "Бандитская шапка",
	[18967] = "Панамка",
	[18970] = "Шляпа",
	[19006] = "Очки",
	[19036] = "Хоккейная маска",
	[19039] = "Часы",
	[19054] = "Подарок на спину",
	[19064] = "Новогодняя шапка",
	[19067] = "Шапки",
	[19077] = "Борода #2",
	[19085] = "Повязка на глаз",
	[19086] = "Улучшенное дилдо",
	[19093] = "Кепка DUDE",
	[19094] = "Бургер на голову",
	[19095] = "Ковбойская шляпа",
	[19101] = "Каска",
	[19136] = "Шляпа с дредами",
	[19137] = "Голова петуха",
	[19141] = "Каска спецназа",
	[19142] = "Бронежилет",
	[19274] = "Парик (1)",
	[19314] = "Рога",
	[19317] = "Гитара",
	[19346] = "Рюкзак хот-дог",
	[19347] = "Звезда на грудь",
	[19349] = "Монокль",
	[19350] = "Усы (короткие)",
	[19351] = "Усы (длинные)",
	[19352] = "Чёрный конус",
	[19421] = "Наушники",
	[19469] = "Повязка на шею",
	[19472] = "Респиратор",
	[19517] = "Борода #1",
	[19519] = "Парик (3)",
	[19520] = "Фуражка офицера",
	[19528] = "Шляпа волшебника",
	[19553] = "Фермерская шляпа",
	[19554] = "Шапка баллас",
	[19557] = "Маска Зорро",
	[19558] = "Кепка (развозчика пиццы)",
	[19559] = "Походный рюкзак",
	[19581] = "Сковородка на спину",
	[19590] = "Меч на спину",
	[19591] = "Китайский веер",
	[19621] = "Канистра на правое бедро",
	[19623] = "Фотоаппарат на грудь",
	[19624] = "Большой чемодан",
	[19627] = "Гаечный ключ на грудь",
	[19630] = "Рыба на спину",
	[19631] = "Кирка на спину",
	[19636] = "Ларек с фруктами",
	[19804] = "Замочек на грудь",
	[19847] = "Копченая нога",
	[19878] = "Скейт на спину",
	[19904] = "Жилет грузчика"
};
local tCarsName = 
{
	"Landstalker","Bravura","Buffalo","Linerunner","Pereniel","Sentinel","Dumper","Firetruck","Trashmaster","Stretch","Manana","Infernus",
	"Voodoo","Pony","Mule","Cheetah","Ambulance","Leviathan","Moonbeam","Esperanto","Taxi","Washington","Bobcat","Mr.Whoopee","BF Injection",
	"Hunter","Premier","Enforcer","Securicar","Banshee","Predator","Bus","Rhino","Barracks","Hotknife","Trailer","Previon","Coach","Cabbie",
	"Stallion","Rumpo","RC Bandit","Romero","Packer","Monster","Admiral","Squalo","Seasparrow","Pizzaboy","Tram","Trailer","Turismo","Speeder",
	"Reefer","Tropic","Flatbed","Yankee","Caddy","Solair","Berkley's RC Van","Skimmer","PCJ-600","Faggio","Freeway","RC Baron","RC Raider",
	"Glendale","Oceanic","Sanchez","Sparrow","Patriot","Quad","Coastguard","Dinghy","Hermes","Sabre","Rustler","ZR-350","Walton","Regina",
	"Comet","BMX","Burrito","Camper","Marquis","Baggage","Dozer","Maverick","News Chopper","Rancher","FBI Rancher","Virgo","Greenwood",
	"Jetmax","Hotring Racer","Sandking","Blista Compact","Police Maverick","Boxville","Benson","Mesa","RC Goblin","Hotring Racer A","Hotring Racer B",
	"Bloodring Banger","Rancher","Super GT","Elegant","Journey","Bike","Mountain Bike","Beagle","Cropdust","Stunt","Tanker","RoadTrain",
	"Nebula","Majestic","Buccaneer","Shamal","Hydra","FCR-900","NRG-500","HPV1000","Cement Truck","Tow Truck","Fortune","Cadrona","FBI Truck",
	"Willard","Forklift","Tractor","Combine","Feltzer","Remington","Slamvan","Blade","Freight","Streak","Vortex","Vincent","Bullet","Clover",
	"Sadler","Firetruck","Hustler","Intruder","Primo","Cargobob","Tampa","Sunrise","Merit","Utility","Nevada","Yosemite","Windsor","Monster A",
	"Monster B","Uranus","Jester","Sultan","Stratum","Elegy","Raindance","RC Tiger","Flash","Tahoma","Savanna","Bandito","Freight","Trailer",
	"Kart","Mower","Dune","Sweeper","Broadway","Tornado","AT-400","DFT-30","Huntley","Stafford","BF-400","Newsvan","Tug","Trailer A","Emperor",
	"Wayfarer","Euros","Hotdog","Club","Trailer B","Trailer C","Andromada","Dodo","RC Cam","Launch","Police Car (LSPD)","Police Car (SFPD)",
	"Police Car (LVPD)","Police Ranger","Picador","S.W.A.T.","Alpha","Phoenix","Glendale","Sadler","L Trailer A","L Trailer B",
	"Stair Trailer","Boxville","Farm Plow","U Trailer"
}
local cmds =
{
	'/ad',
	'/adrenaline',
	'/advokats',
	'/al',
	'/alarm',
	'/anims',
	'/armour',
	'/ask',
	'/azsmonitor',
	'/b',
	'/bag',
	'/balon',
	'/bankmenu',
	'/beer',
	'/beg',
	'/bizinfo',
	'/bizlock',
	'/bizopen',
	'/bizwar',
	'/bk',
	'/blacklist',
	'/bomb',
	'/boom',
	'/bot',
	'/break',
	'/breakcar',
	'/buybiz',
	'/c',
	'/captstats',
	'/capture',
	'/carm',
	'/carpass',
	'/cars',
	'/carskill',
	'/checkjobprogress',
	'/checklayout',
	'/cheeps',
	'/chistory',
	'/cl',
	'/contractfill',
	'/cook',
	'/createbomb',
	'/creategun',
	'/credit',
	'/cs',
	'/ct',
	'/cuff',
	'/d',
	'/deltun',
	'/demoute',
	'/do',
	'/donate',
	'/drink',
	'/dropgun',
	'/dropmats',
	'/drug',
	'/drugs',
	'/duel',
	'/eat',
	'/editobject',
	'/eject',
	'/ekonom',
	'/endlive',
	'/engine',
	'/expel',
	'/f',
	'/fam',
	'/famdisband',
	'/faminvite',
	'/fammenu',
	'/fammute',
	'/famoffkick',
	'/famuninvite',
	'/famunmute',
	'/fb',
	'/fbm',
	'/ffarm',
	'/fightstyle',
	'/fill',
	'/fillcar',
	'/filscar',
	'/find',
	'/findcar',
	'/findcollectors',
	'/findibiz',
	'/findihouse',
	'/findtrailer',
	'/fires',
	'/firewood',
	'/fireworks',
	'/fixmycar',
	'/flowers',
	'/fm',
	'/fmembers',
	'/fmute',
	'/fontsize',
	'/free',
	'/frisk',
	'/funmute',
	'/fwarn',
	'/gag',
	'/gclear',
	'/getjail',
	'/getmoney',
	'/givebiz',
	'/givekey',
	'/givelicense',
	'/giverank',
	'/giveskin',
	'/giveweapon',
	'/go_fished',
	'/gomechanic',
	'/gotaxi',
	'/gotome',
	'/gov',
	'/govess',
	'/gps',
	'/gun',
	'/headmove',
	'/heal',
	'/healbad',
	'/help',
	'/hi',
	'/home',
	'/hotel',
	'/house',
	'/id',
	'/incar',
	'/invent',
	'/invite',
	'/j',
	'/jfish',
	'/jlock',
	'/jmeat',
	'/jobhelp',
	'/jobinvite',
	'/jobmembers',
	'/jobprogress',
	'/key',
	'/killme',
	'/kiss',
	'/lavka',
	'/lead',
	'/leaders',
	'/licensers',
	'/lights',
	'/limit',
	'/live',
	'/lock',
	'/lzal',
	'/m',
	'/mask',
	'/mbiz',
	'/me',
	'/medcard',
	'/members',
	'/minvite',
	'/mm',
	'/mn',
	'/n',
	'/news',
	'/newsredak',
	'/number',
	'/oillist',
	'/olock',
	'/opengate',
	'/or_cancel',
	'/orderlist',
	'/pagesize',
	'/park',
	'/passwd',
	'/pay',
	'/phone',
	'/platoon',
	'/pobject',
	'/premium',
	'/pt',
	'/pull',
	'/punish',
	'/pursuit',
	'/putmoney',
	'/putobject',
	'/q',
	'/quest',
	'/quit',
	'/quitjob',
	'/r',
	'/radio',
	'/rb',
	'/rbm',
	'/rcveh',
	'/recept',
	'/referals',
	'/removebomb',
	'/rep',
	'/repare',
	'/repcar',
	'/report',
	'/rjail',
	'/rm',
	'/roadmap',
	'/roadpartner',
	'/s',
	'/satiety',
	'/scutes',
	'/seat',
	'/sellcar',
	'/sellcard',
	'/sellcarto',
	'/selldrugs',
	'/sellgangzone',
	'/sellgun',
	'/setdbuy',
	'/setdsell',
	'/setfrank',
	'/setspawn',
	'/settag',
	'/settings',
	'/showbadge',
	'/showbizinfo',
	'/showcarskill',
	'/showlic',
	'/showmc',
	'/showpass',
	'/showpunish',
	'/showskill',
	'/showtatu',
	'/skate',
	'/skill',
	'/smoke',
	'/sms',
	'/smug',
	'/sobes',
	'/sprunk',
	'/stats',
	'/stopjob',
	'/strafs',
	'/stuff',
	'/style',
	'/su',
	'/surf',
	'/t',
	'/take',
	'/ticket',
	'/tie',
	'/time',
	'/todo',
	'/tow',
	'/trade',
	'/tradecar',
	'/trmenu',
	'/unbag',
	'/unblacklist',
	'/uncuff',
	'/unfwarn',
	'/ungag',
	'/ungotome',
	'/uninvite',
	'/unlead',
	'/unmask',
	'/unpunish',
	'/unrentcar',
	'/unstuff',
	'/untie',
	'/usebad',
	'/usedrugs',
	'/usemed',
	'/vipplayers',
	'/vr',
	'/wanted',
	'/wedding',
	'/z',
	'/zeks',}
----------------------------------------
local selected = 0
----------------------------------------
local friends =
{
	"Sawa_Seleznev",
	"Denis_Seleznev",
	"Avksentiu_Adaw",
	"Vartan_Germun",
	"Mawka_Dvornyawka",
	-- "Nikita_Bernoy",
	-- "Kostya_Seleznev",
	-- "Diana_Mironova",
	-- "Kevin_Sweezy",
	-- "Sam_Mason",
	-- "Conor",
};
----------------------------------------
local pidori =
{
	"Yuma_Tanaka",
	"Miguel_Guevara",
	"Fernando_Klyn",
	"Vartan_Germun",
	"Fabio_Vistero",
	"Denis_Watcon",
	"Yuta_Takeda",
	"Hun_Aoto",
	"Taiga_Aoto",
	"Toby_Weilong",
	"Underground_Monster",
	"Tiz_Cartier",
	"Dexter_Shakespeare",
	"Scarlet_Johansson",
	"Killa_Karsxrovs",
	"August_Walker",
	"San_Sweezy",
	"Ray_Lasco",
};
----------------------------------------
local _message = {}

function push_message(text, del)
	del = del or 5
	_message[#_message+1] =
	{
		active = false,
		time = 0,
		showtime = del,
		text = text
	}
end
----------------------------------------
local imgui = require('imgui')
require("encoding").default = "CP1251"
u8 = require("encoding").UTF8
local inicfg = require("inicfg")
local sampev = require("samp.events")
local key = require 'vkeys'
require "lib.moonloader"
local memory = require'memory'
local dlstatus = require("moonloader").download_status
local bit = require('numberlua')
----------------------------------------
update_status = false

local update_url = "https://raw.githubusercontent.com/metk1u/scripts/main/update.ini"
local update_path = getWorkingDirectory() .. "/update.ini"

local script_url = "https://raw.githubusercontent.com/metk1u/scripts/main/Arizona%20Helper.lua"
local script_path = thisScript().path
----------------------------------------
arial = renderCreateFont('Arial', 12, 5)
arial_8_5 = renderCreateFont('Arial', 8, 5)
molot_8_5 = renderCreateFont("Molot", 8, 5)
molot_10_9 = renderCreateFont('Molot', 10, 9)
--------------------[Auto /vr]--------------------
local delay_autovr = 0.5
--------------------[Продовоз]--------------------
local prodovoz_timer = 0
local prods = 2000
--------------------[/poisk]--------------------
local checkpoint_poisk = {}
--------------------[CMD хелпер]--------------------
local windows_cmd = imgui.ImBool(false)
--------------------[Дальний чат]--------------------
local chatbuble = {}
--------------------[Стиллер объектов на транспорт]--------------------
local objectsTable = {}
local lastPlayerState = -1
--------------------[Автоввод текста в лавку]--------------------
dialogs_lavka = -1
--------------------[Анализ цен на ЦР]--------------------
local analysis = nil
local last_text = nil
local data_cr = {}
local template = 
{
	last_update = nil,
	sell = {},
	buy = {}
}
----------------------------------------
local path_cr = getWorkingDirectory() .. '\\config\\cr_items.json'
if not doesFileExist(path_cr) then
	data_cr = template
	createDirectory(getWorkingDirectory() .. '\\config\\')
	local file_open_cr = io.open(path_cr, "w")
	file_open_cr:write(encodeJson(data_cr))
	file_open_cr:close()
else
	local file_open_cr = io.open(path_cr, "r")
	data_cr = decodeJson(file_open_cr:read('*a'))
	file_open_cr:close()
end
--------------------[Новый автолут]--------------------
local autoloot_td = {''}
--------------------[Остальное]--------------------
local chatMessages = {}
local reconnect_timer = 0
local message_report = ""
local local_name = ""
local carid = -1
local windowstate = imgui.ImBool(false)
local bug = {}
----------------------------------------
local file = 'settings.ini'
local path = getWorkingDirectory() .. '\\config'
----------------------------------------
local mainIni = inicfg.load(
{
	config =
	{
		renderTime = true,
		killStat = true,
		HealthArmour = true,
		del_opisanie_3d = true,
		del_family_3d = false,
		autousedrugs = false,
		prodovoz_edit = 2000,
	},
	account =
	{
		my_nick = 'Nickname',
		my_password = 'Password',
		my_pincode = '0000',
		my_nick_2 = 'Nickname_2',
		my_password_2 = 'Password_2',
		my_pincode_2 = '0000',
		my_nick_3 = 'Nickname_3',
		my_password_3 = 'Password_3',
		my_pincode_3 = '0000'
	},
	color_back =
	{
		r = 0.0,
		g = 0.0,
		b = 0.0,
		a = 0.75,
	},
	color_scroll =
	{
		r = 0.99215686321259,
		g = 0.85882353782654,
		b = 0.42745098471642,
		a = 1.0,
	},
	color_main =
	{
		r = 0.99215686321259,
		g = 0.85882353782654,
		b = 0.42745098471642,
		a = 1.0,
	},
	color_text =
	{
		r = 1.0,
		g = 1.0,
		b = 1.0,
		a = 1.0,
	},
	chat =
	{
		chatlog = true,
		----------------------------------------
		renderchatbuy = true,
		removechatbuy = false,
		tosampfuncsbuy = true,
		----------------------------------------
		removechatspam = true,
		tosampfuncsspam = true,
		----------------------------------------
		sendconnect = true,
		senddisconnect = true,
		tosampfuncsconnect = true,
		tosampfuncsdisconnect = true,
		----------------------------------------
		rendervipchat = true,
		tosampfuncsvipchat = false,
		removevipchat = true,
		----------------------------------------
		renderjobchat = false,
		tosampfuncsjobchat = false,
		removejobchat = true,
		----------------------------------------
		renderadv = true,
		tosampfuncsadv = false,
		removeadv = true,
		----------------------------------------
		distant_active = false,
		distant_count = 10
	},
	chest =
	{
		roll_standart = true,
		roll_platinum = true,
		roll_maska = true,
		roll_state = true,
		roll_wait = 10,
	},
	destroy =
	{
		bucket = true,
		tree = true,
		floor = true,
		chest = true,
		game = true,
		serdce = true,
		newyear = true,
		pasxa = true,
		xlam = true
	},
	lavka =
	{
		drugs = 0,
		drugs_price = 100,
		----------------------------------------
		materials = 0,
		materials_price = 10,
		----------------------------------------
		fam_talon = 0,
		fam_talon_price = 5000,
		----------------------------------------
		cherepa = 0,
		cherepa_price = 1000,
		----------------------------------------
		sale_talon = 0,
		sale_talon_price = 300000,
		----------------------------------------
		gift = 0,
		gift_price = 4000,
		----------------------------------------
		cooper_roll = 0,
		cooper_roll_price = 6000,
		----------------------------------------
		silver_roll = 0,
		silver_roll_price = 20000,
		----------------------------------------
		gold_roll = 0,
		gold_roll_price = 150000,
		----------------------------------------
		xlopok = 0,
		xlopok_price = 100,
		----------------------------------------
		lens = 0,
		lens_price = 100,
		----------------------------------------
		stone = 0,
		stone_price = 200,
		----------------------------------------
		metal = 0,
		metal_price = 1000,
		----------------------------------------
		bronze = 0,
		bronze_price = 1500,
		----------------------------------------
		silver = 0,
		silver_price = 2000,
		----------------------------------------
		gold = 0,
		gold_price = 5000,
		----------------------------------------
		alyminiu = 0,
		alyminiu_price = 4000,
		----------------------------------------
		tywka = 0,
		tywka_price = 500,
		----------------------------------------
		euro = 0,
		euro_price = 4000,
		----------------------------------------
		gr_talon = 0,
		gr_talon_price = 1000,
		----------------------------------------
		antibiotiki = 0,
		antibiotiki_price = 2000,
		----------------------------------------
		prison = 0,
		prison_price = 35000,
		----------------------------------------
		zlov_moneta = 0,
		zlov_moneta_price = 200000,
		----------------------------------------
		toch_stone = 0,
		toch_stone_price = 20000,
		----------------------------------------
		bilet_6 = 0,
		bilet_6_price = 1000,
		----------------------------------------
		sticker_cluck = 0,
		sticker_cluck_price = 5000,
		----------------------------------------
		sticker_binko = 0,
		sticker_binko_price = 5000,
		----------------------------------------
		sticker_jizzy = 0,
		sticker_jizzy_price = 5000,
		----------------------------------------
		platinum_roll = 0,
		platinum_roll_price = 300000,
		----------------------------------------
		rare_yellow = 0,
		rare_yellow_price = 150000,
		----------------------------------------
		rare_red = 0,
		rare_red_price = 100000,
		----------------------------------------
		rare_blue = 0,
		rare_blue_price = 150000,
		----------------------------------------
		box_marvel = 0,
		box_marvel_price = 50000,
		----------------------------------------
		box_djent = 0,
		box_djent_price = 50000,
		----------------------------------------
		box_minecraft = 0,
		box_minecraft_price = 50000,
		----------------------------------------
		box_moto = 0,
		box_moto_price = 50000,
		----------------------------------------
		box_car = 0,
		box_car_price = 50000,
		----------------------------------------
		box_nostalg = 0,
		box_nostalg_price = 50000,
		----------------------------------------
		band_respect = 0,
		band_respect_price = 500,
		----------------------------------------
		larec_premium = 0,
		larec_premium_price = 50000
	},
	weather_time =
	{
		----------------------------------------
		set_weather = 10,
		set_time = 12
		----------------------------------------
	},
	autopiar =
	{
		----------------------------------------
		vr_text = '',
		vr_delay = 3,
		vr_active = false,
		----------------------------------------
		fam_text = '',
		fam_delay = 3,
		fam_active = false,
		----------------------------------------
		al_text = '',
		al_delay = 3,
		al_active = false
		----------------------------------------
	}
},file)

if not doesDirectoryExist(path) then
	inicfg.save(mainIni,file)
end

local elements =
{
	config =
	{
		renderTime = imgui.ImBool(mainIni.config.renderTime),
		killStat = imgui.ImBool(mainIni.config.killStat),
		HealthArmour = imgui.ImBool(mainIni.config.HealthArmour),
		del_opisanie_3d = imgui.ImBool(mainIni.config.del_opisanie_3d),
		del_family_3d = imgui.ImBool(mainIni.config.del_family_3d),
		autousedrugs = imgui.ImBool(mainIni.config.autousedrugs),
		prodovoz_edit = imgui.ImInt(mainIni.config.prodovoz_edit),
		attach_id = imgui.ImInt(1001),
		del_stream = imgui.ImBool(false),
		del_shout = imgui.ImBool(false),
		del_stream_pl = imgui.ImBool(false),
		anim_car = imgui.ImBool(false)
	},
	account =
	{
		my_nick = imgui.ImBuffer(tostring(mainIni.account.my_nick), 24),
		my_password = imgui.ImBuffer(tostring(mainIni.account.my_password), 100),
		my_pincode = imgui.ImBuffer(tostring(mainIni.account.my_pincode), 24),
		my_nick_2 = imgui.ImBuffer(tostring(mainIni.account.my_nick_2), 24),
		my_password_2 = imgui.ImBuffer(tostring(mainIni.account.my_password_2), 100),
		my_pincode_2 = imgui.ImBuffer(tostring(mainIni.account.my_pincode_2), 24),
		my_nick_3 = imgui.ImBuffer(tostring(mainIni.account.my_nick_3), 24),
		my_password_3 = imgui.ImBuffer(tostring(mainIni.account.my_password_3), 100),
		my_pincode_3 = imgui.ImBuffer(tostring(mainIni.account.my_pincode_3), 24)
	},
	color_back = imgui.ImFloat4(mainIni.color_back.r, mainIni.color_back.g, mainIni.color_back.b, mainIni.color_back.a),
	color_scroll = imgui.ImFloat4(mainIni.color_scroll.r, mainIni.color_scroll.g, mainIni.color_scroll.b, mainIni.color_scroll.a),
	color_main = imgui.ImFloat4(mainIni.color_main.r, mainIni.color_main.g, mainIni.color_main.b, mainIni.color_main.a),
	color_text = imgui.ImFloat4(mainIni.color_text.r, mainIni.color_text.g, mainIni.color_text.b, mainIni.color_text.a),
	chat =
	{
		chatlog = imgui.ImBool(mainIni.chat.chatlog),
		----------------------------------------
		renderchatbuy = imgui.ImBool(mainIni.chat.renderchatbuy),
		removechatbuy = imgui.ImBool(mainIni.chat.removechatbuy),
		tosampfuncsbuy = imgui.ImBool(mainIni.chat.tosampfuncsbuy),
		----------------------------------------
		removechatspam = imgui.ImBool(mainIni.chat.removechatspam),
		tosampfuncsspam = imgui.ImBool(mainIni.chat.tosampfuncsspam),
		----------------------------------------
		sendconnect = imgui.ImBool(mainIni.chat.sendconnect),
		senddisconnect = imgui.ImBool(mainIni.chat.senddisconnect),
		tosampfuncsconnect = imgui.ImBool(mainIni.chat.tosampfuncsconnect),
		tosampfuncsdisconnect = imgui.ImBool(mainIni.chat.tosampfuncsdisconnect),
		----------------------------------------
		rendervipchat = imgui.ImBool(mainIni.chat.rendervipchat),
		tosampfuncsvipchat = imgui.ImBool(mainIni.chat.tosampfuncsvipchat),
		removevipchat = imgui.ImBool(mainIni.chat.removevipchat),
		----------------------------------------
		renderjobchat = imgui.ImBool(mainIni.chat.renderjobchat),
		tosampfuncsjobchat = imgui.ImBool(mainIni.chat.tosampfuncsjobchat),
		removejobchat = imgui.ImBool(mainIni.chat.removejobchat),
		----------------------------------------
		renderadv = imgui.ImBool(mainIni.chat.renderadv),
		tosampfuncsadv = imgui.ImBool(mainIni.chat.tosampfuncsadv),
		removeadv = imgui.ImBool(mainIni.chat.removeadv),
		----------------------------------------
		distant_active = imgui.ImBool(mainIni.chat.distant_active),
		distant_count = imgui.ImInt(mainIni.chat.distant_count)
	},
	chest =
	{
		roll_standart = imgui.ImBool(mainIni.chest.roll_standart),
		roll_platinum = imgui.ImBool(mainIni.chest.roll_platinum),
		roll_maska = imgui.ImBool(mainIni.chest.roll_maska),
		roll_state = imgui.ImBool(mainIni.chest.roll_state),
		roll_wait = imgui.ImInt(mainIni.chest.roll_wait),
	},
	destroy =
	{
		bucket = imgui.ImBool(mainIni.destroy.bucket),
		tree = imgui.ImBool(mainIni.destroy.tree),
		floor = imgui.ImBool(mainIni.destroy.floor),
		chest = imgui.ImBool(mainIni.destroy.chest),
		game = imgui.ImBool(mainIni.destroy.game),
		serdce = imgui.ImBool(mainIni.destroy.serdce),
		newyear = imgui.ImBool(mainIni.destroy.newyear),
		pasxa = imgui.ImBool(mainIni.destroy.pasxa),
		xlam = imgui.ImBool(mainIni.destroy.xlam)
	},
	lavka =
	{
		drugs = imgui.ImInt(mainIni.lavka.drugs),
		drugs_price = imgui.ImInt(mainIni.lavka.drugs_price),
		----------------------------------------
		materials = imgui.ImInt(mainIni.lavka.materials),
		materials_price = imgui.ImInt(mainIni.lavka.materials_price),
		----------------------------------------
		fam_talon = imgui.ImInt(mainIni.lavka.fam_talon),
		fam_talon_price = imgui.ImInt(mainIni.lavka.fam_talon_price),
		----------------------------------------
		cherepa = imgui.ImInt(mainIni.lavka.cherepa),
		cherepa_price = imgui.ImInt(mainIni.lavka.cherepa_price),
		----------------------------------------
		sale_talon = imgui.ImInt(mainIni.lavka.sale_talon),
		sale_talon_price = imgui.ImInt(mainIni.lavka.sale_talon_price),
		----------------------------------------
		gift = imgui.ImInt(mainIni.lavka.gift),
		gift_price = imgui.ImInt(mainIni.lavka.gift_price),
		----------------------------------------
		cooper_roll = imgui.ImInt(mainIni.lavka.cooper_roll),
		cooper_roll_price = imgui.ImInt(mainIni.lavka.cooper_roll_price),
		----------------------------------------
		silver_roll = imgui.ImInt(mainIni.lavka.silver_roll),
		silver_roll_price = imgui.ImInt(mainIni.lavka.silver_roll_price),
		----------------------------------------
		gold_roll = imgui.ImInt(mainIni.lavka.gold_roll),
		gold_roll_price = imgui.ImInt(mainIni.lavka.gold_roll_price),
		----------------------------------------
		xlopok = imgui.ImInt(mainIni.lavka.xlopok),
		xlopok_price = imgui.ImInt(mainIni.lavka.xlopok_price),
		----------------------------------------
		lens = imgui.ImInt(mainIni.lavka.lens),
		lens_price = imgui.ImInt(mainIni.lavka.lens_price),
		----------------------------------------
		stone = imgui.ImInt(mainIni.lavka.stone),
		stone_price = imgui.ImInt(mainIni.lavka.stone_price),
		----------------------------------------
		metal = imgui.ImInt(mainIni.lavka.metal),
		metal_price = imgui.ImInt(mainIni.lavka.metal_price),
		----------------------------------------
		bronze = imgui.ImInt(mainIni.lavka.bronze),
		bronze_price = imgui.ImInt(mainIni.lavka.bronze_price),
		----------------------------------------
		silver = imgui.ImInt(mainIni.lavka.silver),
		silver_price = imgui.ImInt(mainIni.lavka.silver_price),
		----------------------------------------
		gold = imgui.ImInt(mainIni.lavka.gold),
		gold_price = imgui.ImInt(mainIni.lavka.gold_price),
		----------------------------------------
		alyminiu = imgui.ImInt(mainIni.lavka.alyminiu),
		alyminiu_price = imgui.ImInt(mainIni.lavka.alyminiu_price),
		----------------------------------------
		tywka = imgui.ImInt(mainIni.lavka.tywka),
		tywka_price = imgui.ImInt(mainIni.lavka.tywka_price),
		----------------------------------------
		euro = imgui.ImInt(mainIni.lavka.euro),
		euro_price = imgui.ImInt(mainIni.lavka.euro_price),
		----------------------------------------
		gr_talon = imgui.ImInt(mainIni.lavka.gr_talon),
		gr_talon_price = imgui.ImInt(mainIni.lavka.gr_talon_price),
		----------------------------------------
		antibiotiki = imgui.ImInt(mainIni.lavka.antibiotiki),
		antibiotiki_price = imgui.ImInt(mainIni.lavka.antibiotiki_price),
		----------------------------------------
		prison = imgui.ImInt(mainIni.lavka.prison),
		prison_price = imgui.ImInt(mainIni.lavka.prison_price),
		----------------------------------------
		zlov_moneta = imgui.ImInt(mainIni.lavka.zlov_moneta),
		zlov_moneta_price = imgui.ImInt(mainIni.lavka.zlov_moneta_price),
		----------------------------------------
		toch_stone = imgui.ImInt(mainIni.lavka.toch_stone),
		toch_stone_price = imgui.ImInt(mainIni.lavka.toch_stone_price),
		----------------------------------------
		bilet_6 = imgui.ImInt(mainIni.lavka.bilet_6),
		bilet_6_price = imgui.ImInt(mainIni.lavka.bilet_6_price),
		----------------------------------------
		sticker_cluck = imgui.ImInt(mainIni.lavka.sticker_cluck),
		sticker_cluck_price = imgui.ImInt(mainIni.lavka.sticker_cluck_price),
		----------------------------------------
		sticker_binko = imgui.ImInt(mainIni.lavka.sticker_binko),
		sticker_binko_price = imgui.ImInt(mainIni.lavka.sticker_binko_price),
		----------------------------------------
		sticker_jizzy = imgui.ImInt(mainIni.lavka.sticker_jizzy),
		sticker_jizzy_price = imgui.ImInt(mainIni.lavka.sticker_jizzy_price),
		----------------------------------------
		platinum_roll = imgui.ImInt(mainIni.lavka.platinum_roll),
		platinum_roll_price = imgui.ImInt(mainIni.lavka.platinum_roll_price),
		----------------------------------------
		rare_yellow = imgui.ImInt(mainIni.lavka.rare_yellow),
		rare_yellow_price = imgui.ImInt(mainIni.lavka.rare_yellow_price),
		----------------------------------------
		rare_red = imgui.ImInt(mainIni.lavka.rare_red),
		rare_red_price = imgui.ImInt(mainIni.lavka.rare_red_price),
		----------------------------------------
		rare_blue = imgui.ImInt(mainIni.lavka.rare_blue),
		rare_blue_price = imgui.ImInt(mainIni.lavka.rare_blue_price),
		----------------------------------------
		box_marvel = imgui.ImInt(mainIni.lavka.box_marvel),
		box_marvel_price = imgui.ImInt(mainIni.lavka.box_marvel_price),
		----------------------------------------
		box_djent = imgui.ImInt(mainIni.lavka.box_djent),
		box_djent_price = imgui.ImInt(mainIni.lavka.box_djent_price),
		----------------------------------------
		box_minecraft = imgui.ImInt(mainIni.lavka.box_minecraft),
		box_minecraft_price = imgui.ImInt(mainIni.lavka.box_minecraft_price),
		----------------------------------------
		box_moto = imgui.ImInt(mainIni.lavka.box_moto),
		box_moto_price = imgui.ImInt(mainIni.lavka.box_moto_price),
		----------------------------------------
		box_car = imgui.ImInt(mainIni.lavka.box_car),
		box_car_price = imgui.ImInt(mainIni.lavka.box_car_price),
		----------------------------------------
		box_nostalg = imgui.ImInt(mainIni.lavka.box_nostalg),
		box_nostalg_price = imgui.ImInt(mainIni.lavka.box_nostalg_price),
		----------------------------------------
		band_respect = imgui.ImInt(mainIni.lavka.band_respect),
		band_respect_price = imgui.ImInt(mainIni.lavka.band_respect_price),
		----------------------------------------
		larec_premium = imgui.ImInt(mainIni.lavka.larec_premium),
		larec_premium_price = imgui.ImInt(mainIni.lavka.larec_premium_price)
	},
	weather_time =
	{
		----------------------------------------
		set_weather = imgui.ImInt(mainIni.weather_time.set_weather),
		set_time = imgui.ImInt(mainIni.weather_time.set_time)
		----------------------------------------
	},
	autopiar =
	{
		----------------------------------------
		vr_text = imgui.ImBuffer(tostring(mainIni.autopiar.vr_text), 144),
		vr_delay = imgui.ImInt(mainIni.autopiar.vr_delay),
		vr_active = imgui.ImBool(mainIni.autopiar.vr_active),
		----------------------------------------
		fam_text = imgui.ImBuffer(tostring(mainIni.autopiar.fam_text), 144),
		fam_delay = imgui.ImInt(mainIni.autopiar.fam_delay),
		fam_active = imgui.ImBool(mainIni.autopiar.fam_active),
		----------------------------------------
		al_text = imgui.ImBuffer(tostring(mainIni.autopiar.al_text), 144),
		al_delay = imgui.ImInt(mainIni.autopiar.al_delay),
		al_active = imgui.ImBool(mainIni.autopiar.al_active)
		----------------------------------------
	},
	autotoch =
	{
		autotoch_active = false,
		checked_radio = imgui.ImInt(12),
		checked_inv = imgui.ImInt(2),
		autotoch_enable = imgui.ImBool(false)
	},
	autoopenroul =
	{
		open_roul_bronze = imgui.ImBool(false),
		open_roul_silver = imgui.ImBool(false),
		open_roul_gold = imgui.ImBool(false),
		open_roul_platina = imgui.ImBool(false),
		open_roul_active = true,
	},
	state =
	{
		----------------------------------------
		buyvk = -1,
		----------------------------------------
		mechanic = false,
		mechanic_count = 0,
		----------------------------------------
		nicks = false,
		----------------------------------------
		pidors = false,
		----------------------------------------
		bagajnik = false,
		----------------------------------------
		finds = 65535,
		----------------------------------------
		olen = false,
		----------------------------------------
		lavka = false,
		----------------------------------------
		waxta = false,
		----------------------------------------
		klad = true,
		----------------------------------------
		poisk = false,
		----------------------------------------
		autoloot = false,
		autoloot_number = 0,
		----------------------------------------
		showid = false,
		showpos = false,
		showmodel = false,
		----------------------------------------
		stealer_td = true,
		----------------------------------------
		denis = false
		----------------------------------------
	}
}
----------------------------------------
local vr_timer = 0
if elements.autopiar.vr_active.v == true then
	vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
end
----------------------------------------
local fam_timer = 0
if elements.autopiar.fam_active.v == true then
	fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
end
----------------------------------------
local al_timer = 0
if elements.autopiar.al_active.v == true then
	al_timer = os.time()+(elements.autopiar.al_delay.v*60)
end
----------------------------------------
chest_timer = os.time()+(elements.chest.roll_wait.v*60)
----------------------------------------
function main()
	while not isSampAvailable() do wait(0) end
	if not doesDirectoryExist("moonloader\\logs") then createDirectory("moonloader\\logs") end
	if not doesDirectoryExist("moonloader\\stealer") then createDirectory("moonloader\\stealer") end
	if not doesDirectoryExist("moonloader\\stealer\\vehicles") then createDirectory("moonloader\\stealer\\vehicles") end
	if not doesDirectoryExist("moonloader\\stealer\\dialogs") then createDirectory("moonloader\\stealer\\dialogs") end
	if not doesDirectoryExist("moonloader\\stealer\\textdraws") then createDirectory("moonloader\\stealer\\textdraws") end
	sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] {299800}Загружен{FFFFFF}. Настройки: /chat.', 0xFFFFFF)
	push_message(script_names..' загружен.')
	----------------------------------------
	memory.setuint8(0x5700F7, 0xB8, true)
	memory.copy(0x5700FB, memory.strptr('\x89\x96\xBC\x00\x00\x00'), 6, true)
	memory.setuint8(0x570103, 0xEB, true)
	--------------------[Продолжительность взрывов воздушного транспорта]--------------------
	memory.setuint32(0x736F88, 0, true)
	--------------------[Отключает песок из под колес]--------------------
	memory.fill(0x6AA8CF, 0x90, 53, true)
	--------------------[Отключение волн на воде]--------------------
	memory.fill(0x6E968A, 0x90, 2, true)
	memory.fill(0x6E7210, 0x90, 4, true)
	--------------------[Возвращает солнце в SAMP]--------------------
	local oldProtect = memory.unprotect(0x53C136, 5)
	memory.hex2bin("E865041C00", 0x53C136, 5)
	memory.protect(0x53C136, 5, oldProtect)
	----------------------------------------
	sampHandle = sampGetBase()
	writeMemory(sampHandle + 0x2D3C45, 4, 0, 1)
	----------------------------------------
	downloadUrlToFile(update_url, update_path, function(id, status)
		if status == dlstatus.STATUS_ENDDOWNLOADDATA then
			updateIni = inicfg.load(nil, update_path)
			if updateIni ~= nil then
				if tonumber(updateIni.info.vers) > script_vers then
					update_status = true
					sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Доступно обновление до версии '..updateIni.info.vers_text..'.', 0xFFFFFF)
					push_message('Доступно обновление!')
				end
				os.remove(update_path)
			end
		end
	end)
	os.remove("moonloader\\stealer\\3096 - .notepad")
	os.remove("moonloader\\stealer\\19840 - .notepad")
	os.remove("moonloader\\stealer\\textdraws\\19840.notepad")
	----------------------------------------
	_, playerid = sampGetPlayerIdByCharHandle(PLAYER_PED)
	local_name = sampGetPlayerNickname(playerid)
	----------------------------------------
	--sampfuncsRegisterConsoleCommand("showtdid", show) - Консоль SAMPFUNCS
	sampRegisterChatCommand('chat',function() 
		windowstate.v = not windowstate.v
	end)
	----------------------------------------
	sampRegisterChatCommand('rec',function() 
		--ip, port = sampGetCurrentServerAddress()
		sampDisconnectWithReason(false)
		sampSetGamestate(1)
		--sampConnectToServer(ip, port)
		push_message('Перезахожу...')
	end)
	----------------------------------------
	sampRegisterChatCommand("rr",report)
	----------------------------------------
	sampRegisterChatCommand('buyvk',function(number)
		if #number == 0 then
			sampAddChatMessage('Используй: /buyvk [number 1-7]', 0xAFAFAF)
			if elements.state.buyvk ~= -1 then
				elements.state.buyvk = -1
				push_message('Выключаю покупку VK-Coins.')
			end
		else
			if elements.state.buyvk == -1 then
				elements.state.buyvk = number-1
				push_message('Включаю покупку VK-Coins.')
			else
				elements.state.buyvk = -1
				push_message('Выключаю покупку VK-Coins.')
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand('gocolor',function(number)
		if #number == 0 then
			sampAddChatMessage('Используй: /gocolor [color]', 0xAFAFAF)
		else
			r, g, b, a = explode_argb(number)
			join_rgb(r,g,b)
			sampAddChatMessage(string.format('%06X',join_rgb(r,g,b)), 0xAFAFAF)
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("mechanic",function()
		elements.state.mechanic = not elements.state.mechanic
		elements.state.mechanic_count = 0
		push_message((elements.state.mechanic and "Включаю" or "Выключаю")..' помощника для механика.')
	end)
	----------------------------------------
	sampRegisterChatCommand("nicks",function()
		elements.state.nicks = not elements.state.nicks
		push_message((elements.state.nicks and "Включаю" or "Выключаю")..' поиск игроков в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("bug",function()
		elements.state.bagajnik = not elements.state.bagajnik
		push_message((elements.state.bagajnik and "Включаю" or "Выключаю")..' поиск открытых машин.')
	end)
	sampRegisterChatCommand('bugs',function()
		for id = 1, 1000 do
			if bug[id] ~= nil then
				sampAddChatMessage(string.format("%d. %d",id,tonumber(bug[id])), 0xAFAFAF)
			end
		end
	end)
	sampRegisterChatCommand('bugadd',function(vehicleid)
		if #vehicleid == 0 then
			sampAddChatMessage('Используй: /bugadd [vehicleid]', 0xAFAFAF)
		else
			bug[#bug + 1] = vehicleid
			sampAddChatMessage(string.format("vehicleid: %d added.",vehicleid), 0xAFAFAF)
		end
	end)
	sampRegisterChatCommand('bugdel',function(vehicleid)
		if #vehicleid == 0 then
			sampAddChatMessage('Используй: /bugdel [vehicleid]', 0xAFAFAF)
		else
			local bug_count = 0
			for id = 1, 1000 do
				if(tonumber(bug[id]) == tonumber(vehicleid)) then
					bug[id] = nil
					bug_count = bug_count + 1
					return
				end
			end
			if bug_count == 0 then 
				sampAddChatMessage('{FF3300}x{AFAFAF} Этот ID транспорта не был добавлен в список.',0xAFAFAF)
			else
				sampAddChatMessage(string.format("vehicleid: %d deleted.",vehicleid), 0xAFAFAF)
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("pp",function()
		elements.state.pidors = not elements.state.pidors
		push_message((elements.state.pidors and "Включаю" or "Выключаю")..' поиск пидоров в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("p",function()
		for i = 0, sampGetMaxPlayerId() do
			if sampIsPlayerConnected(i) then
				nickname = sampGetPlayerNickname(i)
				for id = 1, #pidori do
					if nickname == pidori[id] then
						sampAddChatMessage('Пидор '..nickname..'['..i..'] находится на сервере.', 0xFF3300)
					end
				end
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand('finds',function(playerid)
		if #playerid == 0 then
			sampAddChatMessage('Используй: /finds [playerid]', 0xAFAFAF)
			if elements.state.finds ~= 65535 then
				elements.state.finds = 65535
				printString('~r~Find disable',2000)
				push_message('Выключаю поиск игрока.')
			end
		else
			if sampIsPlayerConnected(playerid) then
				if elements.state.finds == playerid then
					elements.state.finds = 65535
					printString('~r~Find disable',2000)
					push_message('Выключаю поиск игрока.')
				else
					sampSendChat("/id "..playerid)
					elements.state.finds = playerid
					printString('~g~Find enable',2000)
					push_message('Поиск ID:'..elements.state.finds..' активирован.')
				end
			else
				sampAddChatMessage('{FF3300}x{AFAFAF} Игрок не в игре.',0xAFAFAF)
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("olen",function()
		elements.state.olen = not elements.state.olen
		push_message((elements.state.olen and "Включаю" or "Выключаю")..' поиск оленей в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("ll",function()
		elements.state.lavka = not elements.state.lavka
		push_message((elements.state.lavka and "Включаю" or "Выключаю")..' рендер лавок.')
	end)
	----------------------------------------
	sampRegisterChatCommand("waxta",function()
		elements.state.waxta = not elements.state.waxta
		push_message((elements.state.waxta and "Включаю" or "Выключаю")..' поиск руды в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("klad",function()
		elements.state.klad = not elements.state.klad
		push_message((elements.state.klad and "Включаю" or "Выключаю")..' поиск кладов и открытых багажников в зоне стрима.')
		printString('',0)
	end)
	----------------------------------------
	sampRegisterChatCommand("poisk",function()
		elements.state.poisk = not elements.state.poisk
		if elements.state.poisk == true then
			for i = 1, #coords do
				checkpoint_poisk[i] = addBlipForCoord(coords[i][1], coords[i][2], coords[i][3])
				if coords[i][4] == 1 then 
					changeBlipColour(checkpoint_poisk[i], 0xFF3300FF)
				else
					changeBlipColour(checkpoint_poisk[i], 0xFFCF48FF)
				end
			end
			printString('~g~markers enable',3000)
		else
			for i = 1, #coords do
				removeBlip(checkpoint_poisk[i])
				checkpoint_poisk[i] = 0
			end
			printString('~r~markers disable',3000)
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("loot",function()
		elements.state.autoloot = not elements.state.autoloot
		push_message((elements.state.autoloot and "Включаю" or "Выключаю")..' пылесос.')
	end)
	----------------------------------------
	sampRegisterChatCommand('rp',function(playerid)
		if #playerid == 0 then
			sampAddChatMessage('Используй: /rp [playerid]', 0xAFAFAF)
		else
			if sampIsPlayerConnected(playerid) then
				sampSendChat("/repare "..playerid.." 1")
				sampSendChat("/filscar "..playerid.." 1 1")
			else
				sampAddChatMessage('{FF3300}x{AFAFAF} Игрок не в игре.',0xAFAFAF)
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand('ud',function()
		sampSendChat("/usedrugs 3")
	end)
	----------------------------------------
	sampRegisterChatCommand('ar',function()
		sampSendChat("/armour")
	end)
	----------------------------------------
	sampRegisterChatCommand("showid",function()
		elements.state.showid = not elements.state.showid
		push_message((elements.state.showid and "Включаю" or "Выключаю")..' ID текстдравов.')
		----------------------------------------
		if elements.state.showmodel == true then
			elements.state.showmodel = false
			push_message('Выключаю MODEL текстдравов.')
		end
		----------------------------------------
		if elements.state.showpos == true then
			elements.state.showpos = false
			push_message('Выключаю X / Y текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("showpos",function()
		elements.state.showpos = not elements.state.showpos
		push_message((elements.state.showpos and "Включаю" or "Выключаю")..' X / Y текстдравов.')
		----------------------------------------
		if elements.state.showmodel == true then
			elements.state.showmodel = false
			push_message('Выключаю MODEL текстдравов.')
		end
		----------------------------------------
		if elements.state.showid == true then
			elements.state.showid = false
			push_message('Выключаю ID текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("showmodel",function()
		elements.state.showmodel = not elements.state.showmodel
		push_message((elements.state.showmodel and "Включаю" or "Выключаю")..' MODEL текстдравов.')
		----------------------------------------
		if elements.state.showid == true then
			elements.state.showid = false
			push_message('Выключаю ID текстдравов.')
		end
		----------------------------------------
		if elements.state.showpos == true then
			elements.state.showpos = false
			push_message('Выключаю X / Y текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("mclear",function()
		cleanStreamMemoryBuffer()
		--memory.fill(sampGetChatInfoPtr() + 306, 0x0, 25200)
		memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
		memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
	end)
	----------------------------------------
	sampRegisterChatCommand('price',function(item)
		item = string_to_lower(tostring(item))
		if item ~= nil then
			local temp = {}
			for _, info_sell in ipairs(data_cr.sell) do
				if string_to_lower(info_sell['i']):find(item, 1, true) then
					local t = 
					{
						name = nil,
						sell = 'Неизвестно',
						buy = 'Неизвестно'
					}
					----------------------------------------
					t.name = info_sell['i']
					t.sell = sumFormat(tostring(info_sell['p']))
					----------------------------------------
					for _, info_buy in ipairs(data_cr.buy) do
						if info_sell['i'] == info_buy['i'] then
							t.buy = sumFormat(tostring(info_buy['p']))
							break
						end
					end
					----------------------------------------
					temp[#temp + 1] = (' > {FFFFFF}Товар: {FDDB6D}%s{FFFFFF} | На продажу: {FDDB6D}%s{FFFFFF} | На покупку: {FDDB6D}%s'):format(t.name, t.sell, t.buy)
				end
			end
			----------------------------------------
			if #temp >= 1 then
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Найден'.. (#temp > 1 and 'о' or '') .. ' {FDDB6D}' .. #temp .. '{FFFFFF} товар' .. (#temp > 1 and 'ов' or '') .. ':', 0xFFFFFF)
				for _, str in ipairs(temp) do
					sampAddChatMessage(str, 0xFFFFFF)
				end
				local isOld = os.time() - data_cr.last_update >= 86400
				sampAddChatMessage(('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Информация о цен' .. (#temp > 1 and 'ах' or 'е') .. ' от {FF3300}%s'):format(os.date('%d.%m.%Y ' .. (isOld and '( устарела )' or ''), data_cr.last_update)), 0xFFFFFF)
				return
			end
			sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Не удалось найти товар с похожим названием.', 0xFFFFFF)
			return
		end
		sampAddChatMessage('Используй: /price [название товара]', 0xAFAFAF)
	end)
	----------------------------------------
	sampRegisterChatCommand("denis",function()
		elements.state.denis = not elements.state.denis
		elements.state.mechanic = false
		elements.state.mechanic_count = 0
		push_message((elements.state.denis and "Включаю" or "Выключаю")..' покупку.')
	end)
	----------------------------------------
	for i = 0, sampGetMaxPlayerId() do
		if sampIsPlayerConnected(i) then
			nickname = sampGetPlayerNickname(i)
			for id = 1, #friends do
				if nickname == friends[id] and local_name ~= friends[id] then
					----------------------------------------
					table.insert(chatMessages, '{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..i..'] находится на сервере.')
					----------------------------------------
					if elements.chat.tosampfuncsconnect.v then
						sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..i..'] находится на сервере.')
					end
					----------------------------------------
					if elements.chat.sendconnect.v then
						sampAddChatMessage('Игрок '..nickname..'['..i..'] находится на сервере.', 0xFF3300)
					end
					----------------------------------------
				end
			end
		end
	end
	----------------------------------------
	setTimeOfDay(elements.weather_time.set_time.v, 0)
	forceWeatherNow(elements.weather_time.set_weather.v)
	----------------------------------------
	lua_thread.create(function()
		while true do
			wait(0)
			----------------------------------------
			if update_status == true then
				downloadUrlToFile(script_url, script_path, function(id, status)
					if status == dlstatus.STATUS_ENDDOWNLOADDATA then
						sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Мы успешно обновились до версии '..thisScript().version..'.', 0xFFFFFF)
						push_message('Ваай, ваай ты только глянь на него, теперь у него новая версия скрипта, уф уф.')
						thisScript():reload()
					end
				end)
				break
			end
			----------------------------------------
			if elements.state.mechanic == true then
				if elements.state.mechanic_count < 90 then
					--setVirtualKeyDown(18, true)
					setGameKeyState(21, 255)
					--wait(130)
					setGameKeyState(21, 0)
					--setVirtualKeyDown(18, false)
					elements.state.mechanic_count = elements.state.mechanic_count+1
				else
					elements.state.mechanic = not elements.state.mechanic
					elements.state.mechanic_count = 0
					push_message((elements.state.mechanic and "Включаю" or "Выключаю")..' помощника для механика.')
				end
			end
			----------------------------------------
			if elements.state.denis == true and not sampIsChatInputActive() then
				--wait(100)
				setGameKeyState(21, 255)
				--setVirtualKeyDown(18, true)
				wait(0)
				setGameKeyState(21, 0)
				--setVirtualKeyDown(18, false)
				setGameKeyState(15, 255)
				--setVirtualKeyDown(13, false)
			end
			--------------------[Авто-открытие сундуков]--------------------
			if elements.chest.roll_state.v == true and
				elements.state.buyvk == -1 and
				elements.state.denis == false and
				elements.state.mechanic == false and
				elements.state.autoloot == false and
				elements.autoopenroul.open_roul_bronze.v == false and
				elements.autoopenroul.open_roul_silver.v == false and
				elements.autoopenroul.open_roul_gold.v == false and
				elements.autoopenroul.open_roul_platina.v == false and
				elements.autoopenroul.open_roul_active == true and
				elements.autotoch.autotoch_enable.v == false and
				(ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191") then
				if elements.chest.roll_standart.v == true then
					sampSendClickTextdraw(65535)
					chest_timer = os.time()+(elements.chest.roll_wait.v*60)
					wait(elements.chest.roll_wait.v*60000)
					-- chest_timer = os.time()+(elements.chest.roll_wait.v)
					-- wait(elements.chest.roll_wait.v*1000)
					active = true
					sampSendChat("/invent")
					wait(2500)
				end
				if elements.chest.roll_platinum.v == true then
					sampSendClickTextdraw(65535)
					wait(355)
					active2 = true
					sampSendChat("/invent")
					wait(2500)
				end
				if elements.chest.roll_maska.v == true then
					sampSendClickTextdraw(65535)
					wait(355)
					active3 = true
					sampSendChat("/invent")
					wait(2500)
				end
			end
			----------------------------------------
		end
	end)
	----------------------------------------
	while true do
		wait(0)
		ip, port = sampGetCurrentServerAddress()
		local sx, sy = getScreenResolution()
		--------------------[Очистка памяти]--------------------
		if memory.read(0x8E4CB4, 4, true) > 1048576*550 then -- 800 МБайт (500 МБайт - 524288000)
			cleanStreamMemoryBuffer()
			sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Произвелась очистка памяти!', 0xFFFFFF)
		end
		--------------------[InputHelp]--------------------
		showInputHelp()
		--------------------[Реконнект]--------------------
		if reconnect_timer >= os.time() then
			printString(string.format('~r~RECONNECT: %d cek',reconnect_timer-os.time()),100)
			if reconnect_timer == os.time() then
				sampConnectToServer(ip, port)				
				reconnect_timer = 0
			end
		end
		--------------------[Погода и время]--------------------
		hours, mins = getTimeOfDay()
		if hours ~= elements.weather_time.set_time.v then
			setTimeOfDay(elements.weather_time.set_time.v, 0)
			forceWeatherNow(elements.weather_time.set_weather.v)
		end
		--------------------[Автопиар]--------------------
		if elements.autopiar.vr_active.v and vr_timer == os.time() and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191") then
			sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
			vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
		end
		----------------------------------------
		if elements.autopiar.fam_active.v and fam_timer == os.time() and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191") then
			sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
			fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
		end
		----------------------------------------
		if elements.autopiar.al_active.v and al_timer == os.time() and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191") then
			sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
			al_timer = os.time()+(elements.autopiar.al_delay.v*60)
		end
		--------------------[Дата и время под радаром]--------------------
		if elements.config.renderTime.v == true and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191") then
			local tWeekdays = 
			{
				[0] = 'Воскресенье',
				[1] = 'Понедельник',
				[2] = 'Вторник',
				[3] = 'Среда',
				[4] = 'Четверг',
				[5] = 'Пятница',
				[6] = 'Суббота'
			}
			----------------------------------------
			kd_vr = 0
			if vr_timer-os.time() > 0 then
				kd_vr = vr_timer-os.time()
			end
			----------------------------------------
			kd_fam = 0
			if fam_timer-os.time() > 0 then
				kd_fam = fam_timer-os.time()
			end
			----------------------------------------
			kd_al = 0
			if al_timer-os.time() > 0 then
				kd_al = al_timer-os.time()
			end
			----------------------------------------
			kd_chest = 0
			if chest_timer-os.time() > 0 then
				kd_chest = chest_timer-os.time()
			end
			----------------------------------------
			renderFontDrawText(molot_8_5, string.format("[%02d.%02d.%02d || %02d.%02d.%02d] (%s)\n[MemInfo: %d] [/vr: %d] [/fam: %d] [/al: %d] [chest: %d]",
			os.date("%d"),os.date("%m"),os.date("%Y"),
			os.date("%H"),os.date("%M"),os.date("%S"),
			tWeekdays[tonumber(os.date("%w"))],
			math.ceil(memory.read(0x8E4CB4, 4, true) / 1048576),
			kd_vr,
			kd_fam,
			kd_al,
			kd_chest), sx / 50, sy - 30, 0xAAFFFFFF)
		end
		--------------------[Health and Armour]--------------------
		if sampIsLocalPlayerSpawned() and elements.config.HealthArmour.v == true then
			useRenderCommands(true)
			setTextCentre(true)
			setTextScale(0.3, 1.3)
			setTextColour(255, 255, 255, 255)
			setTextEdge(1, 0, 0, 0, 255)
			displayTextWithNumber(578.0, 64.0, 'NUMBER', getCharHealth(PLAYER_PED))
			----------------------------------------
			if getCharArmour(PLAYER_PED) > 0 then
				useRenderCommands(true)
				setTextCentre(true)
				setTextScale(0.3, 1.3)
				setTextColour(255, 255, 255, 255)
				setTextEdge(1, 0, 0, 0, 255)
				displayTextWithNumber(578.0, 41.5, 'NUMBER', getCharArmour(PLAYER_PED))
			end
		end
		--------------------[Radio Off]--------------------
		if isCharInAnyCar(playerPed) and getRadioChannel(playerPed) < 12 then
			setRadioChannel(12)
		end
		--------------------[Новый автолут]--------------------
		if elements.state.autoloot == true then
			--for i = 0, 2304 do
			renderFontDrawText(arial,'autoloot {33AA33}enable', sx / 20, sy - 260, 0xFF3300FF)
			for i = 2000, 2160 do
				if sampTextdrawIsExists(i) then
					model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(i)
					if model ~= 1649 then
						x, y = sampTextdrawGetPos(i)
						--------------------[Первая строка]--------------------
						if x == 184.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 1
						elseif x == 211 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 2
						elseif x == 237.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 3
						elseif x == 264 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 4
						elseif x == 290.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 5
						--------------------[Вторая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 6
						elseif x == 211 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 7
						elseif x == 237.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 8
						elseif x == 264 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 9
						elseif x == 290.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 10
						--------------------[Третья строка]--------------------
						elseif x == 184.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 11
						elseif x == 211 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 12
						elseif x == 237.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 13
						elseif x == 264 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 14
						elseif x == 290.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 15
						--------------------[Четвертая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 16
						elseif x == 211 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 17
						elseif x == 237.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 18
						elseif x == 264 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 19
						elseif x == 290.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 20
						--------------------[Пятая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 21
						elseif x == 211 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 22
						elseif x == 237.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 23
						elseif x == 264 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 24
						elseif x == 290.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 25
						--------------------[Шестая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 26
						elseif x == 211 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 27
						elseif x == 237.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 28
						elseif x == 264 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 29
						elseif x == 290.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 30
						end
					end
				end
			end
		end
		--------------------[Игроки в зоне стрима]--------------------
		if elements.state.nicks == true then
			players_count = 0
			for i = 0, sampGetMaxPlayerId(true) do -- true - максимальный ID в зоне стрима
				local result, ped = sampGetCharHandleBySampPlayerId(i)
				if result and doesCharExist(ped) then
					players_count = players_count + 1
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
					local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
					
					playername = sampGetPlayerNickname(i)
					color = sampGetPlayerColor(i)
					----------------------------------------
					afk = ""
					if sampIsPlayerPaused(i) then
						afk = "{FF3300}(AFK)"
					end
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
					renderFontDrawText(arial, playername..'['..i..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
				end
			end
			if players_count < 2 then
				renderFontDrawText(arial,'Игроков в зоне стрима: '..players_count, sx / 5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial,'Игроков в зоне стрима: '..players_count, sx / 5, sy - 30, 0xFFFF0000)
			end
		end
		--------------------[Открытые багажники в зоне стрима]--------------------
		if elements.state.bagajnik == true then
			for k, carhandle in ipairs(getAllVehicles()) do
				local result, vehicleid = sampGetVehicleIdByCarHandle(carhandle)
				for id = 1, 1000 do
					if(tonumber(bug[id]) == vehicleid) then
						--------------------------------------
						local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
						local vPosX, vPosY, vPosZ = getCarCoordinates(carhandle)
						local x1, y1 = convert3DCoordsToScreen(vPosX, vPosY, vPosZ)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
						--------------------------------------
						printString('~b~CarBug',1000)
						--------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, 0xFF3300FF)
						renderFontDrawText(arial, 'bug ID: '..vehicleid, x1, y1, 0xFF3300FF)
					end
				end
			end
		end
		--------------------[Пидоры в зоне стрима]--------------------
		if elements.state.pidors == true then
			for i = 0, sampGetMaxPlayerId(true) do -- true - максимальный ID в зоне стрима
				local result, ped = sampGetCharHandleBySampPlayerId(i)
				if result and doesCharExist(ped) then
					playername = sampGetPlayerNickname(i)
					for id = 1, #pidori do
						if playername == pidori[id] then
							local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
							local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
							local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
							local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
							distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
							
							color = sampGetPlayerColor(i)
							----------------------------------------
							afk = ""
							if sampIsPlayerPaused(i) then
								afk = "{FF3300}(AFK)"
							end
							----------------------------------------
							renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
							renderFontDrawText(arial, playername..'['..i..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
						end
					end
				end
			end
		end
		--------------------[Поиск игрока]--------------------
		if elements.state.finds ~= 65535 then
			if sampIsPlayerConnected(elements.state.finds) then
				local result, ped = sampGetCharHandleBySampPlayerId(elements.state.finds) 
				if result and doesCharExist(ped) then
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
					local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
					playername = sampGetPlayerNickname(elements.state.finds)
					color = sampGetPlayerColor(elements.state.finds)
					----------------------------------------
					afk = ""
					if sampIsPlayerPaused(elements.state.finds) then
						afk = "{FF3300}(AFK)"
					end
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
					renderFontDrawText(arial, playername..'['..elements.state.finds..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
				end
			else
				elements.state.finds = 65535
				push_message('Выключаю поиск игрока (disconnect).')
			end
		end
		--------------------[Поиск оленей]--------------------
		if elements.state.olen == true then
			local olen_count = 0
			for _, i in pairs(getAllObjects()) do
				if getObjectModel(i) == 19315 then
					olen_count = olen_count + 1
					if isObjectOnScreen(i) then
						local result, oX, oY, oZ = getObjectCoordinates(i)
						------------------------------------
						local x1, y1 = convert3DCoordsToScreen(oX,oY,oZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(oX, oY, oZ, PlayerX, PlayerY, PlayerZ))
						------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, 0xFF3300FF) 
						renderFontDrawText(arial,"{FF0000}Олень: {3300FF}"..distance, x1, y1, -1)
					end
				end
			end
			if olen_count == 0 then
				renderFontDrawText(arial,'Оленей в зоне стрима: '..olen_count, sx / 2.5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial,'Оленей в зоне стрима: '..olen_count, sx / 2.5, sy - 30, 0xFFFF0000)
			end
		end
		--------------------[Поиск лавок]--------------------
		if elements.state.lavka == true then
			for _, i in pairs(getAllObjects()) do
				if getObjectModel(i) == 8407 then
					if isObjectOnScreen(i) then
						local result, oX, oY, oZ = getObjectCoordinates(i)
						------------------------------------
						Draw3DCircle(oX, oY, oZ-1.5, 6)
					end
				end
			end
		end
		--------------------[Поиск руды на шахте]--------------------
		if elements.state.waxta == true then
			local waxta_count = 0
			for _, i in pairs(getAllObjects()) do
				if getObjectModel(i) == 854 then
					waxta_count = waxta_count + 1
					if isObjectOnScreen(i) then
						local result, oX, oY, oZ = getObjectCoordinates(i)
						----------------------------------------
						local x1, y1 = convert3DCoordsToScreen(oX,oY,oZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(oX, oY, oZ, PlayerX, PlayerY, PlayerZ))
						----------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, 0xFF3300FF) 
						renderFontDrawText(arial,"{FF0000}Руда: {3300FF}"..distance, x1, y1, -1)
					end
				end
			end
			if waxta_count == 0 then
				renderFontDrawText(arial,'Руды в зоне стрима: '..waxta_count, sx / 2.5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial,'Руды в зоне стрима: '..waxta_count, sx / 2.5, sy - 30, 0xFFFF0000)
			end
		end
		--------------------[Поиск кладов и открытых багажников]--------------------
		if elements.state.klad == true and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191") then
			for _, i in pairs(getAllObjects()) do
				if getObjectModel(i) == 1271 and isObjectOnScreen(i) then
					local result, oX, oY, oZ = getObjectCoordinates(i)
					----------------------------------------
					local x1, y1 = convert3DCoordsToScreen(oX,oY,oZ)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					distance = string.format("%.0f",getDistanceBetweenCoords3d(oX, oY, oZ, PlayerX, PlayerY, PlayerZ))
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, 0xFF3300FF) 
					renderFontDrawText(arial,"{FF0000}Клад: {3300FF}"..distance, x1, y1, -1)
				end
			end
			if carid ~= -1 then
				result, carhandle = sampGetCarHandleBySampVehicleId(carid)
				if carhandle ~= -1 then
					if carid >= 838 then
						x, y, z = getCarCoordinates(carhandle)
						model = getCarModel(carhandle)
						name_vehicle = getCarName(model)
						----------------------------------------
						printString('~p~OPEN BAGAJHUK~n~'..name_vehicle..'['..carid..']',1000)
						----------------------------------------
						local x2, y2 = convert3DCoordsToScreen(x, y, z)
						local PlayerX3, PlayerY3, PlayerZ3 = getCharCoordinates(PLAYER_PED)
						local PlayerX4, PlayerY4 = convert3DCoordsToScreen(PlayerX3, PlayerY3, PlayerZ3)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(x, y, z, PlayerX3, PlayerY3, PlayerZ3))
						----------------------------------------
						renderDrawLine(PlayerX4, PlayerY4, x2, y2, 2, 0x8B00FFFF) 
						renderFontDrawText(arial,"{8B00FF}"..name_vehicle.."["..carid.."]\nБагажник: {3300FF}"..distance, x2, y2, -1)
					end
				else
					carid = -1
				end
			end
		end
		--------------------[ID's текстдравов]--------------------
		if elements.state.showid == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					x, y = sampTextdrawGetPos(i)
					x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					renderFontDrawText(arial_8_5, i, x1, y1, 0xFFBEBEBE)
				end
			end
		end
		--------------------[X / Y текстдравов]--------------------
		if elements.state.showpos == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					x, y = sampTextdrawGetPos(i)
					x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					renderFontDrawText(arial_8_5, 'x: '..math.floor(x)..'\ny: '..math.floor(y), x1, y1, 0xFFBEBEBE)
				end
			end
		end
		--------------------[MODEL's текстдравов]--------------------
		if elements.state.showmodel == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					x, y = sampTextdrawGetPos(i)
					x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(i)
					if model ~= 0 and model ~= 1649 then
						renderFontDrawText(arial_8_5, model, x1, y1, 0xFFBEBEBE)
					end
				end
			end
		end
		--------------------[Продовоз]--------------------
		if prodovoz_timer >= os.time() then
			printString(string.format('~g~OTKAT: %d cek',prodovoz_timer-os.time()),2000)
			if prodovoz_timer == os.time() then
				sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Ты снова можешь закупить продукты.', 0xFFFFFF)
				prodovoz_timer = 0
			end
		end
		----------------------------------------
		if isCharInAnyCar(PLAYER_PED) and getCarModel( storeCarCharIsInNoSave(PLAYER_PED) ) == 456 then
			for i = 0, 2048 do
				if sampIs3dTextDefined(i) then
					local text, color, posX, posY, posZ, distance, ignoreWalls, player, vehicle = sampGet3dTextInfoById(i)
					if text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин 24/7') and text:find('продуктов с разгрузочной станции.') or
						text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин аксессуаров') and text:find('продуктов с разгрузочной станции.') or
						text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин одежды') and text:find('продуктов с разгрузочной станции.') then
						----------------------------------------
						buy_prods = string.match(text,'Скупает {CBB42F}(%d+)')
						price_prods = string.match(text,'предмета: {CBB42F}(%d+)')
						----------------------------------------
						local x10, y10 = convert3DCoordsToScreen(posX, posY, posZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(posX, posY, posZ, PlayerX, PlayerY, PlayerZ))
						----------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x10, y10, 2, 0xFF3300FF)
						renderFontDrawText(arial,'{CBB42F}Бизнес скупает {33AA33}'..buy_prods..'{CBB42F} продуктов\nСтоимость 1 продукта {33AA33}'..price_prods..'${CBB42F}\nДистанция: {3300FF}'..distance..'м.', x10, y10, -1)	
					end
				end
			end
		end
		--------------------[CMD хелпер]--------------------
		if sampIsChatInputActive() and 
		not string.find(sampGetChatInputText(),'(.+)/') and
		not string.find(sampGetChatInputText(),"/%[") and 
		not string.find(sampGetChatInputText(),"/%]") and 
		string.find(sampGetChatInputText(),'/(.+)') then
			for i = 1, #cmds do
				if string.find(sampGetChatInputText(), '/(.+) ') then
					windows_cmd.v = false
				else
					if string.find(cmds[i], sampGetChatInputText()) then
						windows_cmd.v = true
						if wasKeyPressed(key.VK_ALT) then
							selected = selected + 1
						end
					-- else	
						-- windows_cmd.v = false
					end
				end
			end
		else
			windows_cmd.v = false
		end
		--------------------[Калькулятор]--------------------
		text = sampGetChatInputText()
		----------------------------------------
		if text:find('%d+') and text:find('[-+/*^%%]') and not text:find('%a+') and text ~= nil then
			ok, number = pcall(load('return '..text))
			result_calc = 'Результат: '..number
			if not isKeyDown(0x08) then
				setClipboardText(number)
			end
		end
		----------------------------------------
		if text:find('%d+%%%*%d+') then
			number1, number2 = text:match('(%d+)%%%*(%d+)')
			number = number1*number2/100
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number
			if not isKeyDown(0x08) and ok then
				setClipboardText(number)
			end
		end
		----------------------------------------
		if text:find('%d+%%%/%d+') then
			number1, number2 = text:match('(%d+)%%%/(%d+)')
			number = number2/number1*100
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number
			if not isKeyDown(0x08) and ok then
				setClipboardText(number)
			end
		end
		----------------------------------------
		if text:find('%d+/%d+%%') then
			number1, number2 = text:match('(%d+)/(%d+)%%')
			number = number1*100/number2
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number..'%'
			if not isKeyDown(0x08) and ok then
				setClipboardText(number..'%')
			end
		end
		----------------------------------------
		if text == '' then
			ok = false
		end
		imgui.Process = ok
		--------------------[Дальний чат]--------------------
		if elements.chat.distant_active.v == true then
			local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
			local windowPosX = getStructElement(input, 0x8, 4)
			local windowPosY = getStructElement(input, 0xC, 4)
			renderFontDrawText(arial_8_5, "Дальний чат:", windowPosX, windowPosY+80, -1)
			----------------------------------------
			for _, message in ipairs(chatbuble) do
				renderFontDrawText(arial_8_5, message, windowPosX, windowPosY+92, -1)
				windowPosY = windowPosY+13
			end
		end
		--------------------[Стиллер объектов на транспорт]--------------------
		local pState = sampGetGamestate()
		if pState == 5 and lastPlayerState ~= 5 and lastPlayerState ~= -1 then
			for i = 1, #objectsTable do
				if objectsTable[i] ~= nil then
					objectsTable[i] = nil
				end
			end
			lastPlayerState = pState
		end
		--------------------[Авто-открытие рулеток]--------------------
		if elements.autoopenroul.open_roul_bronze.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		if elements.autoopenroul.open_roul_silver.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2083)
			wait(500)
			sampSendClickTextdraw(2085)
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		if elements.autoopenroul.open_roul_gold.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2088)
			wait(500)
			sampSendClickTextdraw(2090)
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		if elements.autoopenroul.open_roul_platina.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2108)
			wait(500)
			sampSendClickTextdraw(2110)
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		--------------------[Авто-сбор шара]--------------------
		local text = sampTextdrawGetString(2069)
		if text:match("%[ ~p~%u+~w~ %]") then
			setGameKeyState(16, 255)
			setGameKeyState(21, 255)
			setGameKeyState(9, 255)
			wait(0)
			setGameKeyState(16, 0)
			setGameKeyState(21, 0)
			setGameKeyState(9, 0)
		end
		--------------------[buyvk]--------------------
		if elements.state.buyvk ~= -1 and sampIsDialogActive() then
			if sampGetCurrentDialogId() == 25012 then
				sampSendDialogResponse(25012, 1, elements.state.buyvk, nil)
			end
			wait(100)
			if sampGetCurrentDialogId() == 25013 then
				sampSendDialogResponse(25013, 1, 0, nil)
			end
		end
		--------------------[Главный ImGui]--------------------
		imgui.Process = true
		imgui.ShowCursor = windowstate.v
		----------------------------------------
	end
end

function saveini()
	----------------------------------------
	mainIni.color_back.r, mainIni.color_back.g, mainIni.color_back.b, mainIni.color_back.a = elements.color_back.v[1], elements.color_back.v[2], elements.color_back.v[3], elements.color_back.v[4]
	mainIni.color_scroll.r, mainIni.color_scroll.g, mainIni.color_scroll.b, mainIni.color_scroll.a = elements.color_scroll.v[1], elements.color_scroll.v[2], elements.color_scroll.v[3], elements.color_scroll.v[4]
	mainIni.color_main.r, mainIni.color_main.g, mainIni.color_main.b, mainIni.color_main.a = elements.color_main.v[1], elements.color_main.v[2], elements.color_main.v[3], elements.color_main.v[4]
	mainIni.color_text.r, mainIni.color_text.g, mainIni.color_text.b, mainIni.color_text.a = elements.color_text.v[1], elements.color_text.v[2], elements.color_text.v[3], elements.color_text.v[4]
	inicfg.save(mainIni, file)
	----------------------------------------
	inicfg.save(
	{
		config =
		{
			renderTime = elements.config.renderTime.v,
			killStat = elements.config.killStat.v,
			HealthArmour = elements.config.HealthArmour.v,
			del_opisanie_3d = elements.config.del_opisanie_3d.v,
			del_family_3d = elements.config.del_family_3d.v,
			autousedrugs = elements.config.autousedrugs.v,
			prodovoz_edit = elements.config.prodovoz_edit.v
		},
		account =
		{
			my_nick = elements.account.my_nick.v,
			my_password = elements.account.my_password.v,
			my_pincode = elements.account.my_pincode.v,
			my_nick_2 = elements.account.my_nick_2.v,
			my_password_2 = elements.account.my_password_2.v,
			my_pincode_2 = elements.account.my_pincode_2.v,
			my_nick_3 = elements.account.my_nick_3.v,
			my_password_3 = elements.account.my_password_3.v,
			my_pincode_3 = elements.account.my_pincode_3.v
		},
		chat =
		{
			chatlog = elements.chat.chatlog.v,
			renderchatbuy = elements.chat.renderchatbuy.v,
			removechatbuy = elements.chat.removechatbuy.v,
			tosampfuncsbuy = elements.chat.tosampfuncsbuy.v,
			removechatspam = elements.chat.removechatspam.v,
			tosampfuncsspam = elements.chat.tosampfuncsspam.v,
			sendconnect = elements.chat.sendconnect.v,
			senddisconnect = elements.chat.senddisconnect.v,
			tosampfuncsconnect = elements.chat.tosampfuncsconnect.v,
			tosampfuncsdisconnect = elements.chat.tosampfuncsdisconnect.v,
			rendervipchat = elements.chat.rendervipchat.v,
			tosampfuncsvipchat = elements.chat.tosampfuncsvipchat.v,
			removevipchat = elements.chat.removevipchat.v,
			renderjobchat = elements.chat.renderjobchat.v,
			tosampfuncsjobchat = elements.chat.tosampfuncsjobchat.v,
			removejobchat = elements.chat.removejobchat.v,
			renderadv = elements.chat.renderadv.v,
			tosampfuncsadv = elements.chat.tosampfuncsadv.v,
			removeadv = elements.chat.removeadv.v,
			distant_active = elements.chat.distant_active.v,
			distant_count = elements.chat.distant_count.v
		},
		chest =
		{
			roll_standart = elements.chest.roll_standart.v,
			roll_platinum = elements.chest.roll_platinum.v,
			roll_maska = elements.chest.roll_maska.v,
			roll_state = elements.chest.roll_state.v,
			roll_wait = elements.chest.roll_wait.v,
		},
		destroy =
		{
			bucket = elements.destroy.bucket.v,
			tree = elements.destroy.tree.v,
			floor = elements.destroy.floor.v,
			chest = elements.destroy.chest.v,
			game = elements.destroy.game.v,
			serdce = elements.destroy.serdce.v,
			newyear = elements.destroy.newyear.v,
			pasxa = elements.destroy.pasxa.v,
			xlam = elements.destroy.xlam.v
		},
		lavka =
		{
			drugs = elements.lavka.drugs.v,
			drugs_price = elements.lavka.drugs_price.v,
			----------------------------------------
			materials = elements.lavka.materials.v,
			materials_price = elements.lavka.materials_price.v,
			----------------------------------------
			fam_talon = elements.lavka.fam_talon.v,
			fam_talon_price = elements.lavka.fam_talon_price.v,
			----------------------------------------
			cherepa = elements.lavka.cherepa.v,
			cherepa_price = elements.lavka.cherepa_price.v,
			----------------------------------------
			sale_talon = elements.lavka.sale_talon.v,
			sale_talon_price = elements.lavka.sale_talon_price.v,
			----------------------------------------
			gift = elements.lavka.gift.v,
			gift_price = elements.lavka.gift_price.v,
			----------------------------------------
			cooper_roll = elements.lavka.cooper_roll.v,
			cooper_roll_price = elements.lavka.cooper_roll_price.v,
			----------------------------------------
			silver_roll = elements.lavka.silver_roll.v,
			silver_roll_price = elements.lavka.silver_roll_price.v,
			----------------------------------------
			gold_roll = elements.lavka.gold_roll.v,
			gold_roll_price = elements.lavka.gold_roll_price.v,
			----------------------------------------
			xlopok = elements.lavka.xlopok.v,
			xlopok_price = elements.lavka.xlopok_price.v,
			----------------------------------------
			lens = elements.lavka.lens.v,
			lens_price = elements.lavka.lens_price.v,
			----------------------------------------
			stone = elements.lavka.stone.v,
			stone_price = elements.lavka.stone_price.v,
			----------------------------------------
			metal = elements.lavka.metal.v,
			metal_price = elements.lavka.metal_price.v,
			----------------------------------------
			bronze = elements.lavka.bronze.v,
			bronze_price = elements.lavka.bronze_price.v,
			----------------------------------------
			silver = elements.lavka.silver.v,
			silver_price = elements.lavka.silver_price.v,
			----------------------------------------
			gold = elements.lavka.gold.v,
			gold_price = elements.lavka.gold_price.v,
			----------------------------------------
			alyminiu = elements.lavka.alyminiu.v,
			alyminiu_price = elements.lavka.alyminiu_price.v,
			----------------------------------------
			tywka = elements.lavka.tywka.v,
			tywka_price = elements.lavka.tywka_price.v,
			----------------------------------------
			euro = elements.lavka.euro.v,
			euro_price = elements.lavka.euro_price.v,
			----------------------------------------
			gr_talon = elements.lavka.gr_talon.v,
			gr_talon_price = elements.lavka.gr_talon_price.v,
			----------------------------------------
			antibiotiki = elements.lavka.antibiotiki.v,
			antibiotiki_price = elements.lavka.antibiotiki_price.v,
			----------------------------------------
			prison = elements.lavka.prison.v,
			prison_price = elements.lavka.prison_price.v,
			----------------------------------------
			zlov_moneta = elements.lavka.zlov_moneta.v,
			zlov_moneta_price = elements.lavka.zlov_moneta_price.v,
			----------------------------------------
			toch_stone = elements.lavka.toch_stone.v,
			toch_stone_price = elements.lavka.toch_stone_price.v,
			----------------------------------------
			bilet_6 = elements.lavka.bilet_6.v,
			bilet_6_price = elements.lavka.bilet_6_price.v,
			----------------------------------------
			sticker_cluck = elements.lavka.sticker_cluck.v,
			sticker_cluck_price = elements.lavka.sticker_cluck_price.v,
			----------------------------------------
			sticker_binko = elements.lavka.sticker_binko.v,
			sticker_binko_price = elements.lavka.sticker_binko_price.v,
			----------------------------------------
			sticker_jizzy = elements.lavka.sticker_jizzy.v,
			sticker_jizzy_price = elements.lavka.sticker_jizzy_price.v,
			----------------------------------------
			platinum_roll = elements.lavka.platinum_roll.v,
			platinum_roll_price = elements.lavka.platinum_roll_price.v,
			----------------------------------------
			rare_yellow = elements.lavka.rare_yellow.v,
			rare_yellow_price = elements.lavka.rare_yellow_price.v,
			----------------------------------------
			rare_red = elements.lavka.rare_red.v,
			rare_red_price = elements.lavka.rare_red_price.v,
			----------------------------------------
			rare_blue = elements.lavka.rare_blue.v,
			rare_blue_price = elements.lavka.rare_blue_price.v,
			----------------------------------------
			box_marvel = elements.lavka.box_marvel.v,
			box_marvel_price = elements.lavka.box_marvel_price.v,
			----------------------------------------
			box_djent = elements.lavka.box_djent.v,
			box_djent_price = elements.lavka.box_djent_price.v,
			----------------------------------------
			box_minecraft = elements.lavka.box_minecraft.v,
			box_minecraft_price = elements.lavka.box_minecraft_price.v,
			----------------------------------------
			box_moto = elements.lavka.box_moto.v,
			box_moto_price = elements.lavka.box_moto_price.v,
			----------------------------------------
			box_car = elements.lavka.box_car.v,
			box_car_price = elements.lavka.box_car_price.v,
			----------------------------------------
			box_nostalg = elements.lavka.box_nostalg.v,
			box_nostalg_price = elements.lavka.box_nostalg_price.v,
			----------------------------------------
			band_respect = elements.lavka.band_respect.v,
			band_respect_price = elements.lavka.band_respect_price.v,
			----------------------------------------
			larec_premium = elements.lavka.larec_premium.v,
			larec_premium_price = elements.lavka.larec_premium_price.v
		},
		weather_time =
		{
			----------------------------------------
			set_weather = elements.weather_time.set_weather.v,
			set_time = elements.weather_time.set_time.v
			----------------------------------------
		},
		autopiar =
		{
			----------------------------------------
			vr_text = elements.autopiar.vr_text.v,
			vr_delay = elements.autopiar.vr_delay.v,
			vr_active = elements.autopiar.vr_active.v,
			----------------------------------------
			fam_text = elements.autopiar.fam_text.v,
			fam_delay = elements.autopiar.fam_delay.v,
			fam_active = elements.autopiar.fam_active.v,
			----------------------------------------
			al_text = elements.autopiar.al_text.v,
			al_delay = elements.autopiar.al_delay.v,
			al_active = elements.autopiar.al_active.v
			----------------------------------------
		}
	},file)
end
function imgui.OnDrawFrame()
	----------------------------------------
	onRenderNotification()
	----------------------------------------
	local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
	local windowPosX = getStructElement(input, 0x8, 4)
	local windowPosY = getStructElement(input, 0xC, 4)
	--------------------[CMD хелпер]--------------------
	--sampAddChatMessage(string.format('%s',windows_cmd.v),-1)
	if windows_cmd.v == true then
		local posY = windowPosY + 50
		local posX = windowPosX 
		----------------------------------------
		imgui.SetNextWindowPos(imgui.ImVec2(posX, posY), imgui.Cond.Always)
		----------------------------------------
		imgui.PushStyleColor(imgui.Col.WindowBg, imgui.ImVec4(elements.color_back.v[1], elements.color_back.v[2], elements.color_back.v[3], elements.color_back.v[4]))
		----------------------------------------
		imgui.PushStyleColor(imgui.Col.ScrollbarBg, imgui.ImVec4(elements.color_scroll.v[1], elements.color_scroll.v[2], elements.color_scroll.v[3], elements.color_scroll.v[4]))
		----------------------------------------
		imgui.PushStyleColor(imgui.Col.Text, imgui.ImVec4(elements.color_text.v[1], elements.color_text.v[2], elements.color_text.v[3], elements.color_text.v[4]))
		----------------------------------------
		imgui.PushStyleColor(imgui.Col.HeaderHovered, imgui.ImVec4(elements.color_main.v[1], elements.color_main.v[2], elements.color_main.v[3], elements.color_main.v[4]))
		----------------------------------------
		imgui.Begin('Server Cmds Helper', windows_cmd, imgui.WindowFlags.NoTitleBar + imgui.WindowFlags.NoResize + imgui.WindowFlags.AlwaysAutoResize + imgui.WindowFlags.NoMove + imgui.WindowFlags.NoFocusOnAppearing) 
		----------------------------------------
		local cmd_finds = 0
		if getFullLen(sampGetChatInputText()) ~= nil then
			for i = 1, #cmds do
				if string.find(cmds[i], sampGetChatInputText()) then
					if imgui.Selectable(cmds[i], selected == i, imgui.ImVec2(75, 50)) then
						sampSetChatInputText(cmds[i]..' ') ; windows_cmd.v = false
					end
					cmd_finds = cmd_finds+1
				end
			end
		end
		if cmd_finds == 0 then windows_cmd.v = false end
		----------------------------------------
		imgui.End()
		imgui.PopStyleColor(4)
	end
	--------------------[Калькулятор]--------------------
	if sampIsChatInputActive() and ok then
		imgui.SetNextWindowPos(imgui.ImVec2(windowPosX, windowPosY + 30 + 15), imgui.Cond.FirstUseEver)
		imgui.SetNextWindowSize(imgui.ImVec2(result_calc:len()*10, 30))
		imgui.Begin('Solve', window, imgui.WindowFlags.NoTitleBar + imgui.WindowFlags.NoResize + imgui.WindowFlags.NoMove)
		imgui.CenterText(u8(number_separator(result_calc)))
		imgui.End()
	end
	----------------------------------------
	local sw,sh = getScreenResolution()
	if windowstate.v == true then
		----------------------------------------
		imgui.SetNextWindowPos(imgui.ImVec2(sw/2,sh/3),imgui.Cond.FirstUseEver,imgui.ImVec2(0.5,0.5))
		imgui.SetNextWindowSize(imgui.ImVec2(860,700),imgui.Cond.FirstUseEver)
		imgui.Begin(u8(script_names..' | v'..thisScript().version),windowstate,imgui.WindowFlags.HorizontalScrollbar)
		imgui.BeginGroup()
		----------------------------------------
		if imgui.Button(u8('Сохранить настройки'),imgui.ImVec2(170,20)) then
			saveini()
			sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Настройки успешно сохранены.', 0xFFFFFF)
			push_message('Настройки сохранены!')
		end
		imgui.SameLine()
		----------------------------------------
		if imgui.Button(u8('Перезагрузить скрипт'),imgui.ImVec2(170,20)) then
			thisScript():reload()
		end
		----------------------------------------
		if imgui.Button(u8('Переподключиться (/rec)'),imgui.ImVec2(170,20)) then
			sampDisconnectWithReason(false)
			sampSetGamestate(1)
		end
		imgui.SameLine()
		----------------------------------------
		if imgui.Button(u8('Суицид'),imgui.ImVec2(170,20)) then
			setCharHealth(PLAYER_PED, 0)
			push_message('Покойся с миром!')
		end
		----------------------------------------
		imgui.Text(u8"Основные команды:")
		imgui.Text(u8"/rec - Перезайти на сервер")
		imgui.Text(u8"/rr [текст] - Написать в репорт")
		imgui.Text(u8"/buyvk [1-7] - Включить автопрокачку VK-Coins.")
		imgui.SameLine()
		imgui.TextQuestion(u8'Открываешь BOOST в телефоне,\nвводишь /buyvk [1-7] и скрипт будет автоматически покупать.')
		imgui.Text(u8"/mechanic - Включить автонажатие Alt (выключить - Ctrl + R).")
		imgui.SameLine()
		imgui.TextQuestion(u8'Автоматически нажимает ALT 90 раз.\nПринимаешь заказ механиком вводишь /mechanic и скрипт\nавтоматически нажмет ALT 90 раз. Прервать работу скрипта (Ctrl + R)')
		imgui.Text(u8"/nicks - Включить поиск игроков в зоне стрима")
		imgui.SameLine()
		imgui.TextQuestion(u8'Чтобы отключить введи /nicks ещё раз.')
		imgui.Text(u8"/finds [playerid] - Включить поиск игрока в зоне стрима")
		imgui.SameLine()
		imgui.TextQuestion(u8'Чтобы отключить введи /finds ещё раз.')
		imgui.Text(u8"/olen - Включить поиск оленей в зоне стрима")
		imgui.Text(u8"/ll - Подсветить радиусы переносных лавок")
		imgui.Text(u8"/waxta - Включить поиск руды в зоне стрима")
		imgui.Text(u8"/klad - Включить поиск кладов и открытых багажников")
		imgui.Text(u8"/poisk - Показать места спавна кладов")
		imgui.Text(u8"/loot - Автосбор с мусорки/багажника")
		imgui.SameLine()
		imgui.TextQuestion(u8'Заходишь в мусорку, вводишь /loot и скрипт будет автоматически\nлутать все что появится в первой строчке мусорки.')
		imgui.Text(u8"/rp [playerid] - Автоввод /repare id 1 и /filscar id 1 1")
		imgui.Text(u8"/ud - Использует 3 грамма наркотиков")
		imgui.Text(u8"/ar - Надевает броню")
		imgui.Text(u8"/showid - Показывает ID текстдравов")
		imgui.Text(u8"/showmodel - Показывает MODEL текстдравов")
		imgui.Text(u8"/mclear - Очистить память игры")
		imgui.Text(u8"/price [название] - Посмотреть цену на товар")
		imgui.Text(u8"/pp - Поиск пидоров")
		imgui.Text(u8"/p - Посмотреть пидоров онлайн")
		imgui.Text(u8"/bug - Включить поиск открытых багом багажников")
		imgui.Text(u8"/bugs - Посмотреть список забаганного транспорта")
		imgui.Text(u8"/bugadd [vehicleid] - Добавить транспорт в список забаганных")
		imgui.Text(u8"/bugdel [vehicleid] - Удалить транспорт их списка забаганных")
		----------------------------------------
		imgui.EndGroup()
		imgui.SameLine()
		imgui.BeginGroup()
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки') then
			imgui.Separator()
			imgui.Checkbox(u8('Включить чатлог'),elements.chat.chatlog)
			----------------------------------------
			imgui.Checkbox(u8('Включить время в левом нижнем углу'),elements.config.renderTime)
			----------------------------------------
			imgui.Checkbox(u8('Выключить киллстат'),elements.config.killStat)
			imgui.Checkbox(u8('Включить Health & Armour в цифрах'),elements.config.HealthArmour)
			imgui.Checkbox(u8('Убрать \'Описание\' игроков'),elements.config.del_opisanie_3d)
			imgui.Checkbox(u8('Убрать \'Название семей\' у игроков'),elements.config.del_family_3d)
			imgui.Checkbox(u8('Автоматический /usedrugs 3 при ломке'),elements.config.autousedrugs)
			imgui.Checkbox(u8('Отключение анимации посадки в транспорт у игроков'),elements.config.anim_car)
			----------------------------------------
			imgui.Separator()
			imgui.PushItemWidth(100)
			imgui.InputInt(u8('Кол-во продукции для завозки в бизнесы'),elements.config.prodovoz_edit)
			if elements.config.prodovoz_edit.v > 2000 then
				elements.config.prodovoz_edit.v = 2000
			end
			if elements.config.prodovoz_edit.v < 1 then
				elements.config.prodovoz_edit.v = 1
			end
			imgui.Separator()
			----------------------------------------
			imgui.PushItemWidth(300)
			imgui.SliderInt(u8('Погода'),elements.weather_time.set_weather,0,45)
			forceWeatherNow(elements.weather_time.set_weather.v)
			imgui.Separator()
			----------------------------------------
			imgui.PushItemWidth(300)
			imgui.SliderInt(u8('Время'),elements.weather_time.set_time,0,23)
			setTimeOfDay(elements.weather_time.set_time.v, 0)
			imgui.Separator()
			----------------------------------------
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки автологина') then
			imgui.Separator()
			imgui.InputText(u8('Ник'),elements.account.my_nick)
			imgui.InputText(u8('Пароль'),elements.account.my_password)
			imgui.InputText(u8('Пинкод'),elements.account.my_pincode)
			imgui.Separator()
			imgui.InputText(u8('Ник##2'),elements.account.my_nick_2)
			imgui.InputText(u8('Пароль##2'),elements.account.my_password_2)
			imgui.InputText(u8('Пинкод##2'),elements.account.my_pincode_2)
			imgui.Separator()
			imgui.InputText(u8('Ник##3'),elements.account.my_nick_3)
			imgui.InputText(u8('Пароль##3'),elements.account.my_password_3)
			imgui.InputText(u8('Пинкод##3'),elements.account.my_pincode_3)
			imgui.Separator()
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки CMD хелпера') then
			imgui.ColorEdit4(u8'Фон',elements.color_back,imgui.ColorEditFlags.NoInputs + imgui.ColorEditFlags.AlphaBar)
			imgui.ColorEdit4(u8'Скролл',elements.color_scroll,imgui.ColorEditFlags.NoInputs + imgui.ColorEditFlags.AlphaBar)
			imgui.ColorEdit4(u8'Текст',elements.color_text,imgui.ColorEditFlags.NoInputs + imgui.ColorEditFlags.AlphaBar)
			imgui.ColorEdit4(u8'При наведении',elements.color_main,imgui.ColorEditFlags.NoInputs + imgui.ColorEditFlags.AlphaBar)
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки автопиара') then
			imgui.Separator()
			imgui.PushItemWidth(300)
			imgui.InputText(u8('[/vr] Текст'),elements.autopiar.vr_text)
			imgui.SliderInt(u8('[/vr] Задержка (мин.)'),elements.autopiar.vr_delay,1,60)
			imgui.Checkbox(u8('[/vr] Активировать'),elements.autopiar.vr_active)
			----------------------------------------
			if elements.autopiar.vr_active.v == true then
				if vr_timer < os.time() then
					vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
					sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
				end
			end
			----------------------------------------
			imgui.Separator()
			imgui.InputText(u8('[/fam] Текст'),elements.autopiar.fam_text)
			imgui.SliderInt(u8('[/fam] Задержка (мин.)'),elements.autopiar.fam_delay,1,60)
			imgui.Checkbox(u8('[/fam] Активировать'),elements.autopiar.fam_active)
			----------------------------------------
			if elements.autopiar.fam_active.v == true then
				if fam_timer < os.time() then
					fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
					sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
				end
			end
			----------------------------------------
			imgui.Separator()
			imgui.InputText(u8('[/al] Текст'),elements.autopiar.al_text)
			imgui.SliderInt(u8('[/al] Задержка (мин.)'),elements.autopiar.al_delay,1,60)
			imgui.Checkbox(u8('[/al] Активировать'),elements.autopiar.al_active)
			----------------------------------------
			if elements.autopiar.al_active.v == true then
				if al_timer < os.time() then
					al_timer = os.time()+(elements.autopiar.al_delay.v*60)
					sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
				end
			end
			----------------------------------------
			imgui.Separator()
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки чатов') then
			imgui.Separator()
			if imgui.CollapsingHeader(u8'Сообщения о покупке') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер сообщений о покупке'),elements.chat.renderchatbuy)
				imgui.Checkbox(u8('Отключить в чате сообщения о покупке'),elements.chat.removechatbuy)
				imgui.Checkbox(u8('Выводить сообщения о покупке в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsbuy)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'SPAM сообщения') then
				imgui.Separator()
				imgui.Checkbox(u8('Отключить в чате SPAM сообщения'),elements.chat.removechatspam)
				----------------------------------------
				imgui.SameLine()
				imgui.TextQuestion(u8'1. Удаляет рекламу от сервера.\n2. Удаляет репортажи СМИ (Гость, Репортёр).\n3. Удаляет сообщения News.\n4. Удаляет сообщения /d чата.\n5. Удаляет сообщения в бандах об инкассаторах.\n6. Сообщения о собеседованиях.\n7. Удаляет чат Альянса.\n8. Удаляет сообщения Микрофона.')
				----------------------------------------
				imgui.Checkbox(u8('Выводить SPAM сообщения в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsspam)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Сообщения о подключении/отключении игроков') then
				imgui.Separator()
				imgui.Checkbox(u8('Сообщения о входе игроков'),elements.chat.sendconnect)
				imgui.Checkbox(u8('Сообщения о выходе игроков'),elements.chat.senddisconnect)
				imgui.Checkbox(u8('Сообщения о входе игроков в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsconnect)
				imgui.Checkbox(u8('Сообщения о выходе игроков в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsdisconnect)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки VIP чата') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер вип чата'),elements.chat.rendervipchat)
				imgui.Checkbox(u8('Выводить вип чат в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsvipchat)
				imgui.Checkbox(u8('Отключить вип чат'),elements.chat.removevipchat)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки /j чата') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер /j чата'),elements.chat.renderjobchat)
				imgui.Checkbox(u8('Выводить /j чат в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsjobchat)
				imgui.Checkbox(u8('Отключить /j чат'),elements.chat.removejobchat)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки объявлений (/ad)') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер объявлений'),elements.chat.renderadv)
				imgui.Checkbox(u8('Выводить объявления в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsadv)
				imgui.Checkbox(u8('Отключить объявления'),elements.chat.removeadv)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки дальнего чата') then
				imgui.Separator()
				imgui.Checkbox(u8('Включить дальний чат'),elements.chat.distant_active)
				imgui.PushItemWidth(370)
				imgui.SliderInt(u8('Кол-во строк'),elements.chat.distant_count,3,15)
				imgui.Separator()
			end
			imgui.Separator()
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Удаление мусора с сервера') then
			imgui.Separator()
			imgui.Checkbox(u8('Отключить на сервере \'ковши\''),elements.destroy.bucket)
			imgui.Checkbox(u8('Отключить на сервере \'ёлки\''),elements.destroy.tree)
			imgui.Checkbox(u8('Отключить на сервере \'танцполы\''),elements.destroy.floor)
			imgui.Checkbox(u8('Отключить на сервере \'новогодние подарки\''),elements.destroy.chest)
			imgui.Checkbox(u8('Отключить на сервере \'ёлочные игрушки\''),elements.destroy.game)
			imgui.Checkbox(u8('Отключить на сервере \'огромное сердце\''),elements.destroy.serdce)
			imgui.Checkbox(u8('Отключить на сервере \'новогодний маппинг\''),elements.destroy.newyear)
			imgui.Checkbox(u8('Отключить на сервере \'пасхальный маппинг\''),elements.destroy.pasxa)
			imgui.Checkbox(u8('Отключить на сервере \'хлам\''),elements.destroy.xlam)
			imgui.Separator()
		end
		if imgui.CollapsingHeader(u8'Авто-точилка аксессуаров') then
			imgui.Separator()
			imgui.Checkbox(u8'Включить авто-точилку',elements.autotoch.autotoch_enable)
			imgui.PushItemWidth(200)
			imgui.SliderInt(u8('На сколько будет точится аксессуар'),elements.autotoch.checked_radio,1,12)
			imgui.SliderInt(u8('Выбери страницу инвентаря'),elements.autotoch.checked_inv,1,3)
			imgui.Separator()
		end
		if imgui.CollapsingHeader(u8'Авто-открытие рулеток') then
			imgui.Separator()
			imgui.Checkbox(u8'Бронзовая рулетка',elements.autoopenroul.open_roul_bronze)
			imgui.Checkbox(u8'Серебряная рулетка',elements.autoopenroul.open_roul_silver)
			imgui.Checkbox(u8'Золотая рулетка',elements.autoopenroul.open_roul_gold)
			imgui.Checkbox(u8'Платиновая рулетка',elements.autoopenroul.open_roul_platina)
			----------------------------------------
			if elements.autoopenroul.open_roul_bronze == false and elements.autoopenroul.open_roul_silver == false and elements.autoopenroul.open_roul_gold == false and elements.autoopenroul.open_roul_platina == false then
				elements.autoopenroul.open_roul_active = true
			end
			if elements.autoopenroul.open_roul_bronze == true then
				elements.autoopenroul.open_roul_bronze.v = true
				elements.autoopenroul.open_roul_silver.v = false
				elements.autoopenroul.open_roul_gold.v = false
				elements.autoopenroul.open_roul_platina.v = false
			end
			if elements.autoopenroul.open_roul_silver == true then
				elements.autoopenroul.open_roul_bronze.v = false
				elements.autoopenroul.open_roul_silver.v = true
				elements.autoopenroul.open_roul_gold.v = false
				elements.autoopenroul.open_roul_platina.v = false
			end
			if elements.autoopenroul.open_roul_gold == true then
				elements.autoopenroul.open_roul_bronze.v = false
				elements.autoopenroul.open_roul_silver.v = false
				elements.autoopenroul.open_roul_gold.v = true
				elements.autoopenroul.open_roul_platina.v = false
			end
			if elements.autoopenroul.open_roul_platina == true then
				elements.autoopenroul.open_roul_bronze.v = false
				elements.autoopenroul.open_roul_silver.v = false
				elements.autoopenroul.open_roul_gold.v = false
				elements.autoopenroul.open_roul_platina.v = true
			end
			----------------------------------------
			imgui.Separator()
		end
		if imgui.CollapsingHeader(u8'Авто-скуп в ларьке') then
			imgui.Separator()
			imgui.PushItemWidth(108)
			----------------------------------------
			imgui.InputInt(u8('Цена  ##1'),elements.lavka.drugs_price)
			imgui.SameLine()
			imgui.InputInt(u8('Наркотики (кол-во)'),elements.lavka.drugs)
			if elements.lavka.drugs.v < 0 then elements.lavka.drugs.v = 0 end
			if elements.lavka.drugs_price.v < 0 then elements.lavka.drugs_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##2'),elements.lavka.materials_price)
			imgui.SameLine()
			imgui.InputInt(u8('Материалы (кол-во)'),elements.lavka.materials)
			if elements.lavka.materials.v < 0 then elements.lavka.materials.v = 0 end
			if elements.lavka.materials_price.v < 0 then elements.lavka.materials_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##3'),elements.lavka.fam_talon_price)
			imgui.SameLine()
			imgui.InputInt(u8('Семейный талон (кол-во)'),elements.lavka.fam_talon)
			if elements.lavka.fam_talon.v < 0 then elements.lavka.fam_talon.v = 0 end
			if elements.lavka.fam_talon_price.v < 0 then elements.lavka.fam_talon_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##4'),elements.lavka.cherepa_price)
			imgui.SameLine()
			imgui.InputInt(u8('Черепа (кол-во)'),elements.lavka.cherepa)
			if elements.lavka.cherepa.v < 0 then elements.lavka.cherepa.v = 0 end
			if elements.lavka.cherepa_price.v < 0 then elements.lavka.cherepa_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##5'),elements.lavka.sale_talon_price)
			imgui.SameLine()
			imgui.InputInt(u8('Скидочный талон (кол-во)'),elements.lavka.sale_talon)
			if elements.lavka.sale_talon.v < 0 then elements.lavka.sale_talon.v = 0 end
			if elements.lavka.sale_talon_price.v < 0 then elements.lavka.sale_talon_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##6'),elements.lavka.gift_price)
			imgui.SameLine()
			imgui.InputInt(u8('Подарки (кол-во)'),elements.lavka.gift)
			if elements.lavka.gift.v < 0 then elements.lavka.gift.v = 0 end
			if elements.lavka.gift_price.v < 0 then elements.lavka.gift_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##7'),elements.lavka.cooper_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Бронзовые рулетки (кол-во)'),elements.lavka.cooper_roll)
			if elements.lavka.cooper_roll.v < 0 then elements.lavka.cooper_roll.v = 0 end
			if elements.lavka.cooper_roll_price.v < 0 then elements.lavka.cooper_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##8'),elements.lavka.silver_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Серебрянные рулетки (кол-во)'),elements.lavka.silver_roll)
			if elements.lavka.silver_roll.v < 0 then elements.lavka.silver_roll.v = 0 end
			if elements.lavka.silver_roll_price.v < 0 then elements.lavka.silver_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##9'),elements.lavka.gold_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Золотые рулетки (кол-во)'),elements.lavka.gold_roll)
			if elements.lavka.gold_roll.v < 0 then elements.lavka.gold_roll.v = 0 end
			if elements.lavka.gold_roll_price.v < 0 then elements.lavka.gold_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##10'),elements.lavka.xlopok_price)
			imgui.SameLine()
			imgui.InputInt(u8('Хлопок (кол-во)'),elements.lavka.xlopok)
			if elements.lavka.xlopok.v < 0 then elements.lavka.xlopok.v = 0 end
			if elements.lavka.xlopok_price.v < 0 then elements.lavka.xlopok_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##11'),elements.lavka.lens_price)
			imgui.SameLine()
			imgui.InputInt(u8('Лён (кол-во)'),elements.lavka.lens)
			if elements.lavka.lens.v < 0 then elements.lavka.lens.v = 0 end
			if elements.lavka.lens_price.v < 0 then elements.lavka.lens_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##12'),elements.lavka.stone_price)
			imgui.SameLine()
			imgui.InputInt(u8('Камень (кол-во)'),elements.lavka.stone)
			if elements.lavka.stone.v < 0 then elements.lavka.stone.v = 0 end
			if elements.lavka.stone_price.v < 0 then elements.lavka.stone_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##13'),elements.lavka.metal_price)
			imgui.SameLine()
			imgui.InputInt(u8('Металл (кол-во)'),elements.lavka.metal)
			if elements.lavka.metal.v < 0 then elements.lavka.metal.v = 0 end
			if elements.lavka.metal_price.v < 0 then elements.lavka.metal_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##14'),elements.lavka.bronze_price)
			imgui.SameLine()
			imgui.InputInt(u8('Бронза (кол-во)'),elements.lavka.bronze)
			if elements.lavka.bronze.v < 0 then elements.lavka.bronze.v = 0 end
			if elements.lavka.bronze_price.v < 0 then elements.lavka.bronze_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##15'),elements.lavka.silver_price)
			imgui.SameLine()
			imgui.InputInt(u8('Серебро (кол-во)'),elements.lavka.silver)
			if elements.lavka.silver.v < 0 then elements.lavka.silver.v = 0 end
			if elements.lavka.silver_price.v < 0 then elements.lavka.silver_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##16'),elements.lavka.gold_price)
			imgui.SameLine()
			imgui.InputInt(u8('Золото (кол-во)'),elements.lavka.gold)
			if elements.lavka.gold.v < 0 then elements.lavka.gold.v = 0 end
			if elements.lavka.gold_price.v < 0 then elements.lavka.gold_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##17'),elements.lavka.alyminiu_price)
			imgui.SameLine()
			imgui.InputInt(u8('Алюминий (кол-во)'),elements.lavka.alyminiu)
			if elements.lavka.alyminiu.v < 0 then elements.lavka.alyminiu.v = 0 end
			if elements.lavka.alyminiu_price.v < 0 then elements.lavka.alyminiu_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##18'),elements.lavka.tywka_price)
			imgui.SameLine()
			imgui.InputInt(u8('Тушка оленя (кол-во)'),elements.lavka.tywka)
			if elements.lavka.tywka.v < 0 then elements.lavka.tywka.v = 0 end
			if elements.lavka.tywka_price.v < 0 then elements.lavka.tywka_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##19'),elements.lavka.euro_price)
			imgui.SameLine()
			imgui.InputInt(u8('Евро (кол-во)'),elements.lavka.euro)
			if elements.lavka.euro.v < 0 then elements.lavka.euro.v = 0 end
			if elements.lavka.euro_price.v < 0 then elements.lavka.euro_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##20'),elements.lavka.gr_talon_price)
			imgui.SameLine()
			imgui.InputInt(u8('Гражданский талон (кол-во)'),elements.lavka.gr_talon)
			if elements.lavka.gr_talon.v < 0 then elements.lavka.gr_talon.v = 0 end
			if elements.lavka.gr_talon_price.v < 0 then elements.lavka.gr_talon_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##21'),elements.lavka.antibiotiki_price)
			imgui.SameLine()
			imgui.InputInt(u8('Антибиотики (кол-во)'),elements.lavka.antibiotiki)
			if elements.lavka.antibiotiki.v < 0 then elements.lavka.antibiotiki.v = 0 end
			if elements.lavka.antibiotiki_price.v < 0 then elements.lavka.antibiotiki_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##22'),elements.lavka.prison_price)
			imgui.SameLine()
			imgui.InputInt(u8('Отмычки от ТСР (кол-во)'),elements.lavka.prison)
			if elements.lavka.prison.v < 0 then elements.lavka.prison.v = 0 end
			if elements.lavka.prison_price.v < 0 then elements.lavka.prison_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##23'),elements.lavka.zlov_moneta_price)
			imgui.SameLine()
			imgui.InputInt(u8('Зловещая монета (кол-во)'),elements.lavka.zlov_moneta)
			if elements.lavka.zlov_moneta.v < 0 then elements.lavka.zlov_moneta.v = 0 end
			if elements.lavka.zlov_moneta_price.v < 0 then elements.lavka.zlov_moneta_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##24'),elements.lavka.toch_stone_price)
			imgui.SameLine()
			imgui.InputInt(u8('Точильные камни (кол-во)'),elements.lavka.toch_stone)
			if elements.lavka.toch_stone.v < 0 then elements.lavka.toch_stone.v = 0 end
			if elements.lavka.toch_stone_price.v < 0 then elements.lavka.toch_stone_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##25'),elements.lavka.bilet_6_price)
			imgui.SameLine()
			imgui.InputInt(u8('Билет 6 годовщины (кол-во)'),elements.lavka.bilet_6)
			if elements.lavka.bilet_6.v < 0 then elements.lavka.bilet_6.v = 0 end
			if elements.lavka.bilet_6_price.v < 0 then elements.lavka.bilet_6_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##26'),elements.lavka.sticker_cluck_price)
			imgui.SameLine()
			imgui.InputInt(u8('Стикер Cluckin Bell (кол-во)'),elements.lavka.sticker_cluck)
			if elements.lavka.sticker_cluck.v < 0 then elements.lavka.sticker_cluck.v = 0 end
			if elements.lavka.sticker_cluck_price.v < 0 then elements.lavka.sticker_cluck_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##27'),elements.lavka.sticker_binko_price)
			imgui.SameLine()
			imgui.InputInt(u8('Стикер Binko (кол-во)'),elements.lavka.sticker_binko)
			if elements.lavka.sticker_binko.v < 0 then elements.lavka.sticker_binko.v = 0 end
			if elements.lavka.sticker_binko_price.v < 0 then elements.lavka.sticker_binko_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##28'),elements.lavka.sticker_jizzy_price)
			imgui.SameLine()
			imgui.InputInt(u8('Стикер Jizzy (кол-во)'),elements.lavka.sticker_jizzy)
			if elements.lavka.sticker_jizzy.v < 0 then elements.lavka.sticker_jizzy.v = 0 end
			if elements.lavka.sticker_jizzy_price.v < 0 then elements.lavka.sticker_jizzy_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##29'),elements.lavka.platinum_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Платиновая рулетка (кол-во)'),elements.lavka.platinum_roll)
			if elements.lavka.platinum_roll.v < 0 then elements.lavka.platinum_roll.v = 0 end
			if elements.lavka.platinum_roll_price.v < 0 then elements.lavka.platinum_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##30'),elements.lavka.rare_yellow_price)
			imgui.SameLine()
			imgui.InputInt(u8('Rare Box Yellow (кол-во)'),elements.lavka.rare_yellow)
			if elements.lavka.rare_yellow.v < 0 then elements.lavka.rare_yellow.v = 0 end
			if elements.lavka.rare_yellow_price.v < 0 then elements.lavka.rare_yellow_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##31'),elements.lavka.rare_red_price)
			imgui.SameLine()
			imgui.InputInt(u8('Rare Box Red (кол-во)'),elements.lavka.rare_red)
			if elements.lavka.rare_red.v < 0 then elements.lavka.rare_red.v = 0 end
			if elements.lavka.rare_red_price.v < 0 then elements.lavka.rare_red_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##32'),elements.lavka.rare_blue_price)
			imgui.SameLine()
			imgui.InputInt(u8('Rare Box Blue (кол-во)'),elements.lavka.rare_blue)
			if elements.lavka.rare_blue.v < 0 then elements.lavka.rare_blue.v = 0 end
			if elements.lavka.rare_blue_price.v < 0 then elements.lavka.rare_blue_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##33'),elements.lavka.box_marvel_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик \'Marvel\' (кол-во)'),elements.lavka.box_marvel)
			if elements.lavka.box_marvel.v < 0 then elements.lavka.box_marvel.v = 0 end
			if elements.lavka.box_marvel_price.v < 0 then elements.lavka.box_marvel_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##34'),elements.lavka.box_djent_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик \'Джентельменов\' (кол-во)'),elements.lavka.box_djent)
			if elements.lavka.box_djent.v < 0 then elements.lavka.box_djent.v = 0 end
			if elements.lavka.box_djent_price.v < 0 then elements.lavka.box_djent_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##35'),elements.lavka.box_minecraft_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик \'Minecraft\' (кол-во)'),elements.lavka.box_minecraft)
			if elements.lavka.box_minecraft.v < 0 then elements.lavka.box_minecraft.v = 0 end
			if elements.lavka.box_minecraft_price.v < 0 then elements.lavka.box_minecraft_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##36'),elements.lavka.box_moto_price)
			imgui.SameLine()
			imgui.InputInt(u8('Супер мото-ящик (кол-во)'),elements.lavka.box_moto)
			if elements.lavka.box_moto.v < 0 then elements.lavka.box_moto.v = 0 end
			if elements.lavka.box_moto_price.v < 0 then elements.lavka.box_moto_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##37'),elements.lavka.box_car_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик авто-ящик (кол-во)'),elements.lavka.box_car)
			if elements.lavka.box_car.v < 0 then elements.lavka.box_car.v = 0 end
			if elements.lavka.box_car_price.v < 0 then elements.lavka.box_car_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##38'),elements.lavka.box_nostalg_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ностальгический ящик (кол-во)'),elements.lavka.box_nostalg)
			if elements.lavka.box_nostalg.v < 0 then elements.lavka.box_nostalg.v = 0 end
			if elements.lavka.box_nostalg_price.v < 0 then elements.lavka.box_nostalg_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##39'),elements.lavka.band_respect_price)
			imgui.SameLine()
			imgui.InputInt(u8('Бандитские респекты (кол-во)'),elements.lavka.band_respect)
			if elements.lavka.band_respect.v < 0 then elements.lavka.band_respect.v = 0 end
			if elements.lavka.band_respect_price.v < 0 then elements.lavka.band_respect_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##40'),elements.lavka.larec_premium_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ларец с премией (кол-во)'),elements.lavka.larec_premium)
			if elements.lavka.larec_premium.v < 0 then elements.lavka.larec_premium.v = 0 end
			if elements.lavka.larec_premium_price.v < 0 then elements.lavka.larec_premium_price.v = 0 end
			----------------------------------------
			count_all = 0
			if elements.lavka.drugs.v ~= 0 then
				count_all = count_all+(elements.lavka.drugs_price.v*elements.lavka.drugs.v)
			end
			if elements.lavka.materials.v ~= 0 then
				count_all = count_all+(elements.lavka.materials_price.v*elements.lavka.materials.v)
			end
			if elements.lavka.fam_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.fam_talon_price.v*elements.lavka.fam_talon.v)
			end
			if elements.lavka.cherepa.v ~= 0 then
				count_all = count_all+(elements.lavka.cherepa_price.v*elements.lavka.cherepa.v)
			end
			if elements.lavka.sale_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.sale_talon_price.v*elements.lavka.sale_talon.v)
			end
			if elements.lavka.gift.v ~= 0 then
				count_all = count_all+(elements.lavka.gift_price.v*elements.lavka.gift.v)
			end
			if elements.lavka.cooper_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.cooper_roll_price.v*elements.lavka.cooper_roll.v)
			end
			if elements.lavka.silver_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.silver_roll_price.v*elements.lavka.silver_roll.v)
			end
			if elements.lavka.gold_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.gold_roll_price.v*elements.lavka.gold_roll.v)
			end
			if elements.lavka.xlopok.v ~= 0 then
				count_all = count_all+(elements.lavka.xlopok_price.v*elements.lavka.xlopok.v)
			end
			if elements.lavka.lens.v ~= 0 then
				count_all = count_all+(elements.lavka.lens_price.v*elements.lavka.lens.v)
			end
			if elements.lavka.stone.v ~= 0 then
				count_all = count_all+(elements.lavka.stone_price.v*elements.lavka.stone.v)
			end
			if elements.lavka.metal.v ~= 0 then
				count_all = count_all+(elements.lavka.metal_price.v*elements.lavka.metal.v)
			end
			if elements.lavka.bronze.v ~= 0 then
				count_all = count_all+(elements.lavka.bronze_price.v*elements.lavka.bronze.v)
			end
			if elements.lavka.silver.v ~= 0 then
				count_all = count_all+(elements.lavka.silver_price.v*elements.lavka.silver.v)
			end
			if elements.lavka.gold.v ~= 0 then
				count_all = count_all+(elements.lavka.gold_price.v*elements.lavka.gold.v)
			end
			if elements.lavka.alyminiu.v ~= 0 then
				count_all = count_all+(elements.lavka.alyminiu_price.v*elements.lavka.alyminiu.v)
			end
			if elements.lavka.tywka.v ~= 0 then
				count_all = count_all+(elements.lavka.tywka_price.v*elements.lavka.tywka.v)
			end
			if elements.lavka.euro.v ~= 0 then
				count_all = count_all+(elements.lavka.euro_price.v*elements.lavka.euro.v)
			end
			if elements.lavka.gr_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.gr_talon_price.v*elements.lavka.gr_talon.v)
			end
			if elements.lavka.antibiotiki.v ~= 0 then
				count_all = count_all+(elements.lavka.antibiotiki_price.v*elements.lavka.antibiotiki.v)
			end
			if elements.lavka.prison.v ~= 0 then
				count_all = count_all+(elements.lavka.prison_price.v*elements.lavka.prison.v)
			end
			if elements.lavka.zlov_moneta.v ~= 0 then
				count_all = count_all+(elements.lavka.zlov_moneta_price.v*elements.lavka.zlov_moneta.v)
			end
			if elements.lavka.toch_stone.v ~= 0 then
				count_all = count_all+(elements.lavka.toch_stone_price.v*elements.lavka.toch_stone.v)
			end
			if elements.lavka.bilet_6.v ~= 0 then
				count_all = count_all+(elements.lavka.bilet_6_price.v*elements.lavka.bilet_6.v)
			end
			if elements.lavka.sticker_cluck.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_cluck_price.v*elements.lavka.sticker_cluck.v)
			end
			if elements.lavka.sticker_binko.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_binko_price.v*elements.lavka.sticker_binko.v)
			end
			if elements.lavka.sticker_jizzy.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_jizzy_price.v*elements.lavka.sticker_jizzy.v)
			end
			if elements.lavka.platinum_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.platinum_roll_price.v*elements.lavka.platinum_roll.v)
			end
			if elements.lavka.rare_yellow.v ~= 0 then
				count_all = count_all+(elements.lavka.rare_yellow_price.v*elements.lavka.rare_yellow.v)
			end
			if elements.lavka.rare_red.v ~= 0 then
				count_all = count_all+(elements.lavka.rare_red_price.v*elements.lavka.rare_red.v)
			end
			if elements.lavka.rare_blue.v ~= 0 then
				count_all = count_all+(elements.lavka.rare_blue_price.v*elements.lavka.rare_blue.v)
			end
			if elements.lavka.box_marvel.v ~= 0 then
				count_all = count_all+(elements.lavka.box_marvel_price.v*elements.lavka.box_marvel.v)
			end
			if elements.lavka.box_djent.v ~= 0 then
				count_all = count_all+(elements.lavka.box_djent_price.v*elements.lavka.box_djent.v)
			end
			if elements.lavka.box_minecraft.v ~= 0 then
				count_all = count_all+(elements.lavka.box_minecraft_price.v*elements.lavka.box_minecraft.v)
			end
			if elements.lavka.box_moto.v ~= 0 then
				count_all = count_all+(elements.lavka.box_moto_price.v*elements.lavka.box_moto.v)
			end
			if elements.lavka.box_car.v ~= 0 then
				count_all = count_all+(elements.lavka.box_car_price.v*elements.lavka.box_car.v)
			end
			if elements.lavka.box_nostalg.v ~= 0 then
				count_all = count_all+(elements.lavka.box_nostalg_price.v*elements.lavka.box_nostalg.v)
			end
			if elements.lavka.band_respect.v ~= 0 then
				count_all = count_all+(elements.lavka.band_respect_price.v*elements.lavka.band_respect.v)
			end
			if elements.lavka.larec_premium.v ~= 0 then
				count_all = count_all+(elements.lavka.larec_premium_price.v*elements.lavka.larec_premium.v)
			end
			imgui.Text('')
			imgui.Text(u8('Для покупки всех товаров необходимо $'..count_all))
			if count_all > getPlayerMoney(Player) then
				imgui.TextColoredRGB(u8('{FF3300}Тебе нехватает $'..count_all-getPlayerMoney(Player)))
			end
			if imgui.Button(u8"Начать скупку",imgui.ImVec2(250,25)) then
				skupka()
				windowstate.v = not windowstate.v
			end
			imgui.Separator()
		end
		----------------------------------------
		imgui.Separator()
		imgui.PushItemWidth(90)
		imgui.InputInt(u8('Своровать модификацию с указанного ID'),elements.config.attach_id)
		if elements.config.attach_id.v < 0 or elements.config.attach_id.v > 1001 then
			elements.config.attach_id.v = 1001
		end
		imgui.Separator()
		----------------------------------------
		imgui.Checkbox(u8('Открывать стандартный сундук'),elements.chest.roll_standart)
		imgui.Checkbox(u8('Открывать платиновый сундук'),elements.chest.roll_platinum)
		imgui.Checkbox(u8('Открывать тайник Маска'),elements.chest.roll_maska)
		----------------------------------------
		imgui.PushItemWidth(81)
		imgui.InputInt(u8('Задержка в мин.'),elements.chest.roll_wait)
		if elements.chest.roll_wait.v < 1 then elements.chest.roll_wait.v = 1 end
		----------------------------------------
		if imgui.Checkbox(u8('Открывать сундуки'),elements.chest.roll_state) then
			if elements.chest.roll_state.v == true then
				windowstate.v = not windowstate.v
				lua_thread.create(function()
					if elements.chest.roll_standart.v == true then
						sampSendClickTextdraw(65535)
						active = true
						sampSendChat("/invent")
						wait(2500)
					end
					if elements.chest.roll_platinum.v == true then
						sampSendClickTextdraw(65535)
						wait(355)
						active2 = true
						sampSendChat("/invent")
						wait(2500)
					end
					if elements.chest.roll_maska.v == true then
						sampSendClickTextdraw(65535)
						wait(355)
						active3 = true
						sampSendChat("/invent")
						wait(2500)
					end
				end)
			end
		end
		imgui.Separator()
		----------------------------------------
		imgui.Checkbox(u8('Выключить игроков в зоне стрима'),elements.config.del_stream_pl)
		imgui.SameLine()
		imgui.TextQuestion(u8'Отключает появление ИГРОКОВ в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		if imgui.Checkbox(u8('Выключить обновление зоны стрима'),elements.config.del_stream) then
			if elements.config.del_stream.v == true then
				elements.config.del_shout.v = true
			end
			if elements.config.del_stream.v == false then
				elements.config.del_shout.v = false
			end
		end
		imgui.SameLine()
		----------------------------------------
		imgui.TextQuestion(u8'Отключает появление игроков и транспорта в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		imgui.SameLine()
		imgui.Checkbox(u8('Выключить /s чат'),elements.config.del_shout)
		----------------------------------------
		imgui.EndGroup()
		imgui.Separator()
		imgui.CenterTextColored(u8('{FDDB6D}Лог'))
		imgui.Separator()
		imgui.BeginChild('rendertextimguifam',imgui.ImVec2(imgui.GetWindowSize().x - 20,imgui.GetWindowSize().y - 110),true, imgui.WindowFlags.HorizontalScrollbar)
		if #chatMessages > 0  then
			local clipper = imgui.ImGuiListClipper(#chatMessages)
			while clipper:Step() do
				for i = clipper.DisplayStart + 1, clipper.DisplayEnd do
					imgui.TextColoredRGB(u8(chatMessages[i]))
				end
			end
		else
			imgui.CenterWindowText(u8('Пустота...'),imgui.TextDisabled)
		end
		imgui.EndChild()
		imgui.End()
	end
end

function sampev.onSendClickTextDraw(textdrawId)
	if elements.state.showmodel == true then
		model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(textdrawId)
		if model ~= 0 and model ~= 65535 then
			sampAddChatMessage(string.format('Model: %d | Rotation: %0.6f, %0.6f, %0.6f, %0.6f',model,rotX,rotY,rotZ,zoom),0xFF3300)
		end
	end
end

function sampev.onShowTextDraw(textdrawId, data)
	--if elements.config.anim_car.v == true then
		--if data.text:find('+1') or data.text:find('+2') or data.text:find('+3') or data.text:find('+4') or data.text:find('+5') or data.text:find('+6') or data.text:find('+7') or data.text:find('+8') or data.text:find('+9') or data.text:find('+10') or data.text:find('+11') then 
		--	data.text = '+12'
		--end
	--end
	if data.modelId == 1649 then
		--------------------[Первая строка]--------------------
		if data.position.x == 184.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 1 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 2 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 3 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 4 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 5 then
			elements.state.autoloot_number = 0
			--------------------[Вторая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 6 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 7 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 8 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 9 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 10 then
			elements.state.autoloot_number = 0
		--------------------[Третья строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 11 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 12 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 13 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 14 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 15 then
			elements.state.autoloot_number = 0
		--------------------[Четвертая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 16 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 17 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 18 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 19 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 20 then
			elements.state.autoloot_number = 0
		--------------------[Пятая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 21 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 22 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 23 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 24 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 25 then
			elements.state.autoloot_number = 0
		--------------------[Шестая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 26 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 27 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 28 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 29 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 30 then
			elements.state.autoloot_number = 0
		end
	end
	--------------------[Первая строка]--------------------
	if data.position.x == 209 and math.floor(data.position.y) == 186 then
		autoloot_td[1] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 186 then
		autoloot_td[2] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 186 then
		autoloot_td[3] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 186 then
		autoloot_td[4] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 186 then
		autoloot_td[5] = data.text
	--------------------[Вторая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 217 then
		autoloot_td[6] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 217 then
		autoloot_td[7] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 217 then
		autoloot_td[8] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 217 then
		autoloot_td[9] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 217 then
		autoloot_td[10] = data.text
	--------------------[Третья строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 247 then
		autoloot_td[11] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 247 then
		autoloot_td[12] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 247 then
		autoloot_td[13] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 247 then
		autoloot_td[14] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 247 then
		autoloot_td[15] = data.text
	--------------------[Четвертая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 278 then
		autoloot_td[16] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 278 then
		autoloot_td[17] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 278 then
		autoloot_td[18] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 278 then
		autoloot_td[19] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 278 then
		autoloot_td[20] = data.text
	--------------------[Пятая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 308 then
		autoloot_td[21] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 308 then
		autoloot_td[22] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 308 then
		autoloot_td[23] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 308 then
		autoloot_td[24] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 308 then
		autoloot_td[25] = data.text
	--------------------[Шестая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 339 then
		autoloot_td[26] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 339 then
		autoloot_td[27] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 339 then
		autoloot_td[28] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 339 then
		autoloot_td[29] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 339 then
		autoloot_td[30] = data.text
	end
	--------------------[Прочее]--------------------
	if data.modelId == 338 then
		sampAddChatMessage("Кий на спину (338) - Если дешево стоит - то купить.", 0xFF3300)
	end
	if data.modelId == 842 then
		sampAddChatMessage("Палки (842) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 1487 then
		sampAddChatMessage("Бутылка на спину (1487) - Если дешево стоит - то купить.", 0xFF3300)
	end
	if data.modelId == 1562 then
		sampAddChatMessage("Кресло на спину (1562) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 2168 then
		sampAddChatMessage("Коробка на спину (2168) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 2237 then
		sampAddChatMessage("Копье (2237) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 3434 then
		sampAddChatMessage("Черепа на спину (3434) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 3524 then
		sampAddChatMessage("Череп на голову (3524) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 11705 then
		sampAddChatMessage("Оружейный кейс (11705) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 11726 then
		sampAddChatMessage("Люстра на спину (11726) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 18636 then
		sampAddChatMessage("Кепка Police (18636) - Если дешево стоит - то купить.", 0xFF3300)
	end
	if data.modelId == 18640 then
		sampAddChatMessage("Борода (18640) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 18782 then
		sampAddChatMessage("Печенька на голову (18782) - Если дешево стоит - то купить.", 0xFF3300)
	end
	if data.modelId == 19086 then
		sampAddChatMessage(string.format("Маска робота (19086) - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFF3300)
	end
	if data.modelId == 19137 then
		sampAddChatMessage("Гребень (19137) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 19592 then
		sampAddChatMessage("Корзина (19592) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	if data.modelId == 19621 then
		sampAddChatMessage("Канистра на бедро (19621) - Если дешево стоит - то купить.", 0xFF3300)
	end
	if data.modelId == 19893 then
		sampAddChatMessage("Карта на спину (19893) - заскринить название предмета! (/showmodel)", 0xFF3300)
	end
	--------------------[Помощь на заводе]--------------------
	if getActiveInterior() == 2 then
		if data.modelId == 7891 or data.modelId == 18644 then
			sampSendClickTextdraw(textdrawId)
		end
	end
	--------------------[Авто-точилка аксессуаров]--------------------
	if data.modelId == 16112 or data.modelId == 1615 then
		if elements.autotoch.autotoch_active then
			lua_thread.create(function()
				if textdrawId ~= 2108 and elements.autotoch.autotoch_active == true then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					wait(500)
					sampSendClickTextdraw(2077)
					elements.autotoch.autotoch_active = false
				else
					wait(500)
					sampSendClickTextdraw(2077)
					elements.autotoch.autotoch_active = false
				end
			end)
		end
	end
	--------------------[Авто-открытие сундуков]--------------------
	ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" then
		if elements.chest.roll_state.v == true and active then
			lua_thread.create(function()
				if data.modelId == 19918 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use then
					sampSendClickTextdraw(textdrawId + 1)
					use = false
					close = true
				end
				if close then
					sampSendClickTextdraw(65535)
					close = false
					active = false
				end
			end)
		end
		----------------------------------------
		if elements.chest.roll_state.v == true and active2 then
			lua_thread.create(function()
				if data.modelId == 1353 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use2 = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use2 then
					sampSendClickTextdraw(textdrawId + 1)
					use2 = false
					close2 = true
				end
				if close2 then
					sampSendClickTextdraw(65535)
					close2 = false
					active2 = false
				end
			end)
		end
		----------------------------------------
		if elements.chest.roll_state.v == true and active3 then
			lua_thread.create(function()
				if data.modelId == 1733 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use3 = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use3 then
					sampSendClickTextdraw(textdrawId + 1)
					use3 = false
					close3 = true
				end
				if close3 then
					sampSendClickTextdraw(65535)
					close3 = false
					active3 = false
				end
			end)
		end
		----------------------------------------
	end
	--------------------[Удаление текстдравов]--------------------
	if data.position.x == 34 and data.position.y == 230 then
		return false
	end
	if data.position.x == 37 and data.position.y == 233 then
		return false
	end
	if data.position.x == 39 and data.position.y == 235 then
		return false
	end
	if data.position.x == 18 and data.position.y == 182 then
		return false
	end
	if data.position.x == 66 and data.position.y == 232 then
		return false
	end
	if data.position.x == 66 and data.position.y == 240 then
		return false
	end
	if data.position.x == 79 and data.position.y == 248 then
		return false
	end
	if data.position.x == 85 and data.position.y == 256 then
		return false
	end
	----------------------------------------
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 32 and data.position.y == 204 then
		return false
	end
	if data.position.x == -8 and data.position.y == 198 then
		return false
	end
	if data.position.x == 70 and data.position.y == 204 then
		return false
	end
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 71 and data.position.y == 215 then
		return false
	end
	if data.position.x == 72 and data.position.y == 224 then
		return false
	end
	----------------------------------------
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 32 and data.position.y == 204 then
		return false
	end
	if data.position.x == 36 and data.position.y == 208 then
		return false
	end
	if data.position.x == -9 and data.position.y == 198 then
		return false
	end
	if data.position.x == 74 and data.position.y == 204 then
		return false
	end
	if data.position.x == 74 and data.position.y == 215 then
		return false
	end
	if data.position.x == 74 and data.position.y == 224 then
		return false
	end
	--------------------[Стиллер текстдравов]--------------------
	ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" then
		if elements.state.stealer_td == true and data.modelId ~= 0 and data.modelId ~= 1649 then
			if (data.modelId >= 0 and data.modelId <= 311) or  -- Скины
				--data.modelId == 321 or -- Дилдо на спину #1
				data.modelId == 322 or -- Дилдо на спину #2
				data.modelId == 324 or -- Рюкзак мотор и модификация Дарт-вейдер
				data.modelId == 326 or -- Трость
				data.modelId == 328 or -- Бордовый чемодан
				data.modelId == 331 or -- Кастет
				data.modelId == 333 or -- Клюшка для гольфа
				data.modelId == 336 or -- Бита на спину
				data.modelId == 337 or -- Лопата на спину
				data.modelId == 338 or -- Кий на спину
				data.modelId == 339 or -- Катана на спину и Расомаха
				data.modelId == 346 or -- Colt 45
				data.modelId == 347 or -- Silenced 9mm
				data.modelId == 348 or -- Desert Eagle
				data.modelId == 349 or -- Shotgun
				data.modelId == 352 or -- Micro Uzi
				data.modelId == 353 or -- MP5
				data.modelId == 355 or -- AK-47
				data.modelId == 356 or -- M4
				data.modelId == 357 or -- Country Rifle
				data.modelId == 358 or -- Sniper Rifle
				data.modelId == 361 or -- Огнемёт на спину
				data.modelId == 362 or -- Миниган на спину
				data.modelId == 372 or -- Tec-9
				(data.modelId >= 400 and data.modelId <= 611) or -- Транспорт
				data.modelId == 701 or -- Адская трава (игровой ресурс)
				data.modelId == 826 or -- Хлопок
				data.modelId == 841 or -- Проклятое дерево
				data.modelId == 854 or -- Мусор
				data.modelId == 859 or -- Счастливая травка
				data.modelId == 859 or -- Счастливая травка
				data.modelId == 871 or -- Лен
				data.modelId == 888 or -- Язык Венома
				data.modelId == 902 or -- Ледяная звезда
				data.modelId == 953 or -- Крылья ангела
				data.modelId == 954 or -- Рога оленя и Лук Купидона
				data.modelId == 962 or -- Видеокарта
				data.modelId == 1013 or -- Ушки бэтмена
				data.modelId == 1114 or -- Очки сварщика
				data.modelId == 1210 or -- Коричневый чемодан
				data.modelId == 1212 or -- Пачка денег на спину и Евро
				data.modelId == 1271 or -- Rare Box Yellow
				data.modelId == 1276 or -- Часть от амулета
				data.modelId == 1277 or -- Талон +1 Exp
				data.modelId == 1304 or -- Металл
				data.modelId == 1319 or -- Жезл ГАИ
				data.modelId == 1328 or -- Платиновая рулетка
				data.modelId == 1335 or -- Ностальгический ящик
				data.modelId == 1353 or -- Сундук платиновой рулетки
				data.modelId == 1366 or -- Щит
				data.modelId == 1371 or -- Рюкзак Бегемот
				data.modelId == 1387 or -- Крюк пирата
				data.modelId == 1453 or -- Шкура оленя
				data.modelId == 1455 or -- Семена дерева Бобровые
				data.modelId == 1463 or -- Дрова
				data.modelId == 1486 or -- Пиво
				data.modelId == 1547 or -- Сертификат на подарок
				data.modelId == 1548 or -- Золотые погоны
				data.modelId == 1549 or -- Смазка для разгона видеокарты
				data.modelId == 1554 or -- Черви
				data.modelId == 1565 or -- Корона (1)
				data.modelId == 1570 or -- Рюкзак для ларьков
				data.modelId == 1575 or -- Белый пакет с наркотиками на спину
				data.modelId == 1599 or -- Золотая рыбка
				data.modelId == 1601 or -- Молнии Зевса
				data.modelId == 1603 or -- Кровавая накидка & Золотая шапка
				data.modelId == 1607 or -- Дельфин на спину
				data.modelId == 1609 or -- Черепаха на спину
				data.modelId == 1615 or -- Точильный амулет
				data.modelId == 1622 or -- Регистратор на плечо
				data.modelId == 1650 or -- Канистра (/fillcar)
				data.modelId == 1672 or -- Баллончик с краской & Supply Signal
				data.modelId == 1681 or -- Реактивный ранец (2)
				data.modelId == 1733 or -- Тайник Илона Маска
				data.modelId == 1749 or -- Ящик Джентельменов
				(data.modelId == 1895 and data.rotation.x == 0 and data.rotation.y == 0 and data.rotation.z == 0 and data.zoom == 1.934306) or -- Серебрянная рулетка
				data.modelId == 1885 or -- Корзины за спиной
				data.modelId == 1886 or -- Маска робота (1)
				data.modelId == 1956 or -- Бандитский респект
				data.modelId == 1971 or -- Рецепт адреналина
				data.modelId == 1979 or -- Бронзовая рулетка
				data.modelId == 2045 or -- Бита с шипами
				data.modelId == 2060 or -- Ингредиенты
				data.modelId == 2102 or -- Колонка на спину
				data.modelId == 2186 or -- Техно рюкзак
				data.modelId == 2219 or -- Комплексный обед
				data.modelId == 2226 or -- Бумбокс
				data.modelId == 2250 or -- Цветок
				data.modelId == 2362 or -- Переносная лавка
				data.modelId == 2386 or -- Скин
				data.modelId == 2401 or -- Одежда из секонд-хенда
				(data.modelId >= 2404 and data.modelId <= 2406) or -- Доска для серфинга
				data.modelId == 2429 or -- Реактивный ранец (3)
				data.modelId == 2456 or -- Стикер Cluckin Bell
				data.modelId == 2487 or -- Модификация: Соник
				data.modelId == 2587 or -- Стикер Verona
				data.modelId == 2601 or -- Спранк
				data.modelId == 2663 or -- Чипсы
				data.modelId == 2680 or -- Замок для велосипеда
				data.modelId == 2684 or -- Лицензии
				data.modelId == 2693 or -- Стикер Alhambra
				data.modelId == 2705 or -- Рваная футболка
				data.modelId == 2709 or -- Таблетки от наркозависимости
				data.modelId == 2712 or -- Метла на спину
				data.modelId == 2714 or -- Табличка 'OPEN' на спину
				data.modelId == 2719 or -- Стикер Jizzy
				data.modelId == 2722 or -- Стикер Binko
				data.modelId == 2790 or -- Алюминий
				data.modelId == 2798 or -- Улучшенная часть КПП
				data.modelId == 2803 or -- Мешок с подарками
				data.modelId == 2806 or -- Сырое мясо оленины
				data.modelId == 2814 or -- Пицца
				data.modelId == 2844 or -- Рваные штаны
				data.modelId == 2894 or -- Телефонная книга и пропуск в тир
				data.modelId == 2918 or -- Ведро в руку
				data.modelId == 2936 or -- Бронза
				data.modelId == 2953 or -- Лотерейный билет
				data.modelId == 2976 or -- Реактивный ранец (4)
				data.modelId == 2977 or -- Супер мото-ящик
				data.modelId == 2985 or -- Экзоскилет
				data.modelId == 2988 or -- Сундук за спиной
				data.modelId == 2992 or -- Ангельский сет и обручальное кольцо
				data.modelId == 3003 or -- Куриное яйцо (пасха)
				data.modelId == 3013 or -- Ящик за спиной
				data.modelId == 3027 or -- Самокрутка на спину
				data.modelId == 3053 or -- Дрифт-монета & Монета 6-ой годовщины
				data.modelId == 3056 or -- Магнит на спину & Инопланетная пушка
				--data.modelId == 3070 or -- Модификация: Киборг
				data.modelId == 3243 or -- Модификация: Индеец
				data.modelId == 3259 or -- Улучшенная часть двигателя
				data.modelId == 3273 or -- Ранец охотники на приведений
				data.modelId == 3440 or -- Очки переливающиеся
				data.modelId == 3528 or -- Ранец огненный дракон и Сет Дракона
				data.modelId == 3658 or -- Гармошка
				data.modelId == 3801 or -- Длинный топор
				data.modelId == 3929 or -- Камень
				data.modelId == 3930 or -- Камень пространства
				data.modelId == 5777 or -- Модификация: Смерть
				data.modelId == 6865 or -- Маска с рогами
				data.modelId == 7093 or -- Рюкзак 'Erotic'
				data.modelId == 7302 or -- Стикер Victim
				data.modelId == 7313 or -- Ранец радио
				data.modelId == 7392 or -- Девушка на спину
				data.modelId == 8644 or -- Два кинжала на спину
				data.modelId == 10281 or -- Машина из стены
				data.modelId == 10757 or -- Самолёт за спиной
				data.modelId == 11700 or -- Модификация Химик
				data.modelId == 11705 or -- Оружейный кейс
				data.modelId == 11722 or -- Краситель
				data.modelId == 11736 or -- Антибиотики и маска от короновируса
				data.modelId == 11738 or -- Аптечка
				data.modelId == 11745 or -- Сумка для ноутбука
				data.modelId == 11748 or -- Скрепки
				data.modelId == 11750 or -- VR-очки и моноколь
				data.modelId == 13646 or -- Золотая рулетка
				data.modelId == 13667 or -- Маска обезьяны
				data.modelId == 14467 or -- Человечек на плечо
				data.modelId == 14527 or -- Крылья стрекозы
				data.modelId == 14611 or -- Корона (2)
				data.modelId == 16112 or -- Точильный камень
				data.modelId == 16368 or -- Красная шляпа
				data.modelId == 16776 or -- Петух на плечо
				data.modelId == 16778 or -- НЛО на плечо
				data.modelId == 17027 or -- Серебро
				data.modelId == 18632 or -- Удочка
				data.modelId == 18633 or -- Балонный ключ на спину
				data.modelId == 18634 or -- Лом на спину
				data.modelId == 18635 or -- Молоток на спину
				data.modelId == 18636 or -- Кепка Police чёрная
				data.modelId == 18637 or -- Щит на спину
				data.modelId == 18638 or -- Каска строителя
				data.modelId == 18641 or -- Маска фонарь
				data.modelId == 18642 or -- Ранец шокер & Копье-шокер
				data.modelId == 18643 or -- Красная шляпа маяк
				data.modelId == 18782 or -- Печенька на голову
				(data.modelId >= 18865 and data.modelId <= 18874) or -- Телефоны
				data.modelId == 18875 or -- ПипБой & Радио
				data.modelId == 18848 or -- Военный реактивный ранец
				data.modelId == 18890 or -- Грабли на спину
				data.modelId == 18893 or -- Рваная бандана
				(data.modelId >= 18906 and data.modelId <= 18910) or -- Бандана на голову
				(data.modelId >= 18911 and data.modelId <= 18920) or -- Бандана, 18919 - Рваная повязка
				(data.modelId >= 18921 and data.modelId <= 18925) or -- Берет
				(data.modelId >= 18926 and data.modelId <= 18935) or -- Кепка передняя
				data.modelId == 18946 or -- Рваная шляпа Байкеров
				(data.modelId >= 18947 and data.modelId <= 18951) or -- Шляпка
				data.modelId == 18952 or -- Шлем для бокса
				(data.modelId >= 18953 and data.modelId <= 18954) or -- Тёплая Шапка
				(data.modelId >= 18955 and data.modelId <= 18959) or -- Кепка обратная
				data.modelId == 18963 or -- Голова CJ
				(data.modelId >= 18964 and data.modelId <= 18966) or -- Бандитская шапка
				(data.modelId >= 18967 and data.modelId <= 18969) or -- Панамка
				(data.modelId >= 18970 and data.modelId <= 18973) or -- Шляпа
				data.modelId == 18974 or -- Рваная повязка Russian Mafia
				(data.modelId >= 19006 and data.modelId <= 19035) or -- Очки
				(data.modelId >= 19039 and data.modelId <= 19053) or -- Часы
				(data.modelId >= 19036 and data.modelId <= 19038) or -- Хоккейная маска
				data.modelId == 19065 or -- Новогодняя шапка (2)
				data.modelId == 19066 or -- Новогодняя шапка (3)
				data.modelId == 19077 or -- Борода #2
				data.modelId == 19078 or -- Костюм попугая
				(data.modelId >= 19080 and data.modelId <= 19084) or -- Шляпа маяк
				(data.modelId >= 19095 and data.modelId <= 19100) or -- Ковбойская шляпа
				(data.modelId >= 19101 and data.modelId <= 19120) or -- Каска
				data.modelId == 19130 or -- Знак на груди
				data.modelId == 19136 or -- Шляпа с дредами
				data.modelId == 19141 or -- Каска спецназа (черная)
				data.modelId == 19142 or -- Бронежилет (черный)
				data.modelId == 19160 or -- Кепка DUDE жёлтая
				data.modelId == 19161 or -- Кепка Police серая
				data.modelId == 19162 or -- Кепка Police синяя
				data.modelId == 19314 or -- Рога
				(data.modelId >= 19317 and data.modelId <= 19319) or -- Гитары
				data.modelId == 19330 or -- Женская шляпка
				(data.modelId >= 19332 and data.modelId <= 19338) or -- Воздушные шары
				data.modelId == 19347 or -- Звезда на грудь
				data.modelId == 19349 or -- Монокль
				data.modelId == 19352 or -- Чёрный конус
				(data.modelId >= 19421 and data.modelId <= 19424) or -- Наушники
				data.modelId == 19468 or -- Редкая ткань
				data.modelId == 19472 or -- Респиратор
				data.modelId == 19487 or -- Белый конус
				data.modelId == 19513 or -- Samsung Galaxy S10 (Серебрянный)
				data.modelId == 19514 or -- Каска спецназа (белая)
				data.modelId == 19515 or -- Бронежилет (белый)
				data.modelId == 19517 or -- Борода #1
				data.modelId == 19518 or -- Парик (2)
				data.modelId == 19519 or -- Парик (3)
				(data.modelId >= 19520 and data.modelId <= 19521) or -- Фуражка офицера
				data.modelId == 19522 or -- Гражданский талон
				data.modelId == 19553 or -- Фермерская шляпа
				data.modelId == 19554 or -- Шапка баллас
				data.modelId == 19557 or -- Маска Зорро
				data.modelId == 19558 or -- Кепка (развозчика пиццы)
				data.modelId == 19559 or -- Походный рюкзак
				data.modelId == 19566 or -- Энергитический батончик
				data.modelId == 19576 or -- Модификация: Гринч
				data.modelId == 19581 or -- Сковородка
				data.modelId == 19591 or -- Китайский веер
				data.modelId == 19614 or -- Ларец с премией
				data.modelId == 19620 or -- Полицейский ранец & Палка красно-синяя
				data.modelId == 19621 or -- Канистра на правое бедро
				data.modelId == 19623 or -- Фотоаппарат на грудь
				data.modelId == 19624 or -- Большой чемодан
				data.modelId == 19625 or -- Сигареты
				data.modelId == 19626 or -- Лопата в руку (2)
				data.modelId == 19627 or -- Ремонтный набор (/repcar)
				data.modelId == 19630 or -- Рыба
				data.modelId == 19631 or -- Кирка на спину
				data.modelId == 19636 or -- Ларек с фруктами
				data.modelId == 19773 or -- Усы
				data.modelId == 19792 or -- Сим.карты
				data.modelId == 19801 or -- Маска (/mask)
				data.modelId == 19806 or -- Новогодний реактивный ранец
				data.modelId == 19824 or -- Бита-бутылка на спину
				data.modelId == 19843 or -- Материалы
				data.modelId == 19847 or -- Копченая нога
				data.modelId == 19878 or -- Скейт на спину
				data.modelId == 19882 or -- Жареное мясо оленины & Жареная рыба
				data.modelId == 19900 or -- Ларец Super Car Box
				data.modelId == 19904 or -- Жилет грузчика
				data.modelId == 19921 or -- Красный чемодан
				data.modelId == 19918 or -- Сундук рулетки
				data.modelId == 19941 or -- Золото
				data.modelId == 19998 then -- Зажигалка
				return
			end
			local file = io.open('moonloader/stealer/textdraws/'..data.modelId..'.notepad', 'a+')
			if file ~= -1 and file ~= nil then
				code_temp_3 = ""
				code_temp_3 = string.format(string.format('Model: %d | Rotation: %0.6f, %0.6f, %0.6f, %0.6f | Color: 0x%s\n',data.modelId,data.rotation.x,data.rotation.y,data.rotation.z,data.zoom,bit.tohex(argb_to_rgba(data.backgroundColor))))
				if string.find(file:read("*all"), code_temp_3, 1, true) then
					--sampfuncsLog('{FF3300}<Копия> '..code_temp_3)
					io.close(file)
					return
				end
				file:write('////////////////////['..os.date('%d-%m-%Y || %H:%M:%S')..']////////////////////\n')
				file:write(string.format('Model: %d | Rotation: %0.6f, %0.6f, %0.6f, %0.6f | Color: 0x%s\n',data.modelId,data.rotation.x,data.rotation.y,data.rotation.z,data.zoom,bit.tohex(argb_to_rgba(data.backgroundColor))))
				io.close(file)
			end
		end
	end
	----------------------------------------
	return {textdrawId, data}
end

function sampev.onDisplayGameText(style, time, text)
	----------------------------------------
	if isCharInAnyCar(PLAYER_PED) then
		carhandle = storeCarCharIsInNoSave(PLAYER_PED)
		if getCarModel(carhandle) == 456 then
			if string.find(text,"-12000%$") then
				prodovoz_timer = os.time()+240
			end
		end
	end
	----------------------------------------
	if text:find('Go to the lottery') then
		sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Посети лотерейную!', 0xFFFFFF)
		return false
	end
	----------------------------------------
	if text:find('-1 HP') or
	text:find('-2 HP') or
	text:find('-3 HP') or
	text:find('-4 HP') or
	text:find('-5 HP') or
	text:find('-6 HP') or
	text:find('-7 HP') or
	text:find('-8 HP') or
	text:find('-9 HP') or
	text:find('-10 HP') or
	text:find('+1 HP') or
	text:find('+2 HP') or
	text:find('+3 HP') or
	text:find('+4 HP') or
	text:find('+5 HP') or
	text:find('+6 HP') or
	text:find('+7 HP') or
	text:find('+8 HP') or
	text:find('+9 HP') or
	text:find('+10 HP') or
	text:find('You are hungry!') or
	text:find('You are very hungry!') or
	text:find('attention') then
		return false
	end
end

function sampev.onServerMessage(color, text)
	----------------------------------------
	if elements.state.autoloot == true and text:find('Подождите немного...') then
		return false
	end
	----------------------------------------
	ip, port = sampGetCurrentServerAddress()
	if elements.chat.chatlog.v == true and text ~= ' ' and ip ~= "127.0.0.1" then
		local file_logs = io.open('moonloader/logs/'..sampGetCurrentServerAddress()..'.txt', 'a+')
		if file_logs ~= -1 and file_logs ~= nil then
			file_logs:write('['..os.date('%d-%m-%Y || %H:%M:%S')..']['..color..'] '..text..'\n')
			file_logs:close()
		end
	end
	--------------------[Авто-открытие рулеток]--------------------
	if text:find("Вам был добавлен предмет") then
		elements.autoopenroul.open_roul_active = true
	end
	if text:find('%[Подсказка%] %{FFFFFF%}Вы получили +(.+)%$!') then
		elements.autoopenroul.open_roul_active = true
	end
	--------------------[Авто-точилка аксессуаров]--------------------
	if text:find('Увы, вам не удалось улучшить предмет') and elements.autotoch.autotoch_enable.v == true then
		elements.autotoch.autotoch_active = true
		inventory(elements.autotoch.checked_inv.v)
	end
	if text:find('Успех! Вам удалось улучшить предмет') and elements.autotoch.autotoch_enable.v == true then
		number = string.match(text, 'на ++(%d+)')+0
		if number < elements.autotoch.checked_radio.v and elements.autotoch.autotoch_enable.v == true then
			elements.autotoch.autotoch_active = true
			inventory(elements.autotoch.checked_inv.v)
		end
	end
	----------------------------------------
	if string.find(text,"купил у вас") or string.find(text,"Вы купили") or string.find(text,"Вы успешно купили") then
		if elements.chat.renderchatbuy.v == true then
			table.insert(chatMessages, '{FDDB6D}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsbuy.v == true then
			sampfuncsLog('{FDDB6D}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removechatbuy.v == true then
			return false
		end
	end
	----------------------------------------
	if (text:find("В нашем магазине ты можешь приобрести нужное количество игровых денег и потратить") or
		text:find("их на желаемый тобой") or
		text:find("имеют большие возможности") or
		text:find("можно приобрести редкие") or
		text:find("которые выделят тебя из толпы")) and color == 1687547391 or
		----------------------------------------
		(text:find("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~") or
		text:find("Основные команды сервера:") or
		text:find("Пригласи друга и получи") or
		text:find("Наш сайт:")) and color == -89368321 or
		----------------------------------------
		(text:find("Гость ") or
		text:find("Репортёр ")) and color == -1697828097 or
		----------------------------------------
		text:find("Микрофон") and color == -1863723265 or
		----------------------------------------
		--text:find("Альянс") and color == -1178486529 or
		----------------------------------------
		text:find("С помощью телефона можно заказать такси") and color == -170229249 or
		----------------------------------------
		text:find("Битва за контроль грузового корабля начнется через") and color == -10270721 or
		----------------------------------------
		((text:find(" ") and string.len(text) == 1) and color == -1) or
		----------------------------------------
		(text:find("Уважаемые жители штата! Минуточку внимания") or
		text:find("В данный момент проходит собеседование") or
		text:find("Для Вступления необходимо прибыть в") and color == 73381119) or
		----------------------------------------
		string.find(text,"%[D%]") or
		string.find(text,"%[ News ") or
		string.find(text,"Сейчас в магазине нет видеокарт, ожидайте нового завоза.") or
		string.find(text,"Игра уже началась, подождите..") or
		string.find(text,"начал работу новый инкассатор") or
		string.find(text,"Убив его, вы сможете получить деньги") or
		string.find(text,"Со склада Армии") then
		if elements.chat.tosampfuncsspam.v == true then
			sampfuncsLog(os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removechatspam.v == true then
			return false
		end
	end
	----------------------------------------
	if string.find(text,"%[PREMIUM%]") or
	(string.find(text,"%[VIP%]") and not string.find(text,"%[VIP%] Объявление")) or
	string.find(text,"%[ADMIN%]") then
		if elements.chat.rendervipchat.v == true then
			table.insert(chatMessages, '{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsvipchat.v == true then
			sampfuncsLog('{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removevipchat.v == true then
			return false
		end
	end
	----------------------------------------
	if ((string.find(text,"%[Механик%]") or
	string.find(text,"%[Развозчик продуктов%]") or
	string.find(text,"%[Крупье%]") or
	string.find(text,"%[Работник Налоговой%]") or
	string.find(text,"%[Инкассатор%]") or
	string.find(text,"%[Дальнобойщик%]") or
	string.find(text,"%[Развозчик металлолома%]") or
	string.find(text,"%[Мусорщик%]") or
	string.find(text,"%[Водитель автобуса%]") or
	string.find(text,"%[Пожарный%]") or
	string.find(text,"%[Водитель трамвая%]") or
	string.find(text,"%[Машинист электропоезда%]") or
	string.find(text,"%[Главный фермер%]") or
	string.find(text,"%[Руководитель грузчиков%]") or
	string.find(text,"%[Руководитель завода%]") or
	string.find(text,"%[Ремонтник дорог%]") or
	string.find(text,"%[Продавец хотдогов%]") or
	string.find(text,"%[Развозчик пиццы%]") or
	string.find(text,"%[Адвокат%]") or
	string.find(text,"%[Таксист%]") or
	string.find(text,"%[Грузчик%]")) and color == -2686721) or
	-- string.find(text,"Таксист (%w+_%w+) принял вызов игрока (%w+_%w+)") and color == 1687547391 or
	string.find(text,"принял вызов игрока") and color == 1687547391 or
	string.find(text,"вызывает такси") and (color == 1687547391 or color == 2046517247) or
	string.find(text,"Поступил вызов, чтобы принять введите") and color == -1347440641 or
	string.find(text,"Местоположение:") and color == -1
	then
		if elements.chat.renderjobchat.v == true then
			table.insert(chatMessages, '{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsjobchat.v == true then
			sampfuncsLog('{FFD700}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removejobchat.v == true then
			return false
		end
	end
	----------------------------------------
	if ((string.find(text,"Объявление") or string.find(text,"Отредактировал сотрудник СМИ")) and (color == 1941201407 or color == -1)) then
		if elements.chat.renderadv.v == true then
			table.insert(chatMessages, '{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsadv.v == true then
			sampfuncsLog('{FFD700}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removeadv.v == true then
			return false
		end
	end
	----------------------------------------
	if (string.find(text,"кричит") and color == -253326081) then
		if elements.config.del_shout.v == true then
			return false
		end
	end
	----------------------------------------
	if text:find("Сработала защита от реконнекта! Попробуйте переподключиться через") and color == -10270721 then
		sec = string.match(text,'Сработала защита от реконнекта! Попробуйте переподключиться через (%d+)')
		reconnect_timer = os.time()+sec
	end
	----------------------------------------
	if text:find("Ключи не вставлены") and color == -1347440641 then
		lua_thread.create(function()
			sampSendChat("/key")
			wait(500)
			sampSendChat("/engine")
		end)
	end
	----------------------------------------
	if text:find("В этом транспорте закончилось топливо.") and color == -1347440641 then
		sampAddChatMessage('В этом транспорте закончилось топливо.', 0xAFAFAF)
		sampSendChat("/key")
	end
	----------------------------------------
	if text:find("Чтобы вызвать механика, используйте телефон") and color == -1347440641 then
		sampSendChat("/key")
	end
	----------------------------------------
	if text:find("заглушил%(а%) двигатель") and color == -1029514497 then
		if text:find(string.format("%s заглушил",local_name)) then
			if isCharInAnyCar(PLAYER_PED) then
				sampAddChatMessage(' '..local_name..' заглушил(а) двигатель', 0xC2A2DA)
				sampSendChat("/key")
			end
		end
	end
	----------------------------------------
	if text:find('Попробуйте через {FF6347}') then
		second = string.match(text,'Попробуйте через {FF6347}(%d+)')
		prodovoz_timer = os.time()+second
	end
	----------------------------------------
	if text:find("У вас началась сильная ломка!") and color == -10270721 then
		if elements.config.autousedrugs.v == true then
			sampSendChat("/usedrugs 3")
		end
		return false
	end
	----------------------------------------
	if text:find("Вашему персонажу нужно принять") and color == -10270721 then
		return false
	end
	----------------------------------------
	if not finished and elements.chat.removevipchat.v == false then
		if text:find('^%[Ошибка%].*После последнего сообщения в этом чате нужно подождать') then
			lua_thread.create(function()
				wait(delay_autovr * 1000);
				sampSendChat('/vr ' .. message)
			end)
			return false
		end
		----------------------------------------
		local id = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))
		if text:match('%[%u+%] {%x+}[A-z0-9_]+%[' .. id .. '%]:') then
			finished = true
		end
	end
	----------------------------------------
	if text:find('^Вы заглушены') or text:find('Для возможности повторной отправки сообщения в этот чат') then
		finished = true
	end
	----------------------------------------
	if elements.state.buyvk ~= -1 then
		if text:find("для приобретения данной периферии") then
			elements.state.buyvk = -1
			push_message('Выключаю покупку VK-Coins.')
		end
	end
	----------------------------------------
end

function sampev.onPlayerJoin(playerid, color, isNpc, nickname)
	for i = 1, #friends do
		if nickname == friends[i] and local_name ~= friends[i] then
			----------------------------------------
			table.insert(chatMessages, '{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] заходит на сервер.')
			----------------------------------------
			if elements.chat.tosampfuncsconnect.v then
				sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] заходит на сервер.')
			end
			----------------------------------------
			if elements.chat.sendconnect.v then
				sampAddChatMessage(nickname..'['..playerid..'] заходит на сервер.', 0xFF3300)
			end
			----------------------------------------
		end
	end
	----------------------------------------
end

function sampev.onPlayerQuit(playerid, reason)
	for i = 1, #friends do
		nickname = sampGetPlayerNickname(playerid)
		if nickname == friends[i] then
			----------------------------------------
			if reason == 0 then reason_s = string.format("Ошибка")
			elseif reason == 1 then reason_s = string.format("Вышел")
			else reason_s = string.format("Кик/Бан") end
			----------------------------------------
			table.insert(chatMessages, '{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s)
			----------------------------------------
			if elements.chat.tosampfuncsdisconnect.v then
				sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s)
			end
			----------------------------------------
			if elements.chat.senddisconnect.v then
				sampAddChatMessage(nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s, 0xFF3300)
			end
			----------------------------------------
		end
	end
	----------------------------------------
end

function report(arg)
	if #arg == 0 then
		sampAddChatMessage('Используй: /rr [жалоба]', 0xAFAFAF)
	else
		message_report = arg
		sampSendChat("/report")
	end
end

function sampev.onSetVehicleParamsEx(vehicleId, params, doors, windows)
	if elements.config.del_stream.v == true then
		return false
	end
	if params.boot == 1 then
		carid = vehicleId
	end
	if carid == vehicleId and params.boot == 0 then
		carid = -1
		printString('',0)
	end
	result, carhandle = sampGetCarHandleBySampVehicleId(vehicleId)
	if carhandle ~= -1 then
		----------------------------------------
		model = getCarModel(carhandle)
		ip, port = sampGetCurrentServerAddress()
		----------------------------------------
		if ip ~= "127.0.0.1" and vehicleId >= 838 then
			if model ~= 411 and
			model ~= 451 and
			model ~= 470 and
			model ~= 475 and
			model ~= 490 and
			model ~= 495 and
			model ~= 502 and
			model ~= 541 and
			model ~= 550 and
			model ~= 560 and
			model ~= 562 and
			model ~= 565 and
			model ~= 566 then
				fsoav(vehicleId)
			end
		end
		----------------------------------------
	end
end

function sampev.onVehicleStreamOut(vehicleId)
	if carid ~= -1 and carid == vehicleId then
		carid = -1
		printString('',0)
	end
end

function sampev.onPlayerStreamIn(playerId, team, model, position, rotation, color, fightingStyle)
	local friend = false
	nickname = sampGetPlayerNickname(playerId)
	for id = 1, #friends do
		if nickname == friends[id] then
			friend = true
		end
	end
	if friend == false then
		if elements.config.del_stream.v == true then
			return false
		end
		if elements.config.del_stream_pl.v == true then
			return false
		end
	end
end

function sampev.onVehicleStreamIn(vehicleId, data)
	if elements.config.del_stream.v == true then
		return false
	end
end

function sampev.onPlayerDeathNotification(killerid, killedid, reason)
	if elements.config.killStat.v == true then
		return false
	end
end

function sampev.onCreate3DText(id, color, position, distance, testLOS, attachedPlayerId, attachedVehicleId, text)
	if elements.config.del_opisanie_3d.v == true and position.x == 0 and position.y == 0 and position.z == -1 and distance == 7 and attachedPlayerId ~= 65535 then
		return false
	end
	if elements.config.del_family_3d.v == true and position.x == 0 and position.y == 0 and distance == 5 and attachedPlayerId ~= 65535 then
		return false
	end
end

function getCarName(vehicleId)
	if type(vehicleId) ~= "number" then
		return "No valid car id"
	end
	if vehicleId < 400 or vehicleId > 611 then
		return "No valid car id"
	end
	return tCarsName[vehicleId-399]
end

function onReceivePacket(id, bitStream)
	if reconnect_timer >= os.time() and (id ~= PACKET_DISCONNECTION_NOTIFICATION and id ~= PACKET_INVALID_PASSWORD and id ~= PACKET_CONNECTION_BANNED) then
		reconnect_timer = 0
	end
	if id == PACKET_DISCONNECTION_NOTIFICATION or id == PACKET_INVALID_PASSWORD or id == PACKET_CONNECTION_BANNED then
		sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'Server closed the connection.')
		if reconnect_timer < os.time() then
			reconnect_timer = os.time()+15
		end
	end
	if (id == PACKET_CONNECTION_ATTEMPT_FAILED) then
		sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'Server didn\'t not respond.')
	end
end

function sampev.onCreateObject(objectId, data)
	-- if data.modelId == 854 then
		-- local file = io.open('moonloader/waxta.notepad', 'a+')
		-- if file ~= -1 and file ~= nil then
			-- file:write(string.format('{120,{%0.6f,%0.6f,%0.6f,%0.6f,%0.6f,%0.6f}},\n',data.position.x,data.position.y,data.position.z,data.rotation.x,data.rotation.y,data.rotation.z))
			-- io.close(file)
		-- end
	-- end
	--------------------[Клады]--------------------
	ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" then
		if data.modelId == 1271 or data.modelId == 2680 then
			for i = 0, 12 do
				sampAddChatMessage('В зоне стрима КЛАД!!! '..data.drawDistance, 0xFF3300)
			end
			local file = io.open('moonloader/klads.notepad', 'a+')
			if file ~= -1 and file ~= nil then
				file:write(string.format('{%0.6f,%0.6f,%0.6f},\n',data.position.x,data.position.y,data.position.z))
				io.close(file)
			end
		end
	end
	--------------------[Стиллер объектов на транспорт]--------------------
	if data.modelId == 19476 then
		local tempObj = { }
		----------------------------------------
		tempObj['objectId'] = objectId
		tempObj['modelId'] = data.modelId
		tempObj['position'] = data.position
		tempObj['rotation'] = data.rotation
		tempObj['drawDistance'] = data.drawDistance
		tempObj['cameraCol'] = data.cameraCol
		tempObj['materialHave'] = false
		tempObj['materialNum'] = 0
		tempObj['materialTxtNum'] = 0
		----------------------------------------
		if sampGetGamestate() == 2 then
			tempObj['streamerDynamic'] = false
		else
			tempObj['streamerDynamic'] = true
		end
		----------------------------------------
		if data.texturesCount > 0 then
			if #data.materials ~= 0 then
				for i = 1, #data.materials do
					local tempMatObj = { }
					----------------------------------------
					tempMatObj['objectId'] = data.objectId
					tempMatObj['materialId'] = data.materials[i]['materialId']
					tempMatObj['modelId'] = data.materials[i]['modelId']
					tempMatObj['libraryName'] = data.materials[i]['libraryName']
					tempMatObj['textureName'] = data.materials[i]['textureName']
					tempMatObj['materialType'] = true
					----------------------------------------
					if data.materials[i]['color'] == 0 then
						tempMatObj['color'] = '0'
					else
						tempMatObj['color'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.materials[i]['color']))
					end
					----------------------------------------
					tempObj['materialHave'] = true
					tempObj['materialNum'] = tempObj['materialNum'] + 1
					----------------------------------------
					table.insert(tempObj, tempMatObj)
				end
			end
			----------------------------------------
			if #data.materialText ~= 0 then
				for i = 1, #data.materialText do
					local tempMatObj = {}
					----------------------------------------
					tempMatObj['objectId'] = data.objectId
					tempMatObj['materialId'] = data.materialText[i]['materialId']
					tempMatObj['materialSize'] = data.materialText[i]['materialSize']
					tempMatObj['fontName'] = data.materialText[i]['fontName']
					tempMatObj['fontSize'] = data.materialText[i]['fontSize']
					tempMatObj['bold'] = data.materialText[i]['bold']
					tempMatObj['materialType'] = false
					----------------------------------------
					if data.materialText[i]['fontColor'] == 0 then
						tempMatObj['fontColor'] = '0'
					else
						tempMatObj['fontColor'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.materialText[i]['fontColor']))
					end
					----------------------------------------
					if data.materialText[i]['backGroundColor'] == 0 then
						tempMatObj['backGroundColor'] = '0'
					else
						tempMatObj['backGroundColor'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.materialText[i]['backGroundColor']))
					end
					----------------------------------------
					tempMatObj['align'] = data.materialText[i]['align']
					data.materialText[i]['text'] = string.gsub(data.materialText[i]['text'], '\n', '\\n')
					tempMatObj['text'] = data.materialText[i]['text']
					----------------------------------------
					tempObj['materialHave'] = true
					tempObj['materialTxtNum'] = tempObj['materialTxtNum'] + 1
					----------------------------------------
					table.insert(tempObj, tempMatObj)
				end
			end
		end
		----------------------------------------
		function sampev.onMoveObject(objectId, fromPos, destPos, speed, rotation)
			if tempObj['objectId'] == objectId then
				if tempObj['position']['x'] ~= destPos.x then tempObj['position']['x'] = destPos.x end
				if tempObj['position']['y'] ~= destPos.y then tempObj['position']['y'] = destPos.y end
				if tempObj['position']['z'] ~= destPos.z then tempObj['position']['z'] = destPos.z end
				----------------------------------------
				if tempObj['rotation']['x'] ~= rotation.x and rotation.x ~= -1000.0 then tempObj['rotation']['x'] = rotation.x end
				if tempObj['rotation']['y'] ~= rotation.y and rotation.y ~= -1000.0 then tempObj['rotation']['y'] = rotation.y end
				if tempObj['rotation']['z'] ~= rotation.z and rotation.z ~= -1000.0 then tempObj['rotation']['z'] = rotation.z end
			end
		end
		----------------------------------------
		function sampev.onSetObjectMaterial(objectId, data)
			if tempObj['objectId'] == objectId then
				local tempMatObj = {}
				----------------------------------------
				tempMatObj['objectId'] = objectId
				tempMatObj['materialId'] = data.materialId
				tempMatObj['modelId'] = data.modelId
				tempMatObj['libraryName'] = data.libraryName
				tempMatObj['textureName'] = data.textureName
				tempMatObj['materialType'] = true
				----------------------------------------
				if data.color == 0 then
					tempMatObj['color'] = '0'
				else
					tempMatObj['color'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.color))
				end
				----------------------------------------
				tempObj['materialHave'] = true
				tempObj['materialNum'] = tempObj['materialNum'] + 1
				----------------------------------------
				table.insert(tempObj, tempMatObj)
			end
		end
		----------------------------------------
		function sampev.onSetObjectMaterialText(objectId, data)
			--------------------[Автобазар]--------------------
			if data.align == 1 and data.fontSize == 40 then
				local veh, price = data.text:match('^([^\n]+)\n{%x+}%$(%d+)')
				if veh and price then
					price = sumFormat(price)
					----------------------------------------
					-- local isInside = pointInRectangle(
					-- {
						-- x = select(1, getCharCoordinates(PLAYER_PED)), 
						-- y = select(2, getCharCoordinates(PLAYER_PED))
					-- },
					-- {
						-- A = {x = -2113.40, y = -975.00},
						-- B = {x = -2154.30, y = -975.00},
						-- C = {x = -2154.30, y = -744.65},
						-- D = {x = -2113.40, y = -744.65}
					-- })
					----------------------------------------
					-- if isInside then
					sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] На продажу выставлен {FDDB6D}'..veh..'{FFFFFF} за {FDDB6D}$'..price..'{FFFFFF}.', 0xFFFFFF)
					local file_logs = io.open('moonloader/logs/price.txt', 'a+')
					if file_logs ~= -1 then
						if file_logs ~= nil then
							file_logs:write(veh..' выставлен на продажу за: $'..price..'\n')
							file_logs:close()
						end
					end
					-- end
					----------------------------------------
					data.text = data.text:gsub('%$%d+', '$' .. price)
					return { objectId, data }
				end
			end
			----------------------------------------
			if tempObj['objectId'] == objectId then
				local tempMatObj = {}
				----------------------------------------
				tempMatObj['objectId'] = objectId
				tempMatObj['materialId'] = data.materialId
				tempMatObj['materialSize'] = data.materialSize
				tempMatObj['fontName'] = data.fontName
				tempMatObj['fontSize'] = data.fontSize
				tempMatObj['bold'] = data.bold
				tempMatObj['materialType'] = false
				----------------------------------------
				if data.fontColor == 0 then
					tempMatObj['fontColor'] = '0'
				else
					tempMatObj['fontColor'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.fontColor))
				end
				if data.backGroundColor == 0 then
					tempMatObj['backGroundColor'] = '0'
				else
					tempMatObj['backGroundColor'] = string.format('0x%X', bit.band(0xFFFFFFFF,data.backGroundColor))
				end
				----------------------------------------
				tempMatObj['align'] = data.align
				data.text = string.gsub(data.text, '\n', '\\n')
				tempMatObj['text'] = data.text
				----------------------------------------
				tempObj['materialHave'] = true
				tempObj['materialTxtNum'] = tempObj['materialTxtNum'] + 1
				----------------------------------------
				table.insert(tempObj, tempMatObj)
			end
		end
		----------------------------------------
		function sampev.onSetObjectPosition(objectId, position)
			if tempObj['objectId'] == objectId then
				if tempObj['position']['x'] ~= position.x then tempObj['position']['x'] = position.x end
				if tempObj['position']['y'] ~= position.y then tempObj['position']['y'] = position.y end
				if tempObj['position']['z'] ~= position.z then tempObj['position']['z'] = position.z end
			end
		end
		----------------------------------------
		function sampev.onSetObjectRotation(objectId, rotation)
			if tempObj['objectId'] == objectId then
				if tempObj['rotation']['x'] ~= rotation.x then tempObj['rotation']['x'] = rotation.x end
				if tempObj['rotation']['y'] ~= rotation.y then tempObj['rotation']['y'] = rotation.y end
				if tempObj['rotation']['z'] ~= rotation.z then tempObj['rotation']['z'] = rotation.z end
			end
		end
		----------------------------------------
		if data.attachToVehicleId ~= nil and data.attachToVehicleId ~= 65535 then
			local vehicleData = {}
			----------------------------------------
			vehicleData['id'] = data.attachToVehicleId
			vehicleData['data'] = tempObj
			----------------------------------------
			vehicleData['OffsetX'] = data.attachOffsets.x
			vehicleData['OffsetY'] = data.attachOffsets.y
			vehicleData['OffsetZ'] = data.attachOffsets.z
			vehicleData['RotX'] = data.attachRotation.x
			vehicleData['RotY'] = data.attachRotation.y
			vehicleData['RotZ'] = data.attachRotation.z
			----------------------------------------
			table.insert(objectsTable, vehicleData)
			----------------------------------------
		end
	end
end

function sampev.onDestroyObject(objectId)
	for i = 1, #objectsTable do
		if objectsTable[i] ~= nil then
			if objectsTable[i]['data']['objectId'] == objectId then
				objectsTable[i] = nil
				break
			end
		end
	end
end

function fsoav(vehicleId)
	if tonumber(vehicleId) == nil then return sampAddChatMessage('Invalid vehicleId', 0xFF9ACD32) end
	----------------------------------------
	local res, vHandle = sampGetCarHandleBySampVehicleId(vehicleId)
	if not res then
		return
	end
	----------------------------------------
	count = false
	----------------------------------------
	for i = 1, #objectsTable do
		if objectsTable[i] ~= nil then
			if objectsTable[i]['id'] == tonumber(vehicleId) then
				count = true
			end
		end
	end
	if count == true then
		model = getCarModel(carhandle)
		----------------------------------------
		vehicle_name = getCarName(model)
		----------------------------------------
		directory = 'moonloader/stealer/vehicles/'..model..' - '..vehicle_name..'('..vehicleId..').notepad'
		----------------------------------------
		os.remove(directory)
		local file = io.open(directory, 'a+')
		----------------------------------------
		local vPosX, vPosY, vPosZ = getCarCoordinates(carhandle)
		local vAngle = getCarHeading(carhandle)
		local vColorPrim, vColorSec = getCarColours(carhandle)
		----------------------------------------
		file:write(string.format('new vehicleid = CreateVehicle(%i, %f, %f, %f, %f, %i, %i, -1);', getCarModel(carhandle), vPosX, vPosY, vPosZ, vAngle, vColorPrim, vColorSec) .. '\n\n')
		----------------------------------------
		for i = 1, #objectsTable do
			if objectsTable[i] ~= nil then
				if objectsTable[i]['id'] == tonumber(vehicleId) then
					local setDrawDist = 'STREAMER_OBJECT_DD'
					local setDrawDistNum = '0.0'
					----------------------------------------
					if objectsTable[i]['data']['drawDistance'] > 0 then
						setDrawDist = tostring(objectsTable[i]['data']['drawDistance'])
						setDrawDistNum = tostring(objectsTable[i]['data']['drawDistance'])
						----------------------------------------
						if setDrawDist == nil and setDrawDistNum == nil then
							setDrawDist = 'STREAMER_OBJECT_DD'
							setDrawDistNum = '0.0'
						else
							setDrawDist = tostring(math.floor(objectsTable[i]['data']['drawDistance'])) .. '.0'
							setDrawDistNum = tostring(math.floor(objectsTable[i]['data']['drawDistance'])) .. '.0'
						end
					end
					----------------------------------------
					local objVar = 'vaos_' .. tostring(i)
					----------------------------------------
					if objectsTable[i]['data']['materialNum'] == 0 and objectsTable[i]['data']['materialTxtNum'] == 0 then
						if objectsTable[i]['data']['streamerDynamic'] then
							file:write(string.format('%sCreateDynamicObject(%d, %f, %f, %f, %f, %f, %f, %d, %d, -1, STREAMER_OBJECT_SD, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							0,
							0,
							setDrawDist))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetDynamicObjectNoCameraCol(%s);\n', objVar)) end
							file:write(string.format('AttachDynamicObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						else
							file:write(string.format('%sCreateObject(%d, %f, %f, %f, %f, %f, %f, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							setDrawDistNum))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetObjectNoCameraCol(%s);\n', objVar)) end
							file:write(string.format('AttachObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						end
					else
						if objectsTable[i]['data']['streamerDynamic'] then
							file:write(string.format('%sCreateDynamicObject(%d, %f, %f, %f, %f, %f, %f, %d, %d, -1, STREAMER_OBJECT_SD, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							0,
							0,
							setDrawDist))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetDynamicObjectNoCameraCol(%s);\n', objVar)) end
							----------------------------------------
							for j = 1, #objectsTable[i]['data'] do
								if objectsTable[i]['data'][j] ~= nil then
									if objectsTable[i]['data'][j]['materialType'] == true then
										file:write(string.format('SetDynamicObjectMaterial(%s, %d, %d, "%s", "%s", %s);\n',
										objVar,
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['modelId'],
										objectsTable[i]['data'][j]['libraryName'],
										objectsTable[i]['data'][j]['textureName'],
										objectsTable[i]['data'][j]['color']))
									else
										file:write(string.format('SetDynamicObjectMaterialText(%s, %d, "%s", %d, "%s", %d, %d, %s, %s, %d);\n',
										objVar,
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['text'],
										objectsTable[i]['data'][j]['materialSize'],
										objectsTable[i]['data'][j]['fontName'],
										objectsTable[i]['data'][j]['fontSize'],
										objectsTable[i]['data'][j]['bold'],
										objectsTable[i]['data'][j]['fontColor'],
										objectsTable[i]['data'][j]['backGroundColor'],
										objectsTable[i]['data'][j]['align']))
									end
								end
							end
							----------------------------------------
							file:write(string.format('AttachDynamicObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						else
							file:write(string.format('%sCreateObject(%d, %f, %f, %f, %f, %f, %f, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							setDrawDistNum))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetObjectNoCameraCol(%s);\n', objVar)) end
							----------------------------------------
							for j = 1, #objectsTable[i]['data'] do
								if objectsTable[i]['data'][j] ~= nil then
									if objectsTable[i]['data'][j]['materialType'] == true then
										file:write(string.format('SetObjectMaterial(%s, %d, %d, "%s", "%s", %s);\n',
										objVar,
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['modelId'],
										objectsTable[i]['data'][j]['libraryName'],
										objectsTable[i]['data'][j]['textureName'],
										objectsTable[i]['data'][j]['color']))
									else
										file:write(string.format('SetObjectMaterialText(%s, "%s", %d, %d, "%s", %d, %d, %s, %s, %d);\n',
										objVar,
										objectsTable[i]['data'][j]['text'],
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['materialSize'],
										objectsTable[i]['data'][j]['fontName'],
										objectsTable[i]['data'][j]['fontSize'],
										objectsTable[i]['data'][j]['bold'],
										objectsTable[i]['data'][j]['fontColor'],
										objectsTable[i]['data'][j]['backGroundColor'],
										objectsTable[i]['data'][j]['align']))
									end
								end
							end
							----------------------------------------
							file:write(string.format('AttachObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						end
					end
				end
			end
		end
		io.close(file)
	end
end

function onReceiveRpc(id, bitStream)
	if id == RPC_SCRCREATEOBJECT and sampIsLocalPlayerSpawned() then
		local id = raknetBitStreamReadInt16(bitStream)
		local model = raknetBitStreamReadInt32(bitStream)
		if elements.destroy.bucket.v == true and (model == 2404 or model == 2405 or model == 2406 or model == 2410 or model == 19601 or model == 19848) then
			return false
		end
		if elements.destroy.tree.v == true and model == 19076 then
			return false
		end
		if elements.destroy.floor.v == true and model == 19128 then
			return false
		end
		if elements.destroy.chest.v == true and (model == 19054 or model == 19055 or model == 19056 or model == 19057 or model == 19058) then
			return false
		end
		if elements.destroy.game.v == true and (model == 19059 or model == 19060 or model == 19061 or model == 19062 or model == 19063) then
			return false
		end
		if elements.destroy.serdce.v == true and model == 7093 then
			return false
		end
		if elements.destroy.newyear.v == true and (model == 658 or model == 1247 or model == 1606 or model == 3038 or model == 3281 or model == 3505 or model == 3506 or
		model == 7666 or model == 16101 or model == 16304 or model == 18864 or model == 19604 or model == 19606) then
			return false
		end
		if elements.destroy.pasxa.v == true and (model == 19341 or model == 19342 or model == 19343 or model == 19344 or model == 19345) then
			return false
		end
		if elements.destroy.xlam.v == true and (model == 371 or model == 823 or model == 886 or model == 890 or model == 894 or model == 1240 or model == 19306) then
			return false
		end
	end
end

function skupka()
	delay_skupka = 500
	lua_thread.create(function()
		wait(delay_skupka)
		if elements.lavka.drugs.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 0, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.drugs.v..' '..elements.lavka.drugs_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.materials.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 1, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.materials.v..' '..elements.lavka.materials_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.fam_talon.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.fam_talon.v..' '..elements.lavka.fam_talon_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.cherepa.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.cherepa.v..' '..elements.lavka.cherepa_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.sale_talon.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sale_talon.v..' '..elements.lavka.sale_talon_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.gift.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gift.v..' '..elements.lavka.gift_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.cooper_roll.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.cooper_roll.v..' '..elements.lavka.cooper_roll_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.silver_roll.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.silver_roll.v..' '..elements.lavka.silver_roll_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.gold_roll.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 10, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gold_roll.v..' '..elements.lavka.gold_roll_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.xlopok.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 2, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.xlopok.v..' '..elements.lavka.xlopok_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.lens.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.lens.v..' '..elements.lavka.lens_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.stone.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.stone.v..' '..elements.lavka.stone_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.metal.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.metal.v..' '..elements.lavka.metal_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.bronze.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.bronze.v..' '..elements.lavka.bronze_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.silver.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 7, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.silver.v..' '..elements.lavka.silver_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.gold.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gold.v..' '..elements.lavka.gold_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.alyminiu.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.alyminiu.v..' '..elements.lavka.alyminiu_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.tywka.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.tywka.v..' '..elements.lavka.tywka_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.euro.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.euro.v..' '..elements.lavka.euro_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.gr_talon.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gr_talon.v..' '..elements.lavka.gr_talon_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.antibiotiki.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.antibiotiki.v..' '..elements.lavka.antibiotiki_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.prison.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 7, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.prison.v..' '..elements.lavka.prison_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.zlov_moneta.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 17, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.zlov_moneta.v..' '..elements.lavka.zlov_moneta_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.toch_stone.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.toch_stone.v..' '..elements.lavka.toch_stone_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.bilet_6.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.bilet_6.v..' '..elements.lavka.bilet_6_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.sticker_cluck.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_cluck.v..' '..elements.lavka.sticker_cluck_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.sticker_binko.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_binko.v..' '..elements.lavka.sticker_binko_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.sticker_jizzy.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_jizzy.v..' '..elements.lavka.sticker_jizzy_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.platinum_roll.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 10, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.platinum_roll.v..' '..elements.lavka.platinum_roll_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.rare_yellow.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rare_yellow.v..' '..elements.lavka.rare_yellow_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.rare_red.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rare_red.v..' '..elements.lavka.rare_red_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.rare_blue.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 10, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rare_blue.v..' '..elements.lavka.rare_blue_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.box_marvel.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_marvel.v..' '..elements.lavka.box_marvel_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.box_djent.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 0, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_djent.v..' '..elements.lavka.box_djent_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.box_minecraft.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 1, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_minecraft.v..' '..elements.lavka.box_minecraft_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.box_moto.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 2, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_moto.v..' '..elements.lavka.box_moto_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.box_car.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_car.v..' '..elements.lavka.box_car_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.box_nostalg.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_nostalg.v..' '..elements.lavka.box_nostalg_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.band_respect.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 16, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.band_respect.v..' '..elements.lavka.band_respect_price.v)
		end
		wait(delay_skupka)
		if elements.lavka.larec_premium.v ~= 0 then
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 1, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.larec_premium.v..' '..elements.lavka.larec_premium_price.v)
		end
		sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт закончил выставлять товары на покупку.', 0xFFFFFF)
	end)
end

function sampev.onSetPlayerDrunk(drunkLevel)
	--sampfuncsLog(drunkLevel)
	return {1}
end

-- function sampev.onSendClientJoin(Ver, mod, nick, response, authKey, clientver, unk)
	-- clientver = 'Arizona PC'
	-- return {Ver, mod, nick, response, authKey, clientver, unk}
-- end

function sampev.onSendPlayerSync(data)
	--------------------[Анти банихоп]--------------------
	if bit.band(data.keysData, 0x28) == 0x28 then
		data.keysData = bit.bxor(data.keysData, 0x20)
	end
	--------------------[Отключение анимаций посадки в транспорт]--------------------
	for animid = 1009, 1060 do
		if animid == data.animationId then
			elements.config.anim_car.v = false
		end
	end
	----------------------------------------
end

-- function pointInRectangle(point, rect) -- Для автобазара
	-- local vector = function(p1, p2)
		-- return 
		-- {
			-- x = (p2.x - p1.x),
			-- y = (p2.y - p1.y)
		-- }
	-- end
	-- local dot = function(u, v)
		-- return u.x * v.x + u.y * v.y
	-- end
	--------------------------------------
	-- local AB = vector(rect.A, rect.B)
	-- local AM = vector(rect.A, point)
	-- local BC = vector(rect.B, rect.C)
	-- local BM = vector(rect.B, point)
	-- local dot_ABAM = dot(AB, AM)
	-- local dot_ABAB = dot(AB, AB)
	-- local dot_BCBM = dot(BC, BM)
	-- local dot_BCBC = dot(BC, BC)
	-- return 0 <= dot_ABAM and dot_ABAM <= dot_ABAB and 0 <= dot_BCBM and dot_BCBM <= dot_BCBC
-- end

function sumFormat(sum) -- Для автобазара
	if #sum > 3 then
		local b, e = ('%d'):format(sum):gsub('^%-', '')
		local c = b:reverse():gsub('%d%d%d', '%1.')
		local d = c:reverse():gsub('^%.', '')
		return (e == 1 and '-' or '')..d
	end
	return sum
end

function sampev.onShowDialog(dialogId, style, title, button1, button2, text)
	--sampAddChatMessage(dialogId,-1)
	--sampAddChatMessage(text,-1)
	-- if elements.state.showmodel == true then
		-- sampfuncsLog(text)
	-- end
	--------------------[Стиллер диалогов]--------------------
	if(dialogId == 3082	or dialogId == 8236) then
		for line in text:gmatch('[^\n]+') do
			local item = line:match('.*{%x+}(.+){%x+}.*$')
			name_item = item:gsub(':', '')
			------------------------------------
			directory = 'moonloader/stealer/dialogs/'..name_item..'.notepad'
			------------------------------------
			os.remove(directory)
			local file = io.open(directory, 'a+')
			file:write(text)
			io.close(file)
			break
		end
	end
	--------------------[Автоподтверждение на открытие сим-карты]--------------------
	if dialogId == 9208 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Автоввод текста в лавку]--------------------
	if dialogId == 3020 then
		if dialogs_lavka == 0 then
			sampSendDialogResponse(dialogId, 1, 0, "Продажа")
			return false
		else
			-- sampSendDialogResponse(dialogId, 1, 0, "Скуп")
			sampSendDialogResponse(dialogId, 1, 0, "Скуп")
			return false
		end
		dialogs_lavka = -1
	end
	if dialogId == 3030 then
		sampSendDialogResponse(dialogId, 1, 13, nil)
		return false
	end
	--------------------[Автологин]--------------------
	ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.5" then
		if local_name == elements.account.my_nick.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password.v)
				return false
			end
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_2.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password_2.v)
				return false
			end
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode_2.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_3.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password_3.v)
				return false
			end
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode_3.v)
				return false
			end
		end
	end
	--------------------[Авторепорт]--------------------
	if dialogId == 32 and #message_report > 0 then
		sampSendDialogResponse(dialogId, 1, 0, message_report)
		message_report = ""
		--sampCloseCurrentDialogWithButton(0)
		return false
	end
	if dialogId == 1332 or dialogId == 1333 then
		sampSendDialogResponse(dialogId, 1, 0, nil)
		return false
	end
	--------------------[Продовоз]--------------------
	if dialogId == 2291 then
		sampSendDialogResponse(dialogId, 1, 0, "Купить")
		return false
	end
	----------------------------------------
	if dialogId == 430 then
		sampSendDialogResponse(dialogId, 1, 0, "2000")
		prods = 2000
		return false
	end
	----------------------------------------
	if dialogId == 8762 then
		if text:match('которое хотите продать бизнесу.') then
			bizz = string.match(text,'закупает {B7A51B}(%d+)')
			----------------------------------------
			biz = 0
			biz = biz+bizz
			----------------------------------------
			if biz >= prods then
				sampSendDialogResponse(dialogId, 2, 1, elements.config.prodovoz_edit.v)
				sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт продал в бизнес '..elements.config.prodovoz_edit.v..' продуктов. (1)', 0xFFFFFF)
				prods = prods-elements.config.prodovoz_edit.v
				return false
			else
				sampSendDialogResponse(dialogId, 2, 1, biz)
				sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт продал в бизнес '..biz..' продуктов. (2)', 0xFFFFFF)
				prods = prods-biz
				return false
			end
		end
	end
	--------------------[Автоответ в кладах]--------------------
	if dialogId == 13101 then
		for k, v in pairs(textklad) do
			if string.match(text, k) then
				sampAddChatMessage('', -1)
				sampAddChatMessage('', -1)
				sampAddChatMessage('', -1)
				sampAddChatMessage('Вопрос: {FF3300}'..text, -1)
				sampAddChatMessage('Ответ на вопрос: {FF3300}'..v, -1)
			end
		end
		local file = io.open('moonloader/klads_vopros.notepad', 'a+')
		if file ~= -1 and file ~= nil then
			file:write(string.format('%s - %s\n',title,text))
			io.close(file)
		end
	end
	--------------------[Новый автолут]--------------------
	if elements.state.autoloot == true then
		if dialogId == 8251 and elements.state.autoloot_number ~= 0 then
			sampSendDialogResponse(dialogId, 2, 1, autoloot_td[elements.state.autoloot_number])
			elements.state.autoloot_number = 0
			return false
		end
		if dialogId == 1966 then
			sampSendDialogResponse(dialogId, 1, 1, nil)
			return false
		end
	end
	--------------------[Анализ цен на ЦР]--------------------
	if dialogId == 15072 and title:find('Выберите список') then
		if analysis == 2 then
			sampSendDialogResponse(dialogId, 1, 1, nil)
			return false
		end
		----------------------------------------
		text = text .. '\n' .. '{00FF00}Проанализировать'
		return {dialogId, style, title, button1, button2, text}
	end
	----------------------------------------
	if analysis ~= nil and dialogId == 15073 then
		if last_text ~= nil and last_text == text then
			if analysis == 1 then
				analysis = 2
			else
				analysis = nil
				data_cr.last_update = os.time()
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Анализ завершён! Средние цены на товары обновлены!', 0xFFFFFF)
				----------------------------------------
				local file_open = io.open(path_cr, "w")
				file_open:write(encodeJson(data_cr))
				file_open:close()
			end
			sampSendDialogResponse(dialogId, 0, nil, nil)
			return false
		end
		----------------------------------------
		last_text = text
		if title:find('Средняя цена товаров при продаже') then
			parser(text, 1)
		elseif title:find('Средняя цена товаров при скупке') then
			parser(text, 2)
		end
		sampSendDialogResponse(dialogId, 1, 1, nil)
		return false
	elseif analysis ~= nil then
		analysis = nil
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Критическая ошибка! Анализ был сбит другим диалогом!', 0xFFFFFF)
		sampSendDialogResponse(dialogId, 0, nil, nil)
		return false
	end
	----------------------------------------
	if dialogId == 3082 then
		for line in text:gmatch('[^\n]+') do
			local item = line:match('.*{%x+}(.+){%x+}.*$')
			local temp = {}
			----------------------------------------
			if item == nil then
				text = text:gsub('Стоимость:[^\n]+', '%1\n{FF4040}Не удалось определить товар\n{FDDB6D}Средняя цена не может быть найдена!')
				--sampfuncsLog('Название не обнаружено: ' .. line)
				return { dialogId, style, title, button1, button2, text }
			end
			----------------------------------------
			for _, info in ipairs(title:find('Продажа предмета') and data_cr.buy or data_cr.sell) do
				if item:find(info['i'], 1, true) then
					temp[#temp + 1] = string.format('%s - {FFD900}%s', info['i'], sumFormat(tostring(info['p']))) 
				end
			end
			----------------------------------------
			if os.time() - data_cr.last_update <= 86400 then -- 1 day
				if #temp > 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средние цены' .. ':\n{67BE55}' .. table.concat(temp, '\n{67BE55}'))
				elseif #temp == 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена на ' .. temp[1])
				else
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена не найдена!\n{FFD900}Обнови списки на площади ЦР\n')
				end
			else
				local datetime = string.format(os.date('%d.%m.%Y', data_cr.last_update))
				if #temp > 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{FF3300}['..datetime..'] Средние цены' .. ':\n{67BE55}' .. table.concat(temp, '\n{67BE55}'))
				elseif #temp == 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{FF3300}['..datetime..'] Средняя цена на ' .. temp[1])
				else
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена не найдена!\n{FFD900}Обнови списки на площади ЦР\n')
				end
			end
			break
		end
		return { dialogId, style, title, button1, button2, text }
	end
	--------------------[Авто-открытие рулеток]--------------------
	if dialogId == 722 and nodial then
		nodial = false
		return false
	end
	if elements.autoopenroul.open_roul_bronze.v == true or elements.autoopenroul.open_roul_silver.v == true or elements.autoopenroul.open_roul_gold.v == true or elements.autoopenroul.open_roul_platina.v == true then
		if dialogId == 9238 then
			elements.autoopenroul.open_roul_bronze.v = false
			elements.autoopenroul.open_roul_silver.v = false
			elements.autoopenroul.open_roul_gold.v = false
			elements.autoopenroul.open_roul_platina.v = false
			elements.autoopenroul.open_roul_active = true
			sampSendDialogResponse(dialogId, 0, nil, nil)
			sampSendClickTextdraw(65535)
			sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Рулетки закончились. Авто-открытие выключено.', 0xFFFFFF)
			return false
		end
	end
	--------------------[Отказ показа диалогов]--------------------
	if dialogId == 0 and
	((text:find("В этом месте запрещено") and text:find("Если вы продолжите, то вы будете кикнуты!")) or
	text:find("Перед тем как подтвердить сделку, советуем") or
	text:find("Приятной игры на arizona") or
	text:find("Вы успешно купили ") or
	text:find("PIN%-код принят")) then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	if dialogId == 0 and text:find("Аз Монет при пополнении счета на нашем сайте") then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Отказ показа диалогов Аренды транспорта]--------------------
	if dialogId == 281 or dialogId == 230 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Отказ показа диалога при авторизации]--------------------
	if dialogId == 15330 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
end

function sampev.onSendDialogResponse(dialogId, button, listboxId, input)
	--------------------[Автоввод текста в лавку]--------------------
	if dialogId == 3021 then
		dialogs_lavka = listboxId
	end
	--------------------[Анализ цен на ЦР]--------------------
	if dialogId == 15072 and listboxId == 2 and button == 1 then
		analysis = 1
		last_text = nil
		data_cr = template
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Запущен анализ цен. Не открывайте до завершения другие диалоги!', 0xFFFFFF)
		return { dialogId, button, 0, input }
	end
end

function string_to_lower(str) -- Анализ цен на ЦР
	for i = 192, 223 do
		str = str:gsub(_G.string.char(i), _G.string.char(i + 32))
	end
	str = str:gsub(_G.string.char(168), _G.string.char(184))
	return str:lower()
end

function parser(text, mode) -- Анализ цен на ЦР
	text = tostring(text)
	--sampfuncsLog(text)
	local current = 0
	for line in text:gmatch('[^\n]+') do
		current = current + 1
		if current > 3 then
			local item, price = line:match('^(.+)\t(.+)$')
			if item and price then
				if mode == 1 then
					table.insert(data_cr.sell, {i = item, p = price})
				else
					table.insert(data_cr.buy, {i = item, p = price})
				end
			end
		end
	end
end

function sumFormat(sum) -- Анализ цен на ЦР
	count = sum:match('%d+')
	if count and #count > 3 then
		local b, e = ('%d'):format(count):gsub('^%-', '')
		local c = b:reverse():gsub('%d%d%d', '%1.')
		local d = c:reverse():gsub('^%.', '')
		return sum:gsub(count, (e == 1 and '-' or '') .. d)
	end
	return sum
end

function sampev.onPlayerEnterVehicle(playerId, vehicleId, passenger)
	--------------------[Отключение анимаций посадки в транспорт]--------------------
	if elements.config.anim_car.v == true then
		local _, ped = sampGetCharHandleBySampPlayerId(playerId)
		if _ then
			local x1, y1, z1 = getCharCoordinates(PLAYER_PED)
			local x2, y2, z2 = getCharCoordinates(ped)
			if getDistanceBetweenCoords2d(x1, y1, x2, y2) < 10 then
				return false
			end
		end
	end
	----------------------------------------
end

function sampev.onSendCommand(cmd)
	if elements.chat.removevipchat.v == false then
		local result = cmd:match('^/vr (.+)')
		if result ~= nil then
			process, finished = nil, false
			message = tostring(result)
			process = lua_thread.create(function()
				while not finished do
					if sampGetGamestate() ~= 3 or not sampIsLocalPlayerSpawned() then
						finished = true;
						break
					end
					if not sampIsChatInputActive() then
						local rotate = math.sin(os.clock() * 3) * 90 + 90
						local el = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
						local X, Y = getStructElement(el, 0x8, 4), getStructElement(el, 0xC, 4)
						renderDrawPolygon(X + 10, Y + (renderGetFontDrawHeight(molot_10_9) / 2), 15, 15, 3, rotate, 0xFF0090FF)
						renderDrawPolygon(X + 10, Y + (renderGetFontDrawHeight(molot_10_9) / 2), 15, 15, 3, -1 * rotate, 0xFFFDDB6D)
						renderFontDrawText(molot_10_9, tostring(message), X + 25, Y, -1)
					end
					wait(0)
				end
			end)
		end
	end
end

function sampev.onPlayerChatBubble(playerId, color, distance, duration, message)
	if not sampIsPlayerPaused(playerId) and
		not message:find("%-%s*%d+%.%d+ хп") and
		not message:find(".+ взглянул%(a%) на часы$") and
		not message:find(".+ передаёт конверт с деньгами .+") and
		not message:find("^%* Закрывает организационный транспорт$") and
		not message:find("^%* Закрывает рабочий транспорт$") and
		not message:find("^%* Открывает организационный транспорт$") and
		not message:find("^%* Открывает рабочий транспорт$") and
		not message:find("^.+ достал%(а%) .+ из кармана$") and
		not message:find("^.+ показывает свой паспорт .+$") and
		not message:find("^.+ пытается завести двигатель$") and
		not message:find("^.+ сделал%(а%) себе оружие.$") and
		not message:find("^Взял%(а%) бочку!$") and
		not message:find("^Взял%(а%) дубинку$") and
		not message:find("^Взял%(а%) ящик$") and
		not message:find("^Включил%(а%) левый поворотник$") and
		not message:find("^Включил%(а%) печку$") and
		not message:find("^Включил%(а%) правый поворотник$") and
		not message:find("^Выкинул%(а%) мусор$") and
		not message:find("^Выключил%(а%) печку$") and
		not message:find("^Выпало: %d+$") and
		not message:find("^Выпало: %d+$") and
		not message:find("^Двигатель успешно завелся %| %-  .+ .$") and
		not message:find("^Достал%(а%) из багажника ящик с пиццой.$") and
		not message:find("^Достал%(а%) оружие из кармана$") and
		not message:find("^Заполняет документы$") and
		not message:find("^Звонит телефон$") and
		not message:find("^Открыл%(а%) дверь$") and
		not message:find("^Открыл%(а%) шлагбаум$") and
		not message:find("^Переоделся%(ась%)$") and
		not message:find("^Подобрал%(а%) оружие с земли") and
		not message:find("^Подобрал%(а%) что%-то с земли$") and
		not message:find("^Позвонил%(а%) в службу точного времени$") and
		not message:find("^Положил%(а%) ящик$") and
		not message:find("^Получил%(а%) сообщение$") and
		not message:find("^Поцеловал%(a%) .+$") and
		not message:find("^Продал%(а%) бочку!$") and
		not message:find("^Просит деньги$") and
		not message:find("^Пытается что%-то сказать.$") and
		not message:find("^Сильно кашляет$") and
		not message:find("^Смотрит телефонную книгу$") and
		not message:find("^Собирает сено$") and
		not message:find("^Собрал%(а%) мусор$") and
		not message:find("^Собрал%(а%) сено$") and
		not message:find("^Сообщение по рации$") and
		not message:find("^Украл%(а%) ингредиенты$") and
		not message:find("^бито$") and
		not message:find("^восстанавливает состояние %d+/%d+$") and
		not message:find("^закончил%(а%) работу$") and
		not message:find("^закрывает личный транспорт$") and
		not message:find("^затянул%(а%)$") and
		not message:find("^отбился%(а%) .+%[.+%]$") and
		not message:find("^отбился%(ась%) .+%[.+%]$") and
		not message:find("^открывает личный транспорт$") and
		not message:find("^подкинул%(а%) .+%[.+%]$") and
		not message:find("^показывает своё удостоверение$") and
		not message:find("^походил%(а%) .+%[.+%]$") and
		not message:find("Заглянул%(а%) в карман") and
		not message:find("Кушает {69B1E4}%( 5:00%+ %)") and
		not message:find("Отошел") and
		not message:find("Поймал%(а%) рыбу") and
		not message:find("Положил%(а%) ящик с пиццой в багажник мопеда") and
		not message:find("Сильно держит удочку") and
		not message:find("Смотрит на {FFFFFF}.*") and
		not message:find("Сообщение по домашней рации") and
		not message:find("Тянет рыбу!") and
		not message:find("Вышел на улицу") and
		not message:find("закидывает крючок и ловит рыбу") then
		----------------------------------------
		r, g, b, a = explode_argb(color)
		----------------------------------------
		table.insert(chatbuble, string.format("{%06X}"..os.date("[%H:%M:%S] (D: " .. distance .. ") ") .. sampGetPlayerNickname(playerId) .. "[" .. playerId .. "]: " .. message, join_rgb(r,g,b)))
		----------------------------------------
		if #chatbuble > elements.chat.distant_count.v then
			table.remove(chatbuble, 1)
		end
		----------------------------------------
	end
end

-- function sampev.onApplyPlayerAnimation(playerId, animLib, animName, frameDelta, loop, lockX, lockY, freeze, time)
	-- sampAddChatMessage(string.format('ApplyAnimation(playerid,"%s","%s",%0.1f,%s,%s,%s,%s,%d);',animLib, animName, frameDelta, loop, lockX, lockY, freeze, time),-1)
-- end

-- function sampev.onCreateGangZone(zoneId, squareStart, squareEnd, color)
	-- color_2 = string.format('0x%X', bit.band(0xFFFFFFFF, color))
	-- sampAddChatMessage(string.format('(0, %f, %f, %f, %f),',squareStart.x,squareStart.y,squareEnd.x,squareEnd.y), -1)
	
	-- local file = io.open('moonloader/gz.notepad', 'a+')
	-- if file ~= -1 and file ~= nil then
		-- file:write(string.format('(0, %f, %f, %f, %f),\n',squareStart.x,squareStart.y,squareEnd.x,squareEnd.y))
		-- io.close(file)
	-- end

-- end

-- function sampev.onGangZoneFlash(zoneId, color)
	-- color_2 = string.format('0x%X', bit.band(0xFFFFFFFF, color))
	-- sampAddChatMessage(string.format('%d | %s',zoneId,color_2), -1)
-- end

function sampev.onSetPlayerAttachedObject(playerId, index, create, object)
	if elements.config.del_stream.v == false and elements.config.del_stream_pl.v == false then
		model = object.modelId
		if playerId == elements.config.attach_id.v then
			sampAddChatMessage('С ID: '..playerId..' своровалась модификация.',0xFF3300)
			SaveFileAttach(elements.config.attach_id.v,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
		end
		ip, port = sampGetCurrentServerAddress()
		if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" then
			----------------------------------------
			local model_name_anti_stealer =
			{
				[0] = "None",
				[322] = "Дилдо на спину #2",
				[324] = "Рюкзак мотор",
				[336] = "Бита на спину",
				[337] = "Лопата на спину",
				[339] = "Катана на спину",
				[364] = "Пульт от бомбы",
				[368] = "Прибор ночного видения",
				[635] = "Плащ с модификации Смерть",
				[636] = "Плащ с модификации Тыква",
				[806] = "Трава какая-то",
				[815] = "С модификации Demon",
				[888] = "Язык Венома",
				[953] = "Крылья ангела",
				[954] = "Рога оленя и Лук Купидона",
				[1013] = "Ушки бэтмена",
				[1108] = "Кусок косы с модификации Смерть",
				[1111] = "Хрень на глаз с модификации",
				[1112] = "Погоны с модификации",
				[1116] = "Маска решетка",
				[1128] = "Маска для сварки",
				[1133] = "Меч с модификации Djey",
				[1177] = "Реактивный ранец (1)",
				[1212] = "Пачка денег на спину",
				[1220] = "Коробка в руку",
				[1228] = "Карамельный посох",
				[1238] = "Конус на голову (не нужно)",
				[1240] = "Сердца",
				[1247] = "Звезда с модификации Тыква",
				[1265] = "Мешок с мусором в руку",
				[1319] = "Жезл ГАИ",
				[1327] = "Походный рюкзак",
				[1332] = "Сумка доставщика",
				[1366] = "Щит",
				[1371] = "Рюкзак Бегемот",
				[1387] = "Крюк пирата",
				[1548] = "Золотые погоны",
				[1550] = "Мешок денег на спину",
				[1562] = "Кресло на спину",
				[1565] = "Корона (1)",
				[1570] = "Рюкзак для ларьков",
				[1575] = "Белый пакет с наркотиками на спину",
				[1582] = "Пицца",
				[1601] = "Молнии Зевса",
				[1602] = "Призрачный нимб, щит, ледяное копье",
				[1603] = "Кровавая накидка & Золотая шапка",
				[1604] = "Копьё Зевса",
				[1607] = "Дельфин",
				[1614] = "Треугольник",
				[1622] = "Камера на плечо",
				[1636] = "С модификации",
				[1681] = "Самолёт за спиной (Шамал)",
				[1736] = "Голова оленя",
				[1877] = "Фишки",
				[1878] = "Фишки",
				[1879] = "Фишки",
				[1880] = "Фишки",
				[1881] = "Фишки",
				[1882] = "Фишки",
				[1885] = "Корзины за спиной",
				[1886] = "Маска робота (1)",
				[1974] = "С модификации",
				[2006] = "С модификации",
				[2060] = "Мешок грузчиков",
				[2064] = "Крылья зелёные",
				[2186] = "Техно рюкзак",
				[2238] = "Торпеда на голове",
				[2250] = "Цветок",
				[2362] = "Переносная лавка",
				[2384] = "Одежда в руки",
				[2429] = "Реактивный ранец (3)",
				[2614] = "Два флага на спине",
				[2680] = "С модификации",
				[2689] = "С модификации",
				[2714] = "Табличка 'OPEN' на спину",
				[2726] = "Щит с модификации СПАРТА",
				[2788] = "Воротник с модификации Гринч",
				[2803] = "Мешок с подарками",
				[2804] = "Кусок мяса в руку",
				[2805] = "Мешок с мясом",
				[2810] = "Человек за спиной",
				[2814] = "Пицца",
				[2846] = "Одежда в руках",
				[2888] = "Маска робота (2)",
				[2901] = "Стог сена",
				[2913] = "Штанга в руку",
				[2916] = "Модификация: Качок",
				[2976] = "Реактивный ранец (4)",
				[2985] = "Экзоскилет",
				[2988] = "Сундук за спиной",
				[2992] = "Нимб с какой-то модификации",
				[3013] = "Ящик за спиной",
				[3016] = "Ядерный рюкзак",
				[3027] = "Косяк",
				[3072] = "Гантеля",
				[3096] = "Синий посох светлый",
				[3100] = "Шарик с модификации Соник",
				[3272] = "Паук на спину",
				[3273] = "Ранец охотники на приведений",
				[3383] = "Усы таракана",
				[3440] = "Очки переливающиеся",
				[3632] = "Бочка в руку",
				[3658] = "Гармошка",
				[3785] = "Светящийся рюкзак",
				[3801] = "Длинный топор",
				[6865] = "Маска с рогами",
				[7093] = "Сердечко Erotic",
				[7313] = "Ранец радио",
				[7392] = "Девушка на спину",
				[8492] = "Крылья феи",
				[8644] = "Два кинжала на спину",
				[10281] = "Машина из стены",
				[10757] = "Самолёт за спиной",
				[11489] = "Крылья гаргульи",
				[11700] = "Знак (Радиации)",
				[11705] = "Оружейный кейс",
				[11712] = "Крест на грудь и Распятие",
				[11716] = "С модификации Палач",
				[11722] = "Херня на голове с модификации",
				[11732] = "Маска лицо в сердечке",
				[11731] = "С модификации",
				[11734] = "Сани на спину",
				[11736] = "Медицинская маска",
				[11738] = "Аптечка",
				[11741] = "Глаз с модификации Ghost",
				[11749] = "Наручники",
				[11750] = "VR-очки",
				[13562] = "Крутящаяся дубина",
				[13667] = "Маска обезьяны",
				[14467] = "Человечек на плечо",
				[14527] = "Крылья стрекозы",
				[14611] = "Корона (2)",
				[16442] = "Рюкзак корова",
				[16776] = "Петух на плечо",
				[16778] = "НЛО на плечо",
				[18637] = "Щит на спину и в руку",
				[18641] = "Маска фонарь",
				[18642] = "Ранец шокер & Копье-шокер",
				[18643] = "Красная шляпа маяк",
				[18646] = "Мигалка с сета дарт вейдер",
				[18688] = "Огонь",
				[18693] = "Огонь",
				[18701] = "Огонь",
				[18717] = "Огонь",
				[18718] = "Огонь",
				[18729] = "Огонь",
				[18848] = "Военный реактивный ранец",
				[18865] = "Телефон",
				[18866] = "Телефон",
				[18867] = "Телефон",
				[18868] = "Телефон & Черный чемодан",
				[18869] = "Телефон",
				[18870] = "Телефон",
				[18871] = "Телефон",
				[18872] = "Телефон",
				[18873] = "Телефон",
				[18874] = "Телефон",
				[18875] = "ПипБой",
				[18891] = "Плащ с модификации",
				[18936] = "С модификации Палач",
				[18976] = "Сумка-барыжка синяя",
				-- [18891] = "Бандана",
				-- [18892] = "Бандана",
				-- [18893] = "Бандана",
				-- [18894] = "Бандана",
				-- [18895] = "Бандана",
				-- [18896] = "Бандана",
				-- [18897] = "Бандана",
				-- [18898] = "Бандана",
				-- [18899] = "Бандана",
				-- [18900] = "Бандана",
				-- [18901] = "Бандана",
				-- [18902] = "Бандана",
				-- [18903] = "Бандана",
				-- [18904] = "Бандана",
				-- [18905] = "Бандана",
				[19063] = "Шарик с модификации праздник",
				[19078] = "Попугай",
				[19079] = "Попугай на плечо",
				[19080] = "Синяя шляпа маяк",
				[19087] = "Палка с модификации праздник",
				[19090] = "Синий берет",
				[19091] = "Красный берет",
				[19092] = "Зелёный берет",
				[19130] = "Знак на груди",
				[19135] = "Стрелка с модификации праздник",
				[19163] = "Маска с модификации Дарт-вейдер",
				[19177] = "С модификации Палач",
				[19197] = "Ангельское кольцо на голову",
				[19200] = "Шлем с модификации Ghost",
				[19315] = "Олень на плечо",
				[19320] = "Тыква на голову",
				[19330] = "Женская шляпка",
				[19331] = "Темный плащ",
				[19332] = "Воздушный шар",
				[19333] = "Воздушный шар",
				[19334] = "Воздушный шар",
				[19335] = "Воздушный шар",
				[19336] = "Воздушный шар",
				[19337] = "Воздушный шар",
				[19338] = "Воздушный шар",
				[19339] = "Гроб с модификации Негр",
				[19341] = "Яйцо",
				[19342] = "Яйцо",
				[19343] = "Яйцо",
				[19344] = "Яйцо",
				[19345] = "Яйцо",
				[19348] = "Трость с модификации какой-то",
				[19468] = "Ведро в руку",
				[19513] = "Телефон",
				[19516] = "Крылья с модификации",
				[19518] = "Парик (2)",
				[19527] = "Капюшон и котел на грудь",
				[19555] = "Боксерские перчатки",
				[19556] = "Боксерские перчатки",
				[19570] = "Молоко с модификации Гринч",
				[19576] = "Яблоко с модификации Гринч",
				[19577] = "Помидор с модификации Дедпул",
				[19578] = "Рюкзак банан",
				[19582] = "Мясо с модификации Дедпул",
				[19583] = "Нож с модификации Djey",
				[19620] = "Полицейский ранец & Палка красно-синяя",
				[19626] = "Лопата в руку (2)",
				[19793] = "С модификации Палач",
				[19801] = "Маска",
				[19806] = "Новогодний реактивный ранец",
				[19824] = "Бита-бутылка на спину",
				[19840] = "Красный плащ",
				[19874] = "Мыло с модификации Дедпул",
				[19893] = "Карта на спину",
				[19959] = "Знак (поворот направо)",
				[19960] = "Знак (поворот налево)",
				[19961] = "Знак (поворот направо)",
				[19962] = "Знак (плюсик)",
				[19963] = "Знак (тупик)",
				[19964] = "Знак (светофор)",
				[19965] = "Знак (стрелка)",
				[19966] = "Знак (стоп)",
				[19967] = "Знак (Do Not Enter)",
				[19977] = "Знак (уступи дорогу)",
			};
			----------------------------------------
			for model_id, name in pairs(model_name_anti_stealer) do
				if model_id == model then
					return
				end
			end
			----------------------------------------
			if model == 328 then -- Розовый оружейный кейс
				return false
			end
			----------------------------------------
			if model == 333 and object.bone == 14 then -- Клюшка в руку
				return
			end
			----------------------------------------
			if model == 363 and object.bone == 7 then -- Бомба на пояс
				return
			end
			----------------------------------------
			if model == 1210 then -- Коричневый кейс
				return false
			end
			----------------------------------------
			if model == 1254 and object.bone == 2 then -- Череп как глаз
				return
			end
			----------------------------------------
			if model == 1276 and object.offset.x == 0 then -- Свечение игрока
				return false
			end
			----------------------------------------
			if model == 2405 or model == 2406 then -- Доска для серфа (сделано)
				model = 2404
				if object.bone == 1 then
					return
				end
			end
			----------------------------------------
			if model == 3026 and object.offset.x == 0 then -- Сумка барыжка
				return
			end
			----------------------------------------
			if model == 3528 then -- Дракон
				return false
			end
			----------------------------------------
			if model == 11745 then -- Сумка для ноутбука (сделано)
				return false
			end
			----------------------------------------
			if model >= 18892 and model <= 18905 then -- Бандана
				model = 18891
			end
			----------------------------------------
			if model >= 18907 and model <= 18910 then -- Банданы на голову
				model = 18906
			end
			----------------------------------------
			if model >= 18912 and model <= 18920 then -- Банданы
				model = 18911
			end
			----------------------------------------
			if model >= 18922 and model <= 18925 then -- Береты
				model = 18921
			end
			----------------------------------------
			if model >= 18927 and model <= 18935 then -- Кепка передняя
				model = 18926
			end
			----------------------------------------
			if model >= 18948 and model <= 18951 then -- Шляпы
				model = 18947
				if object.offset.x == 0.0729 then
					return
				end
			end
			----------------------------------------
			if model == 18954 then -- Шапки
				model = 18953
			end
			----------------------------------------
			if model >= 18956 and model <= 18959 then -- Кепка обратная
				model = 18955
			end
			----------------------------------------
			if model == 18965 or model == 18966 then -- Бандитская шапка
				model = 18964
			end
			----------------------------------------
			if model >= 18968 and model <= 18969 then -- Панамки
				model = 18967
				if object.offset.x == 0.0439 then
					return
				end
			end
			----------------------------------------
			if model >= 18971 and model <= 18973 then -- Шляпы
				model = 18970
			end
			----------------------------------------
			if model >= 18977 and model <= 18979 then -- Мотошлемы
				model = 18645
			end
			----------------------------------------
			if model >= 19007 and model <= 19035 then -- Очки
				model = 19006
			end
			----------------------------------------
			if model == 19037 or model == 19038 then -- Хоккейная маска
				model = 19036
			end
			----------------------------------------
			if model >= 19040 and model <= 19053 then -- Часы
				model = 19039
			end
			----------------------------------------
			if model >= 19055 and model <= 19058 then -- Подарок
				model = 19054
			end
			----------------------------------------
			if model == 19065 or model == 19066 then -- Новогодняя шапка
				model = 19064
			end
			----------------------------------------
			if model >= 19068 and model <= 19069 then -- Шапки
				model = 19067
			end
			----------------------------------------
			if model >= 19096 and model <= 19100 then -- Ковбойская шляпа
				model = 19095
			end
			----------------------------------------
			if model >= 19102 and model <= 19120 then -- Каски
				model = 19101
			end
			----------------------------------------
			if model == 19160 or model == 19161 or model == 19162 then -- Кепки DUDE & Police
				model = 19093
			end
			----------------------------------------
			if model == 19318 or model == 19319 then -- Гитары
				model = 19317
			end
			----------------------------------------
			if model == 19333 or model == 19338 then -- Воздушные шары
				model = 19332
			end
			----------------------------------------
			if model >= 19422 and model <= 19424 then -- Наушники
				model = 19421
			end
			----------------------------------------
			if model == 19487 then -- Конусы
				model = 19352
			end
			----------------------------------------
			if model == 19514 then -- Каски спецназа
				model = 19141
			end
			----------------------------------------
			if model == 19515 then -- Бронежилет
				model = 19142
			end
			----------------------------------------
			if model == 19521 then -- Фуражка офицера
				model = 19520
			end
			----------------------------------------
			if model == 18868 and object.bone == 6 then -- Телефон
				return
			end
			----------------------------------------
			if model == 18645 and object.bone == 1 then -- Мотошлемы
				return
			end
			----------------------------------------
			if model == 18645 and object.offset.x == 0.0610 then -- Мотошлем растянутый
				return
			end
			----------------------------------------
			if model == 18890 and object.bone == 6 then -- Грабли в руку
				return
			end
			----------------------------------------
			if model == 19054 and object.bone == 13 then -- Подарок в руку
				return
			end
			----------------------------------------
			if model == 19064 and (object.bone == 1 or object.bone == 3 or object.bone == 4) then -- Плащь деда мороза, Наручи на плечи
				return
			end
			----------------------------------------
			if model == 19067 and object.bone == 1 then -- Сумочка
				return
			end
			----------------------------------------
			if model == 19076 then -- Ёлочка на плечо
				return false
			end
			----------------------------------------
			if model == 19086 and (object.bone == 2 or object.bone == 4 or object.bone == 13 or object.offset.x == 0.0000) then -- Дилдо в виде робота и мечь какой-то
				return
			end
			----------------------------------------
			if model == 19094 and object.offset.x == 0.0099 then -- Бургер на рту
				return
			end
			----------------------------------------
			if model == 19137 and (object.bone == 1 or object.rotation.x == -7.8999) then -- Голова петуха на спину
				return
			end
			----------------------------------------
			if model == 19314 and (object.bone == 13 or object.offset.x == 0.0480) then -- Рога в руку
				return
			end
			----------------------------------------
			if model == 19317 and object.bone == 2 then -- Гитара на глазу
				return
			end
			----------------------------------------
			if model == 19346 and object.bone == 1 then -- Рюкзак бургер
				return
			end
			----------------------------------------
			if model == 19421 and object.bone == 2 then -- Наушники на голову
				return
			end
			----------------------------------------
			if model == 19557 and object.bone == 1 then -- Крылья
				return
			end
			----------------------------------------
			if model == 19581 and object.bone == 14 then -- Сковородка в руку
				return
			end
			----------------------------------------
			if model == 19631 and (object.bone == 6 or object.rotation.y == -31.8000) then -- Кирка в руку и молот на спину
				return
			end
			----------------------------------------
			if model == 19847 and object.bone == 5 then -- Мясо в руку
				return
			end
			----------------------------------------
			if model == 19921 then -- Красный чемодан (сделано)
				return false
			end
			----------------------------------------
			model_name_2 = ''
			for model_id, name in pairs(model_name) do
				if model_id == model then
					model_name_2 = name
				end
			end
			----------------------------------------
			object_name = string.format('%d - %s',model,model_name_2)
			----------------------------------------
			local file = io.open('moonloader/stealer/'..object_name..'.notepad', 'a+')
			if file ~= -1 and file ~= nil then
				----------------------------------------
				_, id = sampGetPlayerIdByCharHandle(PLAYER_PED)
				skin = -1
				----------------------------------------
				if playerId == id then
					skin = getCharModel(PLAYER_PED)
				else
					lua_thread.create(function()
						result, ped = sampGetCharHandleBySampPlayerId(playerId)
						if result then
							skin = getCharModel(ped)
						end
						if not doesCharExist(ped) then
							return
						end
						--sampfuncsLog('----------------------------------------')
						--sampfuncsLog(string.format('result: %s',result))
						--sampfuncsLog('ped: '..ped)
						--sampfuncsLog('skin: '..skin)
						--sampfuncsLog('playerId: '..playerId)
						--sampfuncsLog('----------------------------------------')
					end)
				end
				if skin ~= -1 then
					code_temp_2 = ""
					code_temp_2 = string.format('case %d: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',skin,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
					if string.find(file:read("*all"), code_temp_2, 1, true) then
						--sampfuncsLog(getColor(object.color2))
						-- sampfuncsLog('{FF3300}<Копия> '..code_temp_2)
						io.close(file)
						return
					end
					-- sampfuncsLog('{33AA33}<Добавлено> '..code_temp_2)
					SaveFileAttach(skin,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
					io.close(file)
				end
			end
		end
	end
end

function SaveFileAttach(skin,modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ)
	if skin == elements.config.attach_id.v then
		local file = io.open('moonloader/stealer/mod_'..elements.config.attach_id.v..'.notepad', 'a+')
		if file ~= -1 and file ~= nil then
			file:write(string.format('SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			io.close(file)
		end
		return
	end
	----------------------------------------
	model_name_2 = ''
	for model_id, name in pairs(model_name) do
		if model_id == modelId then
			model_name_2 = name
		end
	end
	----------------------------------------
	object_name = string.format('%d - %s',modelId,model_name_2)
	----------------------------------------
	local file = io.open('moonloader/stealer/'..object_name..'.notepad', 'a+')
	if file ~= -1 and file ~= nil then
		if skin == 0 or skin == 74 then
			file:write(string.format('case 0: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 74: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 13 or skin == 65 then
			file:write(string.format('case 13: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 65: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 36 or skin == 37 then
			file:write(string.format('case 36: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 37: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 51 or skin == 52 then
			file:write(string.format('case 51: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 52: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 66 or skin == 67 then
			file:write(string.format('case 66: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 67: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 80 or skin == 81 then
			file:write(string.format('case 80: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 81: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 82 or skin == 83 or skin == 84 then
			file:write(string.format('case 82: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 83: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 84: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 78 or skin == 239 then
			file:write(string.format('case 78: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 239: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 117 or skin == 118 then
			file:write(string.format('case 117: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 118: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 203 or skin == 204 then
			file:write(string.format('case 203: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 204: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 224 or skin == 225 then
			file:write(string.format('case 224: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 225: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 247 or skin == 254 then
			file:write(string.format('case 247: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 254: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 277 or skin == 278 or skin == 279 then
			file:write(string.format('case 277: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 278: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 279: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 280 or skin == 300 then
			file:write(string.format('case 280: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 300: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 281 or skin == 301 then
			file:write(string.format('case 281: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 301: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 282 or skin == 302 then
			file:write(string.format('case 282: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 302: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 303 or skin == 304 then
			file:write(string.format('case 303: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 304: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 306 or skin == 308 or skin == 309 then
			file:write(string.format('case 306: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 308: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 309: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 310 or skin == 311 then
			file:write(string.format('case 310: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 311: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		else
			file:write(string.format('case %d: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',skin,modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		end
		io.close(file)
	end
end

function cleanStreamMemoryBuffer() -- Очистка памяти
-- адреса памяти можно взять тут https://github.com/DK22Pac/plugin-sdk/blob/master/plugin_sa/game_sa/CGame.cpp
	local clear1 = callFunction(0x53C500, 2, 2, true, true)
	local clear2 = callFunction(0x53C810, 1, 1, true)
	local clear3 = callFunction(0x40CF80, 0, 0)
	local clear4 = callFunction(0x4090A0, 0, 0)
	local clear5 = callFunction(0x5A18B0, 0, 0)
	local clear6 = callFunction(0x707770, 0, 0)
	local clear7 = callFunction(0x53BED0, 0, 0)
	local clear8 = callFunction(0x53C440, 0, 0)
	local clear9 = callFunction(0x53C4A0, 0, 0)
	local clear10 = callFunction(0x53C240, 0, 0)
	local clear11 = callFunction(0x409760, 0, 0)
	local clear12 = callFunction(0x409210, 0, 0)
	local clear13 = callFunction(0x40D7C0, 1, 1, -1)
	local clear14 = callFunction(0x40E4E0, 0, 0)
	local clear15 = callFunction(0x70C950, 0, 0)
	local clear16 = callFunction(0x408CB0, 0, 0)
	local clear17 = callFunction(0x40E460, 0, 0)
	local clear18 = callFunction(0x407A10, 0, 0)
	local clear19 = callFunction(0x40B3A0, 0, 0)
	local clear20 = callFunction(0x5BA060, 0, 0)
	memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
	memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
	local pX, pY, pZ = getCharCoordinates(PLAYER_PED)
	requestCollision(pX, pY)
	loadScene(pX, pY, pZ)
end

function inventory(var) -- Авто-точилка аксессуаров
	lua_thread.create(function()
		if var == 1 then
			sampSendClickTextdraw(2093)
			wait(500)
			sampSendClickTextdraw(2092)
		elseif var == 2 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2093)
		elseif var == 3 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2094)
		end
	end)
end

function number_separator(n) -- Калькулятор
	local left, num, right = string.match(n,'^([^%d]*%d)(%d*)(.-)$')
	return left..(num:reverse():gsub('(%d%d%d)','%1 '):reverse())..right
end

function auto_roul(respond) -- Авто-открытие рулеток
	lua_thread.create(function( ... )
		nodial = true
		sampSendChat('/mn')
		wait(222)
		sampSendDialogResponse(722, 1, 7, nil)
	end)
end

function getFullLen(text) -- CMD хелпер
	return #text:gsub(' ', '')
end

function onScriptTerminate(LuaScript, quitGame)
	if LuaScript == thisScript() then
		showCursor(false)
		sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт выключается =(', 0xFFFFFF)
	end
	for i = 1, #coords do
		removeBlip(checkpoint_poisk[i])
		checkpoint_poisk[i] = 0
	end
end

function rgbToHex(rgb)
	slot1 = "0xFF"
	for _, slot6 in pairs(rgb) do
		slot7 = ""
		while slot6 > 0 do
			slot8 = math.fmod(slot6, 16) + 1
			slot6 = math.floor(slot6 / 16)
			slot7 = string.sub("0123456789ABCDEF", slot8, slot8) .. slot7
		end

		if string.len(slot7) == 0 then
			slot7 = "00"
		elseif string.len(slot7) == 1 then
			slot7 = "0" .. slot7
		end
		slot1 = slot1 .. slot7
	end
	return slot1
end

function getColor(color)
	a, r, g, b = explode_argb(color)
	slot1 = 
	{
		r,
		g,
		b
	}
	rgb = slot1
	return rgbToHex(rgb)
end

function explode_argb(color)
	return bit.band(bit.rshift(color, 24), 255), bit.band(bit.rshift(color, 16), 255), bit.band(bit.rshift(color, 8), 255), bit.band(color, 255)
end

function join_rgb(r, g, b)
	return bit.bor(bit.bor(b, bit.lshift(g, 8)), bit.lshift(r, 16))
end

function join_argb(a, r, g, b)
	local argb = b
	argb = bit.bor(argb, bit.lshift(g, 8))
	argb = bit.bor(argb, bit.lshift(r, 16))
	argb = bit.bor(argb, bit.lshift(a, 24))
	return argb
end

function argb_to_rgba(argb)
	local a, r, g, b = explode_argb(argb)
	return join_argb(r, g, b, a)
end

local list = {}
function list:new()
	return
	{
		pos =
		{
			x = select(1,getScreenResolution()) - 222,
			y = select(2,getScreenResolution()) - 65
		},
		size =
		{
			x = 200,
			y = 0
		}
	}
end
notfList = list:new()

function onRenderNotification()
	local count = 0
	for k, v in ipairs(_message) do
		local push = false
		if v.active and v.time < os.clock() then
			v.active = false
			table.remove(_message, k)
		end
		if count < 10 then
			if not v.active then
				if v.showtime > 0 then
					v.active = true
					v.time = os.clock() + v.showtime
					v.showtime = 0
				end
			end
			if v.active then
				count = count + 1
				if v.time + 3.000 >= os.clock() then
					imgui.PushStyleVar(imgui.StyleVar.Alpha, (v.time - os.clock()) / 0.3)
					push = true
				end
				local nText = u8(tostring(v.text))
				notfList.size = imgui.GetFont():CalcTextSizeA(imgui.GetFont().FontSize, 200.0, 196.0, nText)
				notfList.pos = imgui.ImVec2(notfList.pos.x, (notfList.pos.y - (count == 1 and notfList.size.y or (notfList.size.y + 40))))
				imgui.SetNextWindowPos(notfList.pos, _, imgui.ImVec2(0.0, 0.0))
				imgui.SetNextWindowSize(imgui.ImVec2(200, notfList.size.y + imgui.GetStyle().ItemSpacing.y + imgui.GetStyle().WindowPadding.y+25))
				imgui.Begin(u8'##msg' .. k, _, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize + imgui.WindowFlags.NoScrollbar + imgui.WindowFlags.NoMove + imgui.WindowFlags.NoTitleBar)
				imgui.CenterText(script_names)
				imgui.Separator()
				imgui.TextWrapped(nText)
				imgui.End()
				if push then
					imgui.PopStyleVar()
				end
			end
		end
	end
	notfList = list:new()
end

function imgui.TextQuestion(text)
	imgui.TextDisabled(u8'(?)')
	if imgui.IsItemHovered() then
		imgui.BeginTooltip()
		imgui.PushTextWrapPos(450)
		imgui.TextUnformatted(text)
		imgui.PopTextWrapPos()
		imgui.EndTooltip()
	end
end

function imgui.CenterText(text) 
	local width = imgui.GetWindowWidth()
	local calc = imgui.CalcTextSize(text)
	imgui.SetCursorPosX(width / 2 - calc.x / 2)
	imgui.Text(text)
end

function imgui.TextColoredRGB(text)
	local width = imgui.GetWindowWidth()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local ImVec4 = imgui.ImVec4

	local getcolor = function(color)
		if color:sub(1, 6):upper() == 'SSSSSS' then
			local r, g, b = colors[1].x, colors[1].y, colors[1].z
			local a = tonumber(color:sub(7, 8), 16) or colors[1].w * 255
			return ImVec4(r, g, b, a / 255)
		end
		local color = type(color) == 'string' and tonumber(color, 16) or color
		if type(color) ~= 'number' then return end
		local r, g, b, a = explode_argb(color)
		return imgui.ImColor(r, g, b, a):GetVec4()
	end

	local render_text = function(text_)
		for w in text_:gmatch('[^\r\n]+') do
			local textsize = w:gsub('{.-}', '')
			local text_width = imgui.CalcTextSize((textsize))
			local text, colors_, m = {}, {}, 1
			w = w:gsub('{(......)}', '{%1FF}')
			while w:find('{........}') do
				local n, k = w:find('{........}')
				local color = getcolor(w:sub(n + 1, k - 1))
				if color then
					text[#text], text[#text + 1] = w:sub(m, n - 1), w:sub(k + 1, #w)
					colors_[#colors_ + 1] = color
					m = n
				end
				w = w:sub(1, n - 1) .. w:sub(k + 1, #w)
			end
			if text[0] then
				for i = 0, #text do
					imgui.TextColored(colors_[i] or colors[1], (text[i]))
					imgui.SameLine(nil, 0)
				end
				imgui.NewLine()
			else
				imgui.Text((w))
			end
		end
	end
	render_text(text)
end

function imgui.CenterTextColored(text) 
	local text2 = text:gsub('{(......)}','') 
	local width = imgui.GetWindowWidth()
	local calc = imgui.CalcTextSize(text2)
	imgui.SetCursorPosX(width / 2 - calc.x / 2)
	imgui.TextColoredRGB(text)
end

function imgui.CenterWindowText(text,typetext)
	typetext = typetext or imgui.Text
	local windSZ = imgui.GetWindowSize()
	if typetext == imgui.TextColoredRGB then
		local imguiRenderText = text
		text = text:gsub('{(......)}','')
		local txtSZ = imgui.CalcTextSize(text)
		imgui.SetCursorPos(imgui.ImVec2(windSZ.x/2 - txtSZ.x / 2,windSZ.y/2 - txtSZ.y / 2))
		typetext(imguiRenderText)
	else
		local txtSZ = imgui.CalcTextSize(text)
		imgui.SetCursorPos(imgui.ImVec2(windSZ.x/2 - txtSZ.x / 2,windSZ.y/2 - txtSZ.y / 2))
		typetext(text)
	end
end

function onWindowMessage(msg, wparam, lparam)
	if msg == 261 and wparam == 13 then consumeWindowMessage(true, true) end
	if msg == 0x100 or msg == 0x101 then
		if (wparam == 0x1B and windowstate.v) and not isPauseMenuActive() then
			consumeWindowMessage(true, false)
			if msg == 0x101 then
				windowstate.v = false
			end
		end
	end
end

local ffi = require("ffi")
ffi.cdef[[
    short GetKeyState(int nVirtKey);
    bool GetKeyboardLayoutNameA(char* pwszKLID);
    int GetLocaleInfoA(int Locale, int LCType, char* lpLCData, int cchData);
]]
local BuffSize = 32
local KeyboardLayoutName = ffi.new("char[?]", BuffSize)
local LocalInfo = ffi.new("char[?]", BuffSize)
chars =
{
	["й"] = "q", ["ц"] = "w", ["у"] = "e", ["к"] = "r", ["е"] = "t", ["н"] = "y", ["г"] = "u", ["ш"] = "i", ["щ"] = "o", ["з"] = "p", ["х"] = "[", ["ъ"] = "]", ["ф"] = "a",
	["ы"] = "s", ["в"] = "d", ["а"] = "f", ["п"] = "g", ["р"] = "h", ["о"] = "j", ["л"] = "k", ["д"] = "l", ["ж"] = ";", ["э"] = "'", ["я"] = "z", ["ч"] = "x", ["с"] = "c",
	["м"] = "v", ["и"] = "b", ["т"] = "n", ["ь"] = "m", ["б"] = ",", ["ю"] = ".", ["Й"] = "Q", ["Ц"] = "W", ["У"] = "E", ["К"] = "R", ["Е"] = "T", ["Н"] = "Y", ["Г"] = "U",
	["Ш"] = "I", ["Щ"] = "O", ["З"] = "P", ["Х"] = "{", ["Ъ"] = "}", ["Ф"] = "A", ["Ы"] = "S", ["В"] = "D", ["А"] = "F", ["П"] = "G", ["Р"] = "H", ["О"] = "J", ["Л"] = "K",
	["Д"] = "L", ["Ж"] = ":", ["Э"] = "\"", ["Я"] = "Z", ["Ч"] = "X", ["С"] = "C", ["М"] = "V", ["И"] = "B", ["Т"] = "N", ["Ь"] = "M", ["Б"] = "<", ["Ю"] = ">"
}

function getStrByState(keyState)
    if keyState == 0 then
        return "{33AA33}Выкл.{FFFFFF}"
    end
    return "{FF3300}Вкл.{FFFFFF}"
end

function showInputHelp()
	if sampIsChatInputActive() == true then
		local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
		local windowPosX = getStructElement(input, 0x8, 4)
		local windowPosY = getStructElement(input, 0xC, 4)
		----------------------------------------
		fib = windowPosY + 41
		fib2 = windowPosX + 10
		----------------------------------------
		local _, playerid = sampGetPlayerIdByCharHandle(PLAYER_PED)
		local color = sampGetPlayerColor(playerid)
		local name = sampGetPlayerNickname(playerid)
		local ping = sampGetPlayerPing(playerid)
		local score = sampGetPlayerScore(playerid)
		local capsState = ffi.C.GetKeyState(20)
		local success = ffi.C.GetKeyboardLayoutNameA(KeyboardLayoutName)
		local errorCode = ffi.C.GetLocaleInfoA(tonumber(ffi.string(KeyboardLayoutName), 16), 0x00000002, LocalInfo, BuffSize)
		local localName = ffi.string(LocalInfo)		
		----------------------------------------
		local text = string.format(
			"%s - {%0.6x}%s[%d]{FFFFFF} - Пинг: %d - Уровень: %d - Капс: %s - Язык: {33AA33}%s",
			os.date("%H:%M:%S"),
			bit.band(color,0xffffff),
			name,
			playerid,
			ping,
			score,
			getStrByState(capsState),
			string.match(localName, "([^%(]*)")
		)
		renderFontDrawText(molot_10_9, text, fib2, fib, 0xD7FFFFFF)
		----------------------------------------
    end
end

function Draw3DCircle(x, y, z, radius)
    local screen_x_line_old, screen_y_line_old;

    for rot = 0, 360 do
        local rot_temp = math.rad(rot)
		local lineX = radius * math.cos(rot_temp) + x
		local lineY = radius * math.sin(rot_temp) + y
		local lineZ = z
		
        local screen_x_line, screen_y_line = convert3DCoordsToScreen(lineX, lineY, lineZ)

        if isPointOnScreen(lineX, lineY, lineZ, 0) and screen_x_line ~= nil and screen_x_line_old ~= nil then
			renderDrawLine(screen_x_line, screen_y_line, screen_x_line_old, screen_y_line_old, 3, 0xFFD00000)
		end
		
		screen_x_line_old = screen_x_line
		screen_y_line_old = screen_y_line
    end
end

function theme()
	imgui.SwitchContext()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local clr = imgui.Col
	local ImVec4 = imgui.ImVec4
	local ImVec2 = imgui.ImVec2

	style.WindowPadding = imgui.ImVec2(8, 8)
	style.WindowRounding = 6
	style.ChildWindowRounding = 5
	style.FramePadding = imgui.ImVec2(5, 3)
	style.FrameRounding = 3.0
	style.ItemSpacing = imgui.ImVec2(5, 4)
	style.ItemInnerSpacing = imgui.ImVec2(4, 4)
	style.IndentSpacing = 21
	style.ScrollbarSize = 10.0
	style.ScrollbarRounding = 13
	style.GrabMinSize = 8
	style.GrabRounding = 1
	style.WindowTitleAlign = imgui.ImVec2(0.5, 0.5)
	style.ButtonTextAlign = imgui.ImVec2(0.5, 0.5)

	colors[clr.Text]					= ImVec4(0.95, 0.96, 0.98, 1.00);
	colors[clr.TextDisabled]			= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.WindowBg]				= ImVec4(0.14, 0.14, 0.14, 0.95);
	colors[clr.ChildWindowBg]			= ImVec4(0.17, 0.17, 0.17, 1.00);
	colors[clr.PopupBg]					= ImVec4(0.08, 0.08, 0.08, 0.94);
	colors[clr.Border]					= ImVec4(0.14, 0.14, 0.14, 1.00);
	colors[clr.BorderShadow]			= ImVec4(1.00, 1.00, 1.00, 0.10);
	colors[clr.FrameBg]					= ImVec4(0.22, 0.22, 0.22, 1.00);
	colors[clr.FrameBgHovered]			= ImVec4(0.18, 0.18, 0.18, 1.00);
	colors[clr.FrameBgActive]			= ImVec4(0.10, 0.10, 0.10, 1.00);
	colors[clr.TitleBg]					= ImVec4(0.14, 0.14, 0.14, 0.81);
	colors[clr.TitleBgActive]			= ImVec4(0.12, 0.12, 0.12, 1.00);
	colors[clr.TitleBgCollapsed]		= ImVec4(0.00, 0.00, 0.00, 0.51);
	colors[clr.MenuBarBg]				= ImVec4(0.20, 0.20, 0.20, 1.00);
	colors[clr.ScrollbarBg]				= ImVec4(0.02, 0.02, 0.02, 0.39);
	colors[clr.ScrollbarGrab]			= ImVec4(0.36, 0.36, 0.36, 1.00);
	colors[clr.ScrollbarGrabHovered]	= ImVec4(0.18, 0.22, 0.25, 1.00);
	colors[clr.ScrollbarGrabActive]		= ImVec4(0.24, 0.24, 0.24, 1.00);
	colors[clr.ComboBg]					= ImVec4(0.24, 0.24, 0.24, 1.00);
	colors[clr.CheckMark]				= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.SliderGrab]				= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.SliderGrabActive]		= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.Button]					= ImVec4(0.22, 0.22, 0.22, 1.00);
	colors[clr.ButtonHovered]			= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.ButtonActive]			= ImVec4(1.00, 0.21, 0.21, 1.00);
	colors[clr.Header]					= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.HeaderHovered]			= ImVec4(1.00, 0.39, 0.39, 1.00);
	colors[clr.HeaderActive]			= ImVec4(1.00, 0.21, 0.21, 1.00);
	colors[clr.ResizeGrip]				= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.ResizeGripHovered]		= ImVec4(1.00, 0.39, 0.39, 1.00);
	colors[clr.ResizeGripActive]		= ImVec4(1.00, 0.19, 0.19, 1.00);
	colors[clr.CloseButton]				= ImVec4(0.40, 0.39, 0.38, 0.16);
	colors[clr.CloseButtonHovered]		= ImVec4(0.40, 0.39, 0.38, 0.39);
	colors[clr.CloseButtonActive]		= ImVec4(0.40, 0.39, 0.38, 1.00);
	colors[clr.PlotLines]				= ImVec4(0.61, 0.61, 0.61, 1.00);
	colors[clr.PlotLinesHovered]		= ImVec4(1.00, 0.43, 0.35, 1.00);
	colors[clr.PlotHistogram]			= ImVec4(1.00, 0.21, 0.21, 1.00);
	colors[clr.PlotHistogramHovered]	= ImVec4(1.00, 0.18, 0.18, 1.00);
	colors[clr.TextSelectedBg]			= ImVec4(1.00, 0.32, 0.32, 1.00);
	colors[clr.ModalWindowDarkening]	= ImVec4(0.26, 0.26, 0.26, 0.60);
end
theme()

function patch()
	if memory.getuint8(0x748C2B) == 0xE8 then
		memory.fill(0x748C2B, 0x90, 5, true)
	elseif memory.getuint8(0x748C7B) == 0xE8 then
		memory.fill(0x748C7B, 0x90, 5, true)
	end
	if memory.getuint8(0x5909AA) == 0xBE then
		memory.write(0x5909AB, 1, 1, true)
	end
	if memory.getuint8(0x590A1D) == 0xBE then
		memory.write(0x590A1D, 0xE9, 1, true)
		memory.write(0x590A1E, 0x8D, 4, true)
	end
	if memory.getuint8(0x748C6B) == 0xC6 then
		memory.fill(0x748C6B, 0x90, 7, true)
	elseif memory.getuint8(0x748CBB) == 0xC6 then
		memory.fill(0x748CBB, 0x90, 7, true)
	end
	if memory.getuint8(0x590AF0) == 0xA1 then
		memory.write(0x590AF0, 0xE9, 1, true)
		memory.write(0x590AF1, 0x140, 4, true)
	end
end
patch()