-- script_name("{330000}Ar{430006}iz{53000b}on{64000d}a H{75000e}el{86000d}pe{97000a}r")
-- bool result = setClipboardText(string text) - Записывает текст в буфер обмена Windows.

script_name("{0d00ff}Ar{2900ff}iz{3900ff}on{4500ff}a H{4f00ff}el{5800ff}pe{6000ff}r")
local script_names = "Arizona Helper"

script_version('4.856')
script_author("metk1u")

local model_name =
{
	[323] = "Дилдо на спину #3",
	[363] = "Портфель террориста",
	[371] = "Рюкзак (парашют)",
	[1114] = "Очки сварщика",
	[1276] = "Сувенир на спину",
	[1487] = "Бутылка на спину",
	[2045] = "Бита с гвоздями",
	[2061] = "Патрон на грудь",
	[2102] = "Колонка на спину",
	[2226] = "Бумбокс",
	[2404] = "Доска для серфинга",
	[2429] = "Реактивный ранец",
	[2469] = "Самолётик на спину",
	[2590] = "Коса на спину",
	[2690] = "Огнетушитель на спину",
	[2712] = "Метла на спину",
	[2782] = "Устрица на спину & Раптор",
	[2908] = "Голова зомби",
	[2918] = "Рюкзак с шипами",
	[2983] = "Штурвал за спиной",
	[3026] = "Рюкзак",
	[3056] = "Магнит на спину & Инопланетная пушка",
	[3273] = "Ранец охотники на приведений",
	[11704] = "Маска демона",
	[16368] = "Красная шляпа",
	[18632] = "Рыболовная удочка на спину",
	[18633] = "Балонный ключ на спину",
	[18634] = "Лом на спину",
	[18635] = "Молоток на спину",
	[18636] = "Кепка Police",
	[18638] = "Каска строителя",
	[18645] = "Мотошлем",
	[18782] = "Печенька на голову",
	[18890] = "Грабли на спину",
	[18906] = "Бандана на голову",
	[18911] = "Бандана",
	[18921] = "Берет",
	[18926] = "Кепка передняя",
	[18947] = "Шляпка",
	[18952] = "Шлем для бокса",
	[18953] = "Тёплая Шапка",
	[18955] = "Кепка обратная",
	[18963] = "Маска CJ",
	[18964] = "Бандитская шапка",
	[18967] = "Панамка",
	[18970] = "Шляпа",
	[19006] = "Очки",
	[19036] = "Хоккейная маска",
	[19039] = "Часы",
	[19054] = "Подарок на спину",
	[19064] = "Новогодняя шапка",
	[19067] = "Шапки",
	[19077] = "Борода #2",
	[19085] = "Повязка на глаз",
	[19086] = "Улучшенное дилдо",
	[19093] = "Кепка DUDE",
	[19094] = "Гамбургер",
	[19095] = "Ковбойская шляпа",
	[19101] = "Каска",
	[19136] = "Шляпа с дредами",
	[19137] = "Голова петуха",
	[19141] = "Каска спецназа",
	[19142] = "Бронежилет",
	[19274] = "Парик (1)",
	[19314] = "Рога",
	[19317] = "Гитара",
	[19346] = "Хот-дог на голову",
	[19347] = "Звезда на грудь",
	[19349] = "Монокль",
	[19350] = "Усы (короткие)",
	[19351] = "Усы (длинные)",
	[19352] = "Чёрный конус",
	[19421] = "Наушники",
	[19469] = "Повязка на шею",
	[19472] = "Респиратор",
	[19517] = "Борода #1",
	[19519] = "Парик (3)",
	[19520] = "Фуражка офицера",
	[19528] = "Шляпа волшебника",
	[19554] = "Шапка баллас",
	[19557] = "Маска Зорро",
	[19558] = "Кепка (развозчика пиццы)",
	[19559] = "Походный рюкзак",
	[19581] = "Сковородка на спину",
	[19590] = "Меч на спину",
	[19591] = "Китайский веер",
	[19621] = "Канистра на правое бедро",
	[19623] = "Фотоаппарат на грудь",
	[19624] = "Большой чемодан",
	[19627] = "Гаечный ключ на грудь",
	[19630] = "Рыба на спину",
	[19631] = "Кирка на спину",
	[19636] = "Ларек с фруктами",
	[19804] = "Замочек на грудь",
	[19847] = "Копченая нога",
	[19878] = "Скейт на спину",
	[19904] = "Жилет грузчика"
};
local model_name_anti_stealer =
{
	-- [19632] = "Горящий щит",
	[0] = "None",
	[321] = "Дилдо на спину #1",
	[322] = "Дилдо на спину #2",
	[324] = "Рюкзак мотор",
	[326] = "Трость на спину",
	[333] = "Клюшка на спину",
	[335] = "Нож с модификации Псих",
	[336] = "Бита на спину",
	[337] = "Лопата на спину",
	[338] = "Кий на спину",
	[339] = "Катана на спину",
	[341] = "Бензопила на спину",
	[361] = "Огнемёт на спину",
	[362] = "Миниган на спину",
	[364] = "Пульт от бомбы",
	[368] = "Прибор ночного видения",
	[635] = "Плащ с модификации Смерть",
	[636] = "Плащ с модификации Тыква",
	[806] = "Трава какая-то",
	[815] = "С модификации Demon",
	[881] = "Ёлка",
	[888] = "Язык Венома",
	[891] = "С модификации Костюм для хэллоуина",
	[928] = "Корона BomjGang",
	[953] = "Крылья ангела",
	[954] = "Рога оленя и Лук Купидона",
	[1007] = "С модификации Волшебник",
	[1010] = "НЕИЗВЕСТНО",
	[1013] = "Ушки бэтмена",
	[1017] = "С модификации Волшебник",
	[1019] = "Очки с модификации Бешенный доктор",
	[1108] = "Кусок косы с модификации Смерть",
	[1111] = "Хрень на глаз с модификации",
	[1112] = "Погоны с модификации",
	[1116] = "Маска решетка",
	[1128] = "Маска для сварки",
	[1133] = "Меч с модификации Djey",
	[1177] = "Реактивный ранец (1)",
	[1208] = "INVALID_OBJECT_ID",
	[1212] = "Пачка денег на спину",
	[1220] = "Коробка в руку",
	[1228] = "Карамельный посох",
	[1238] = "Колпак тёмного эльфа",
	[1239] = "Знак INFO",
	[1240] = "Сердца",
	[1243] = "Боеголовка",
	[1248] = "Значок GTA III",
	[1254] = "Череп на грудь",
	[1265] = "Мешок с мусором в руку",
	[1269] = "Кувалда",
	[1272] = "Значок синего домика",
	[1273] = "Значок зелёного домика",
	[1274] = "Доллар на грудь",
	[1275] = "Рубашка на грудь",
	[1277] = "Синий кейс",
	[1279] = "INVALID_OBJECT_ID",
	[1314] = "НЕИЗВЕСТНО",
	[1316] = "С модификации",
	[1319] = "Жезл ГАИ",
	[1327] = "Походный рюкзак",
	[1332] = "Сумка доставщика",
	[1366] = "Щит",
	[1371] = "Рюкзак Бегемот",
	[1387] = "Крюк пирата",
	[1548] = "Золотые погоны",
	[1550] = "Мешок денег на спину",
	[1562] = "Кресло на спину",
	[1565] = "Корона (1)",
	[1570] = "Рюкзак для ларьков",
	[1575] = "Белый пакет с наркотиками на спину",
	[1582] = "Пицца",
	[1584] = "Девушка с пистолетом",
	[1585] = "Рюкзак с девушкой 2",
	[1601] = "Молнии Зевса",
	[1602] = "Призрачный нимб, щит, ледяное копье",
	[1603] = "Кровавая накидка & Золотая шапка",
	[1604] = "Копьё Зевса",
	[1607] = "Дельфин",
	[1609] = "Черепаха на спину",
	[1614] = "Треугольник",
	[1622] = "Камера на плечо",
	[1636] = "С модификации",
	[1654] = "Красный будильник",
	[1681] = "Самолёт за спиной (Шамал)",
	[1736] = "Голова оленя & Рюкзак олень",
	[1877] = "Меч красный",
	[1878] = "Меч ораньжевый",
	[1879] = "Меч зелёный",
	[1880] = "Меч синий",
	[1881] = "Меч розовый",
	[1882] = "Меч фиолетовый",
	[1885] = "Корзины за спиной",
	[1886] = "Маска робота (1)",
	[1895] = "Золотая шляпа с шипами",
	[1946] = "Мяч на ноге",
	[1954] = "Рюкзак космонавта",
	[1974] = "С модификации",
	[2006] = "С модификации",
	[2028] = "INVALID_OBJECT_ID",
	[2060] = "Мешок грузчиков",
	[2064] = "Крылья зелёные",
	[2098] = "Адский лук",
	[2168] = "Рюкзак красный волнистый",
	[2186] = "Техно рюкзак",
	[2226] = "Бумбокс",
	[2237] = "С модификации Спарта",
	[2238] = "Шляпа с красными каплями",
	[2250] = "Цветок",
	[2253] = "Рюкзак с цветком",
	[2332] = "Коробка какая-то",
	[2345] = "Плащ из листьев",
	[2362] = "Переносная лавка",
	[2384] = "Одежда в руки",
	[2396] = "Дьявольские копья",
	[2429] = "Реактивный ранец (3)",
	[2511] = "Аэроплан 2",
	[2512] = "Аэроплан 1",
	[2595] = "INVALID_OBJECT_ID",
	[2614] = "Два флага на спине",
	[2630] = "Велосипед в руку",
	[2680] = "С модификации",
	[2689] = "С модификации",
	[2703] = "Рюкзак-бургер",
	[2707] = "Рюкзак со светом",
	[2711] = "С модификации робот",
	[2714] = "Табличка 'OPEN' на спину",
	[2726] = "Щит с модификации СПАРТА",
	[2769] = "С модификации Зомби",
	[2788] = "Воротник с модификации Гринч",
	[2803] = "Мешок с подарками",
	[2804] = "Кусок мяса в руку",
	[2805] = "Мешок с мясом",
	[2810] = "Человечек на спину",
	[2814] = "Пицца",
	[2846] = "Одежда в руках",
	[2888] = "Маска робота (2)",
	[2899] = "Ледяное копьё",
	[2901] = "Стог сена",
	[2905] = "Модификация: Бешенный доктор",
	[2907] = "С модификации",
	[2913] = "Штанга в руку",
	[2916] = "Модификация: Качок",
	[2928] = "Железный ящик",
	[2961] = "Красный ящик 3",
	[2968] = "Рюкзак BomjGang",
	[2976] = "Реактивный ранец (4)",
	[2977] = "Рюкзак",
	[2978] = "Щит с шипами",
	[2985] = "Экзоскилет",
	[2988] = "Сундук за спиной",
	[2992] = "Нимб с какой-то модификации",
	[3013] = "Ящик за спиной",
	[3016] = "Ядерный рюкзак",
	[3027] = "Косяк",
	[3031] = "Ранец вертолёт",
	[3052] = "Коробка в руку",
	[3070] = "Реактивный ранец (5) & Скайборд",
	[3072] = "Гантеля",
	[3096] = "Синий посох светлый",
	[3100] = "Шарик с модификации Соник",
	[3272] = "Паук на спину",
	[3273] = "Ранец охотники на приведений",
	[3383] = "Усы таракана",
	[3425] = "Установка за спиной",
	[3433] = "Зелёный рюкзак",
	[3434] = "Рюкзак пират",
	[3440] = "Очки переливающиеся",
	[3497] = "Садок",
	[3632] = "Бочка в руку",
	[3643] = "Рюкзак стимпанк",
	[3658] = "Гармошка",
	[3785] = "Светящийся рюкзак",
	[3801] = "Длинный топор",
	[3932] = "С модификации PUBG",
	[5384] = "INVALID_OBJECT_ID",
	[5385] = "INVALID_OBJECT_ID",
	[5388] = "INVALID_OBJECT_ID",
	[5389] = "INVALID_OBJECT_ID",
	[5686] = "INVALID_OBJECT_ID",
	[5689] = "INVALID_OBJECT_ID",
	[5690] = "INVALID_OBJECT_ID",
	[5691] = "INVALID_OBJECT_ID",
	[5692] = "INVALID_OBJECT_ID",
	[5695] = "INVALID_OBJECT_ID",
	[5698] = "INVALID_OBJECT_ID",
	[5699] = "INVALID_OBJECT_ID",
	[6012] = "INVALID_OBJECT_ID",
	[6013] = "INVALID_OBJECT_ID",
	[6865] = "Маска с рогами & Рюкзак (Череп с рогами)",
	[7093] = "Сердечко Erotic",
	[7313] = "Ранец радио & Кейс анимированный 2 & Очки анимированые",
	[7392] = "Девушка на спину & Рюкзак-девушка",
	[7891] = "Лист металла в руку",
	[8492] = "Крылья & Красная накидка",
	[8493] = "Пиратский корабль на спину",
	[8548] = "С модификации Зомби",
	[8644] = "Два кинжала на спину",
	[9584] = "Рюкзак пароход",
	[9833] = "Реактивный водный ранец",
	[9958] = "submarr_sfe",
	[10281] = "Машина из стены",
	[10757] = "Самолёт за спиной",
	[11417] = "Портативная АЗС",
	[11489] = "Крылья гаргульи",
	[11700] = "Знак (Радиации)",
	[11705] = "Кейс для оружия",
	[11712] = "Крест на грудь и Распятие",
	[11716] = "С модификации Палач",
	[11722] = "Херня на голове с модификации",
	[11727] = "Очки будущего 2",
	[11731] = "С модификации",
	[11732] = "Маска лицо в сердечке",
	[11734] = "Сани на спину",
	[11736] = "Медицинская маска & Рюкзак медика зелёный",
	[11738] = "Рюкзак медика красный",
	[11741] = "Глаз с модификации Ghost",
	[11747] = "Палка с модификации Индеец",
	[11750] = "VR-очки",
	[13562] = "Крутящаяся дубина",
	[13667] = "Маска обезьяны",
	[14467] = "Человечек на плечо",
	[14527] = "Крылья стрекозы",
	[14608] = "Копье бога",
	[14611] = "Корона (2)",
	[14637] = "Два дракона",
	[16442] = "Рюкзак корова",
	[16776] = "Петух на плечо",
	[16778] = "НЛО",
	[18003] = "Оружие",
	[18637] = "Щит на спину и в руку",
	[18641] = "Маска фонарь",
	[18642] = "Ранец шокер & Копье-шокер",
	[18643] = "Красная шляпа маяк",
	[18644] = "Отвёртка в руку",
	[18646] = "Глаз терминатора",
	[18688] = "Огонь",
	[18693] = "Огонь",
	[18701] = "Огонь",
	[18717] = "С модификации Волшебник",
	[18718] = "Огонь",
	[18729] = "Огонь",
	[18848] = "Военный реактивный ранец",
	[18865] = "Телефон",
	[18866] = "Телефон",
	[18867] = "Телефон",
	[18868] = "Телефон & Черный чемодан",
	[18869] = "Телефон",
	[18870] = "Телефон",
	[18871] = "Телефон",
	[18872] = "Телефон",
	[18873] = "Телефон",
	[18874] = "Телефон",
	[18875] = "ПипБой",
	[18891] = "Плащ с модификации",
	[18936] = "С модификации Палач",
	[19054] = "Подарок на спину",
	[19055] = "Подарок на спину",
	[19056] = "Подарок на спину",
	[19057] = "Подарок на спину",
	[19058] = "Подарок на спину",
	[19063] = "Шарик с модификации праздник",
	[19078] = "Попугай",
	[19079] = "Попугай на плечо",
	[19080] = "Синяя шляпа маяк",
	[19081] = "Шляпа маяк",
	[19082] = "Шляпа маяк",
	[19083] = "Шляпа маяк",
	[19084] = "Шляпа маяк",
	[19087] = "Палка с модификации праздник",
	[19090] = "Синий берет",
	[19091] = "Красный берет",
	[19092] = "Зелёный берет",
	[19128] = "Кейс анимированный 3",
	[19130] = "Знак на груди",
	[19133] = "С модификации",
	[19135] = "Стрелка с модификации праздник и Вьетнамская шапка",
	[19163] = "Маска с модификации Дарт-вейдер",
	[19173] = "Картина в руку какая-то",
	[19177] = "С модификации Палач",
	[19197] = "Ангельское кольцо на голову",
	[19200] = "Шлем с модификации Ghost",
	[19202] = "С модификации Зомби",
	[19314] = "Рога",
	[19315] = "Олень на плечо",
	[19320] = "Тыква на голову",
	[19330] = "Женская шляпка",
	[19331] = "Тёмный плащ",
	[19332] = "Воздушный шар",
	[19333] = "Воздушный шар",
	[19334] = "Воздушный шар",
	[19335] = "Воздушный шар",
	[19336] = "Воздушный шар",
	[19337] = "Воздушный шар",
	[19338] = "Воздушный шар",
	[19339] = "Гроб с модификации Негр",
	[19341] = "Яйцо",
	[19342] = "Яйцо",
	[19343] = "Яйцо",
	[19344] = "Яйцо",
	[19345] = "Яйцо",
	[19348] = "Трость с модификации Купидон",
	[19468] = "Ведро в руку",
	[19513] = "Телефон",
	[19516] = "Крылья с модификации",
	[19518] = "Парик (2)",
	[19522] = "Значок красного домика",
	[19523] = "Значок оранжевого домика",
	[19524] = "Значок желтого домика",
	[19525] = "Рюкзак пара",
	[19527] = "Капюшон, Зелёный фонарь, Зелёные погоны, Шапка Британца",
	[19553] = "Фермерская шляпа",
	[19555] = "Боксерские перчатки",
	[19556] = "Боксерские перчатки",
	[19570] = "Молоко с модификации Гринч",
	[19576] = "Яблоко с модификации Гринч",
	[19577] = "Помидор с модификации Дедпул",
	[19578] = "Рюкзак банан",
	[19582] = "Мясо с модификации Дедпул",
	[19583] = "Нож с модификации Djey",
	[19620] = "Полицейский ранец & Палка красно-синяя",
	[19626] = "Лопата в руку (2)",
	[19793] = "С модификации Палач",
	[19797] = "Погоны красно-синие & 3D-очки & Кейс анимированный 1",
	[19801] = "Маска",
	[19806] = "Новогодний реактивный ранец",
	[19807] = "Рюкзак телефон",
	[19824] = "Бита-бутылка на спину",
	[19828] = "Белый рюкзак",
	[19831] = "Рюкзак с крышкой",
	[19836] = "С модификации",
	[19840] = "Красный плащ",
	[19874] = "Мыло с модификации Дедпул",
	[19893] = "Карта на спину",
	[19917] = "Техно-рюкзак 3",
	[19959] = "Знак (поворот направо)",
	[19960] = "Знак (поворот налево)",
	[19961] = "Знак (поворот направо)",
	[19962] = "Знак (плюсик)",
	[19963] = "Знак (тупик)",
	[19964] = "Знак (светофор)",
	[19965] = "Знак (стрелка)",
	[19966] = "Знак (стоп)",
	[19967] = "Знак (Do Not Enter)",
	[19977] = "Знак (уступи дорогу)"
};
local textdraw_name =
{
	[312] = "INVALID_OBJECT_ID",
	[313] = "INVALID_OBJECT_ID",
	[314] = "INVALID_OBJECT_ID",
	[315] = "INVALID_OBJECT_ID",
	[316] = "INVALID_OBJECT_ID",
	[317] = "INVALID_OBJECT_ID",
	[318] = "INVALID_OBJECT_ID",
	[319] = "INVALID_OBJECT_ID",
	[321] = "Дилдо на спину #1",
	[322] = "Дилдо",
	[323] = "Вибратор",
	[324] = "Рюкзак мотор и модификация Дарт-вейдер",
	[325] = "Букет цветов",
	[326] = "Трость",
	[327] = "Хз откуда",
	[328] = "Бордовый чемодан",
	[329] = "INVALID_OBJECT_ID",
	[331] = "Кастет",
	[332] = "INVALID_OBJECT_ID",
	[333] = "Клюшка для гольфа",
	[335] = "Нож",
	[336] = "Бита на спину",
	[337] = "Лопата на спину",
	[338] = "Кий на спину",
	[339] = "Катана на спину и Расомаха",
	[340] = "INVALID_OBJECT_ID",
	[341] = "Бензопила",
	[342] = "Граната",
	[344] = "Молотов",
	[346] = "Colt 45",
	[347] = "Silenced 9mm",
	[348] = "Desert Eagle",
	[349] = "Shotgun",
	[350] = "Sawnoff Shotgun",
	[351] = "Дробовик 1",
	[352] = "Micro Uzi",
	[353] = "MP5",
	[355] = "AK-47",
	[356] = "M4",
	[357] = "Country Rifle",
	[358] = "Sniper Rifle",
	[359] = "РПГ 2",
	[361] = "Огнемёт на спину",
	[362] = "Миниган на спину",
	[363] = "Портфель террориста",
	[365] = "Охлаждающая жидкость для видеокарты",
	[367] = "Фотоаппарат",
	[368] = "Прибор ночного видения",
	[371] = "Рюкзак (парашют)",
	[372] = "Tec-9",
	[382] = "INVALID_OBJECT_ID",
	[383] = "INVALID_OBJECT_ID",
	[398] = "INVALID_OBJECT_ID",
	[399] = "INVALID_OBJECT_ID",
	[612] = "INVALID_OBJECT_ID",
	[613] = "INVALID_OBJECT_ID",
	[614] = "INVALID_OBJECT_ID",
	[625] = "Цветок в горшке 1",
	[626] = "Цветок в горшке 2",
	[627] = "Цветок в горшке 3",
	[628] = "Цветок в горшке",
	[630] = "Цветок в горшке 5",
	[631] = "Цветок в горшке 6",
	[632] = "Цветок в горшке 7",
	[633] = "Цветок в горшке 8",
	[635] = "Хз откуда",
	[643] = "Стул и стол 1",
	[662] = "INVALID_OBJECT_ID",
	[663] = "INVALID_OBJECT_ID",
	[673] = "Хз откуда",
	[674] = "Хз откуда",
	[676] = "INVALID_OBJECT_ID",
	[677] = "Модификация: Demon",
	[683] = "Хз откуда",
	[701] = "Адская трава (игровой ресурс)",
	[756] = "Кактус",
	[795] = "INVALID_OBJECT_ID",
	[796] = "INVALID_OBJECT_ID",
	[797] = "INVALID_OBJECT_ID",
	[798] = "INVALID_OBJECT_ID",
	[799] = "INVALID_OBJECT_ID",
	[804] = "Модификации на транспорт",
	[806] = "Морковь (саженец)",
	[809] = "Куст 1",
	[811] = "Папоротник",
	[819] = "Большой Куст #2",
	[823] = "Большой Куст #1",
	[826] = "Хлопок",
	[841] = "Проклятое дерево",
	[842] = "Ломанное дерево",
	[844] = "Заколдованное дерево",
	[854] = "Мусор",
	[859] = "Счастливая травка",
	[862] = "Семена наркотиков",
	[871] = "Лен",
	[881] = "Ёлка",
	[886] = "Небольшое дерево #1",
	[888] = "Язык Венома",
	[890] = "Небольшое дерево #2",
	[891] = "Костюм для хэллоуина",
	[894] = "INVALID_OBJECT_ID",
	[902] = "Ледяная звезда",
	[907] = "INVALID_OBJECT_ID",
	[908] = "INVALID_OBJECT_ID",
	[918] = "Синяя бочка",
	[920] = "Первый компонент для крафта (квест)",
	[921] = "Второй компонент для крафта (квест)",
	[928] = "Корона BomjGang",
	[941] = "Стол",
	[946] = "Баскетбольное кольцо",
	[949] = "Растение в горшке 1",
	[950] = "Растение в горшке 2",
	[953] = "Крылья ангела",
	[954] = "Рога оленя и Лук Купидона",
	[955] = "Автомат с водой",
	[956] = "Автомат с едой",
	[962] = "Видеокарта",
	[964] = "Большой армейский ящик",
	[994] = "Хз откуда",
	[1000] = "Спойлер",
	[1001] = "Спойлер",
	[1002] = "Спойлер",
	[1003] = "Спойлер",
	[1004] = "Воздухозаборник",
	[1005] = "Воздухозаборник",
	[1006] = "Воздухозаборник",
	[1008] = "Нитро х1",
	[1009] = "Нитро х5",
	[1010] = "Нитро х10",
	[1011] = "Воздухозаборник",
	[1012] = "Воздухозаборник",
	[1013] = "Фара",
	[1014] = "Спойлер",
	[1015] = "Спойлер",
	[1016] = "Спойлер",
	[1019] = "Очки с модификации Бешенный доктор",
	[1021] = "Турбина",
	[1023] = "Спойлер",
	[1024] = "Фара",
	[1026] = "Боковая юбка",
	[1027] = "Боковая юбка",
	[1028] = "Турбина",
	[1029] = "Турбина",
	[1030] = "Боковая юбка",
	[1031] = "Боковая юбка",
	[1034] = "Турбина",
	[1036] = "Боковая юбка",
	[1037] = "Турбина",
	[1039] = "Боковая юбка",
	[1040] = "Боковая юбка",
	[1041] = "Боковая юбка",
	[1043] = "Турбина",
	[1044] = "Турбина",
	[1045] = "Турбина",
	[1046] = "Турбина",
	[1047] = "Боковая юбка",
	[1048] = "Боковая юбка",
	[1049] = "Спойлер",
	[1050] = "Спойлер",
	[1051] = "Боковая юбка",
	[1052] = "Боковая юбка",
	[1056] = "Боковая юбка",
	[1057] = "Боковая юбка",
	[1058] = "Спойлер",
	[1059] = "Турбина",
	[1060] = "Спойлер",
	[1062] = "Боковая юбка",
	[1063] = "Боковая юбка",
	[1064] = "Турбина",
	[1065] = "Турбина",
	[1066] = "Турбина",
	[1069] = "Боковая юбка",
	[1070] = "Боковая юбка",
	[1071] = "Боковая юбка",
	[1072] = "Боковая юбка",
	[1080] = "Автомобильное колесо",
	[1089] = "Турбина",
	[1090] = "Боковая юбка",
	[1092] = "Турбина",
	[1093] = "Боковая юбка",
	[1094] = "Боковая юбка",
	[1095] = "Боковая юбка",
	[1105] = "Турбина",
	[1111] = "Накладка на бензобак #1",
	[1112] = "Накладка на бензобак #1",
	[1114] = "Очки сварщика",
	[1115] = "Железная маска",
	[1116] = "Маска решетка",
	[1117] = "Накладка на бампер",
	[1126] = "Турбина",
	[1127] = "Турбина",
	[1128] = "Улучшенная часть корпуса",
	[1138] = "Спойлер",
	[1139] = "Спойлер",
	[1140] = "Задний бампер",
	[1141] = "Задний бампер",
	[1142] = "Воздухозаборник",
	[1144] = "Воздухозаборник",
	[1146] = "Спойлер",
	[1147] = "Спойлер",
	[1148] = "Задний бампер",
	[1149] = "Задний бампер",
	[1150] = "Задний бампер",
	[1151] = "Задний бампер",
	[1152] = "Передний бампер",
	[1153] = "Передний бампер",
	[1154] = "Задний бампер",
	[1155] = "Передний бампер",
	[1156] = "Задний бампер",
	[1157] = "Передний бампер",
	[1158] = "Спойлер",
	[1159] = "Задний бампер",
	[1160] = "Передний бампер",
	[1161] = "Задний бампер",
	[1162] = "Спойлер",
	[1163] = "Спойлер",
	[1164] = "Спойлер",
	[1165] = "Передний бампер",
	[1166] = "Передний бампер",
	[1167] = "Задний бампер",
	[1168] = "Задний бампер",
	[1170] = "Передний бампер",
	[1171] = "Передний бампер",
	[1172] = "Передний бампер",
	[1173] = "Передний бампер",
	[1174] = "Передний бампер",
	[1175] = "Передний бампер",
	[1176] = "Задний бампер",
	[1177] = "Задний бампер",
	[1178] = "Задний бампер",
	[1179] = "Передний бампер",
	[1180] = "Задний бампер",
	[1181] = "Передний бампер",
	[1182] = "Передний бампер",
	[1183] = "Задний бампер",
	[1185] = "Передний бампер",
	[1186] = "Рюкзак трансформер",
	[1206] = "INVALID_OBJECT_ID",
	[1210] = "Коричневый чемодан",
	[1212] = "Пачка денег на спину и Евро",
	[1213] = "Мина",
	[1217] = "Бочка",
	[1222] = "Красная бочка",
	[1228] = "Карамельный посох",
	[1235] = "Прозрачная мусорка",
	[1238] = "Колпак тёмного эльфа, Конус",
	[1239] = "Знак INFO",
	[1240] = "health",
	[1242] = "Бронежилет",
	[1243] = "Боеголовка",
	[1247] = "Звезда",
	[1248] = "Значок GTA III",
	[1253] = "camerapickup",
	[1254] = "Череп",
	[1255] = "Пляжный лежак",
	[1264] = "Пакет мусора",
	[1269] = "Кувалда",
	[1270] = "Красный рюкзак 2",
	[1271] = "Rare Box Yellow",
	[1272] = "Иконка дома",
	[1273] = "Иконка дома",
	[1274] = "Иконка доллара",
	[1275] = "clothesp",
	[1276] = "Часть от амулета",
	[1277] = "Талон +1 Exp",
	[1279] = "Белый мешок",
	[1280] = "Лавка",
	[1281] = "Тент",
	[1288] = "Наклейка Supreme",
	[1304] = "Металл",
	[1313] = "Два черепа",
	[1314] = "twoplayer",
	[1316] = "DONATE",
	[1317] = "Хз откуда",
	[1318] = "arrow",
	[1319] = "Жезл ГАИ",
	[1326] = "INVALID_OBJECT_ID",
	[1327] = "Палатка на спину",
	[1328] = "Платиновая рулетка",
	[1332] = "Сумка доставщика",
	[1333] = "Большая красная мусорка",
	[1334] = "Большая синяя мусорка",
	[1335] = "Ностальгический ящик",
	[1343] = "Пластиковая мусорка",
	[1347] = "Бетонная мусорка",
	[1349] = "Тележка из магазина",
	[1353] = "Сундук платиновой рулетки",
	[1360] = "Растение в горшке 3",
	[1361] = "Растение в горшке 4",
	[1364] = "Растение в форме лавки",
	[1366] = "Щит",
	[1368] = "Лавочка",
	[1369] = "Инвалидная коляска",
	[1371] = "Рюкзак Бегемот",
	[1387] = "Крюк пирата",
	[1408] = "Деревянный забор 2",
	[1409] = "Серая мусорка",
	[1412] = "Забор из сетки 1",
	[1415] = "Большая зелёная мусорка с коробками",
	[1418] = "Высокий забор",
	[1420] = "Электродвигатель",
	[1432] = "Стул и стол 2 ",
	[1438] = "Коробки",
	[1446] = "Синий забор",
	[1450] = "Мусор 1",
	[1451] = "Старый улей",
	[1453] = "Шкура оленя",
	[1455] = "Семена дерева Бобровые",
	[1458] = "Деревянный прицеп",
	[1460] = "Деревянный забор 1",
	[1463] = "Дрова",
	[1478] = "Почтовый ящик",
	[1481] = "Серый мангал",
	[1486] = "Пиво",
	[1487] = "Бутылка на спину",
	[1510] = "Второй компонент (хэллоуин)",
	[1547] = "Сертификат на подарок",
	[1548] = "Золотые погоны",
	[1549] = "Смазка для разгона видеокарты",
	[1550] = "Мешок с деньгами",
	[1554] = "Черви",
	[1565] = "Корона (1)",
	[1570] = "Рюкзак для ларьков",
	[1573] = "INVALID_OBJECT_ID",
	[1575] = "Туристический рюкзак (белый)",
	[1576] = "Туристический рюкзак (ораньжевый)",
	[1577] = "Туристический рюкзак (желтый)",
	[1578] = "Туристический рюкзак (зелёный)",
	[1579] = "Туристический рюкзак (синий)",
	[1580] = "Туристический рюкзак (красный)",
	[1581] = "DONATE keycard",
	[1582] = "Пицца",
	[1583] = "Человек",
	[1584] = "Девушка с пистолетом",
	[1585] = "Рюкзак с девушкой 2",
	[1586] = "Мишень",
	[1593] = "Шипы",
	[1594] = "Стулья со столом #3",
	[1599] = "Золотая рыбка",
	[1601] = "Молнии Зевса",
	[1602] = "Плазменный щит & Призрачный нимб & Ледяное копье",
	[1603] = "Кровавая накидка & Золотая шапка",
	[1604] = "Копьё Зевса",
	[1607] = "Дельфин на спину",
	[1609] = "Черепаха на спину",
	[1615] = "Точильный амулет",
	[1622] = "Регистратор на плечо",
	[1645] = "Серый Пляжный Лежак",
	[1646] = "Зелёный лежак",
	[1650] = "Канистра (/fillcar)",
	[1654] = "Бомба",
	[1666] = "Летняя монета",
	[1670] = "Бутылки с вином",
	[1672] = "Баллончик с краской & Supply Signal",
	[1679] = "Стул и стол 4",
	[1681] = "Реактивный ранец (2)",
	[1685] = "Ящик Minecraft",
	[1697] = "Солнечные панели",
	[1699] = "INVALID_OBJECT_ID",
	[1720] = "Деревянный стул",
	[1728] = "Диван (объект)",
	[1733] = "Тайник Илона Маска",
	[1736] = "Голова оленя & Рюкзак Олень",
	[1749] = "Ящик Джентельменов",
	[1782] = "Магнитола - 1",
	[1783] = "Магнитола - 2",
	[1785] = "Магнитола - 3",
	[1787] = "Магнитола - 4",
	[1788] = "Магнитола - 5",
	[1790] = "Магнитола - 6",
	[1808] = "Куллер с водой",
	[1829] = "Сейф с деньгами",
	[1840] = "Серая колонка",
	[1841] = "Серая колонка",
	[1842] = "Подарочная упаковка с цветами",
	[1851] = "Кубик в руку",
	[1852] = "Осколок игрушки",
	[1853] = "Одна фишка",
	[1854] = "Одна фишка",
	[1855] = "Одна фишка",
	[1856] = "Одна фишка",
	[1857] = "Одна фишка",
	[1858] = "Одна фишка",
	[1859] = "Одна фишка",
	[1860] = "Одна фишка",
	[1861] = "Одна фишка",
	[1862] = "Одна фишка",
	[1863] = "Одна фишка",
	[1864] = "Одна фишка",
	[1865] = "Одна фишка",
	[1866] = "Одна фишка",
	[1867] = "Одна фишка",
	[1868] = "Одна фишка",
	[1869] = "Одна фишка",
	[1870] = "Одна фишка",
	[1877] = "Меч красный",
	[1878] = "Меч ораньжевый",
	[1879] = "Меч зелёный",
	[1880] = "Меч синий",
	[1881] = "Меч розовый",
	[1882] = "Меч фиолетовый",
	[1885] = "Корзины за спиной",
	[1886] = "Маска робота (1)",
	[1895] = "Золотая шляпа с шипами",
	[1924] = "Фишки для казино",
	[1946] = "Мяч на ноге",
	[1951] = "Яд",
	[1953] = "Саб",
	[1954] = "Рюкзак космонавта",
	[1956] = "Бандитский респект",
	[1971] = "Рецепт адреналина",
	[1975] = "Наклейка",
	[1976] = "Наклейка",
	[1979] = "Бронзовая рулетка",
	[2033] = "Компенсатор",
	[2034] = "Револьвер",
	[2035] = "М4",
	[2036] = "Снайперка",
	[2041] = "Ящик с патронами",
	[2045] = "Бита с гвоздями",
	[2060] = "Ингредиенты",
	[2061] = "Патроны",
	[2064] = "Крылья зелёные && Орудие",
	[2098] = "Адский лук",
	[2102] = "Колонка на спину",
	[2114] = "Мяч",
	[2121] = "Красный стул",
	[2168] = "Рюкзак красный волнистый",
	[2186] = "Техно рюкзак",
	[2219] = "Комплексный обед",
	[2226] = "Бумбокс & Колонка за спиной",
	[2231] = "Деревянная колонка",
	[2232] = "Большая колонка",
	[2237] = "Кирка из майнкрафта",
	[2238] = "Шляпа с красными каплями",
	[2242] = "Третий компонент для крафта (квест)",
	[2245] = "Красный цветок в горшке",
	[2246] = "Белая ваза",
	[2249] = "Странное растение",
	[2250] = "Цветок",
	[2251] = "Серая ваза",
	[2253] = "Рюкзак с цветком",
	[2333] = "Железный стол",
	[2345] = "Плащ из листьев",
	[2358] = "Ящик с боеприпасами",
	[2362] = "Переносная лавка",
	[2386] = "Скин",
	[2396] = "Дьявольские копья",
	[2401] = "Одежда из секонд-хенда",
	[2404] = "Доска для серфинга",
	[2405] = "Доска для серфинга",
	[2406] = "Доска для серфинга",
	[2410] = "Доска для сёрфинга",
	[2429] = "Реактивный ранец (3)",
	[2456] = "Стикер Cluckin Bell",
	[2469] = "Игрушечный самолетик",
	[2487] = "Модификация: Соник",
	[2498] = "Осколки ящика",
	[2510] = "Большой Самолётик",
	[2511] = "Аэроплан 2",
	[2512] = "Аэроплан 1",
	[2587] = "Стикер Verona",
	[2589] = "Повешенная туша",
	[2590] = "Коса на спину & Крюк",
	[2601] = "Спранк",
	[2614] = "Флаг",
	[2640] = "Игральный автомат",
	[2645] = "Сертификат Дополнения VIP",
	[2655] = "Наклейка",
	[2656] = "Наклейка",
	[2657] = "Наклейка",
	[2658] = "Наклейка",
	[2659] = "Наклейка",
	[2660] = "Наклейка",
	[2663] = "Чипсы",
	[2670] = "Хз откуда",
	[2672] = "Мусор 3",
	[2680] = "Замок для велосипеда",
	[2684] = "Лицензии",
	[2686] = "Мед. карта",
	[2690] = "Огнетушитель",
	[2693] = "Стикер Alhambra",
	[2695] = "Наклейка",
	[2696] = "Наклейка",
	[2697] = "Наклейка",
	[2701] = "Ящик Marvel",
	[2703] = "Рюкзак-бургер",
	[2705] = "Рваная футболка",
	[2707] = "Рюкзак со светом",
	[2709] = "Таблетки от наркозависимости",
	[2711] = "Рюкзак (Кибер)",
	[2712] = "Метла на спину",
	[2714] = "Табличка 'OPEN' на спину",
	[2719] = "Стикер Jizzy",
	[2722] = "Стикер Binko",
	[2726] = "Кальян",
	[2729] = "DONATE",
	[2743] = "Статуя человека 1",
	[2745] = "Статуя человека 3",
	[2750] = "Хз откуда",
	[2763] = "Красный стол",
	[2764] = "Красный стол в клетку",
	[2768] = "Бургер",
	[2776] = "Черный стул",
	[2782] = "Раптор",
	[2788] = "Красный стул в клетку",
	[2790] = "Алюминий",
	[2798] = "Улучшенная часть КПП",
	[2799] = "Два стула и стол",
	[2803] = "Мешок с подарками",
	[2804] = "Кусок мяса в руку",
	[2805] = "Мешок с мясом",
	[2806] = "Сырое мясо оленины",
	[2810] = "Человечек на спину",
	[2811] = "Цветок в горшке 9",
	[2814] = "Пицца",
	[2819] = "Хз откуда",
	[2823] = "Крылышки",
	[2844] = "Рваные штаны",
	[2855] = "Газета",
	[2857] = "Коробки из под пиццы",
	[2866] = "Коробки из под еды",
	[2883] = "INVALID_OBJECT_ID",
	[2884] = "INVALID_OBJECT_ID",
	[2888] = "Маска робота (2)",
	[2891] = "Белый пакет",
	[2894] = "Телефонная книга и пропуск в тир",
	[2899] = "Ледяное копьё",
	[2901] = "Рюкзак из травы",
	[2905] = "Обрубленный труп (нога)",
	[2906] = "Обрубленный труп (рука)",
	[2907] = "Обрубленный труп (тело)",
	[2908] = "Голова зомби",
	[2914] = "Флаг (зеленый)",
	[2918] = "Ведро в руку & Ржавые детали & Праздничная тыква",
	[2928] = "Железный ящик",
	[2936] = "Бронза",
	[2953] = "Лотерейный билет",
	[2961] = "Красный ящик 3",
	[2964] = "Биллиардный стол",
	[2968] = "Рюкзак BomjGang",
	[2976] = "Реактивный ранец (4)",
	[2977] = "Супер мото-ящик",
	[2978] = "Щит с шипами",
	[2983] = "Штурвал за спиной",
	[2985] = "Экзоскилет",
	[2988] = "Сундук за спиной",
	[2992] = "Ангельский сет и обручальное кольцо",
	[2993] = "Флаг (т. зеленый)",
	[3003] = "Куриное яйцо (пасха)",
	[3012] = "Голова полицейского",
	[3013] = "Ящик за спиной",
	[3016] = "Фейерверк",
	[3025] = "Отмычка",
	[3026] = "Рюкзак",
	[3027] = "Самокрутка на спину",
	[3028] = "Катана",
	[3031] = "Ранец вертолёт",
	[3053] = "Дрифт-монета & Монета 6-ой годовщины",
	[3056] = "Магнит на спину & Инопланетная пушка",
	[3067] = "Покорёженный металл",
	[3070] = "Модификация: Киборг & Реактивный ранец (5) & Скайборд",
	[3071] = "Гантеля",
	[3082] = "Амулет",
	[3092] = "Труп полицейского",
	[3096] = "Улучшение автомобиля",
	[3099] = "Железные обломки",
	[3111] = "Чертёж уникального аксессуара (квест)",
	[3136] = "INVALID_OBJECT_ID",
	[3137] = "INVALID_OBJECT_ID",
	[3138] = "INVALID_OBJECT_ID",
	[3139] = "INVALID_OBJECT_ID",
	[3140] = "INVALID_OBJECT_ID",
	[3141] = "INVALID_OBJECT_ID",
	[3142] = "INVALID_OBJECT_ID",
	[3143] = "INVALID_OBJECT_ID",
	[3144] = "INVALID_OBJECT_ID",
	[3145] = "INVALID_OBJECT_ID",
	[3146] = "INVALID_OBJECT_ID",
	[3147] = "INVALID_OBJECT_ID",
	[3148] = "INVALID_OBJECT_ID",
	[3149] = "INVALID_OBJECT_ID",
	[3152] = "INVALID_OBJECT_ID",
	[3153] = "INVALID_OBJECT_ID",
	[3154] = "INVALID_OBJECT_ID",
	[3159] = "INVALID_OBJECT_ID",
	[3160] = "INVALID_OBJECT_ID",
	[3161] = "INVALID_OBJECT_ID",
	[3162] = "INVALID_OBJECT_ID",
	[3163] = "INVALID_OBJECT_ID",
	[3164] = "INVALID_OBJECT_ID",
	[3166] = "INVALID_OBJECT_ID",
	[3176] = "INVALID_OBJECT_ID",
	[3179] = "INVALID_OBJECT_ID",
	[3180] = "INVALID_OBJECT_ID",
	[3181] = "INVALID_OBJECT_ID",
	[3182] = "INVALID_OBJECT_ID",
	[3183] = "INVALID_OBJECT_ID",
	[3185] = "INVALID_OBJECT_ID",
	[3186] = "INVALID_OBJECT_ID",
	[3188] = "INVALID_OBJECT_ID",
	[3189] = "INVALID_OBJECT_ID",
	[3190] = "INVALID_OBJECT_ID",
	[3191] = "INVALID_OBJECT_ID",
	[3192] = "INVALID_OBJECT_ID",
	[3205] = "INVALID_OBJECT_ID",
	[3207] = "INVALID_OBJECT_ID",
	[3209] = "INVALID_OBJECT_ID",
	[3225] = "INVALID_OBJECT_ID",
	[3227] = "INVALID_OBJECT_ID",
	[3229] = "INVALID_OBJECT_ID",
	[3230] = "INVALID_OBJECT_ID",
	[3231] = "INVALID_OBJECT_ID",
	[3243] = "Модификация: Индеец",
	[3248] = "INVALID_OBJECT_ID",
	[3259] = "Улучшенная часть двигателя",
	[3272] = "Паук на спину",
	[3273] = "Ранец охотники на приведений",
	[3349] = "INVALID_OBJECT_ID",
	[3383] = "Усы таракана",
	[3385] = "Рюкзак будущего",
	[3416] = "INVALID_OBJECT_ID",
	[3425] = "Установка за спиной",
	[3429] = "INVALID_OBJECT_ID",
	[3433] = "Зелёный рюкзак",
	[3434] = "Рюкзак пират",
	[3438] = "Хз откуда",
	[3440] = "Очки переливающиеся",
	[3461] = "Огненный фонарь",
	[3462] = "Крылатая статуя",
	[3471] = "Модификация: Спарта",
	[3497] = "Садок",
	[3520] = "Цветы",
	[3524] = "Рюкзак-череп, Левая горящая голова, Правая горящая голова",
	[3525] = "Хз откуда",
	[3528] = "Ранец огненный дракон и Сет Дракона",
	[3533] = "Монета 7-ой годовщины",
	[3585] = "Грузчики",
	[3610] = "INVALID_OBJECT_ID",
	[3611] = "INVALID_OBJECT_ID",
	[3643] = "Рюкзак стимпанк",
	[3658] = "Гармошка",
	[3784] = "INVALID_OBJECT_ID",
	[3785] = "Светящийся рюкзак",
	[3801] = "Длинный топор",
	[3802] = "Настенный цветок 2",
	[3810] = "Настенный цветок 1",
	[3850] = "Хз откуда",
	[3870] = "INVALID_OBJECT_ID",
	[3871] = "INVALID_OBJECT_ID",
	[3883] = "INVALID_OBJECT_ID",
	[3889] = "INVALID_OBJECT_ID",
	[3929] = "Камень",
	[3930] = "Камень пространства",
	[4549] = "INVALID_OBJECT_ID",
	[4763] = "INVALID_OBJECT_ID",
	[4764] = "INVALID_OBJECT_ID",
	[4765] = "INVALID_OBJECT_ID",
	[4766] = "INVALID_OBJECT_ID",
	[4767] = "INVALID_OBJECT_ID",
	[4768] = "INVALID_OBJECT_ID",
	[4769] = "INVALID_OBJECT_ID",
	[4770] = "INVALID_OBJECT_ID",
	[4771] = "INVALID_OBJECT_ID",
	[4772] = "INVALID_OBJECT_ID",
	[4773] = "INVALID_OBJECT_ID",
	[4788] = "INVALID_OBJECT_ID",
	[4791] = "INVALID_OBJECT_ID",
	[4792] = "INVALID_OBJECT_ID",
	[4804] = "INVALID_OBJECT_ID",
	[4805] = "INVALID_OBJECT_ID",
	[5085] = "INVALID_OBJECT_ID",
	[5090] = "INVALID_OBJECT_ID",
	[5091] = "INVALID_OBJECT_ID",
	[5092] = "INVALID_OBJECT_ID",
	[5093] = "INVALID_OBJECT_ID",
	[5094] = "INVALID_OBJECT_ID",
	[5095] = "INVALID_OBJECT_ID",
	[5096] = "INVALID_OBJECT_ID",
	[5097] = "INVALID_OBJECT_ID",
	[5098] = "INVALID_OBJECT_ID",
	[5099] = "INVALID_OBJECT_ID",
	[5100] = "INVALID_OBJECT_ID",
	[5101] = "INVALID_OBJECT_ID",
	[5102] = "INVALID_OBJECT_ID",
	[5103] = "INVALID_OBJECT_ID",
	[5104] = "INVALID_OBJECT_ID",
	[5152] = "Грузчики",
	[5376] = "INVALID_OBJECT_ID",
	[5377] = "INVALID_OBJECT_ID",
	[5378] = "INVALID_OBJECT_ID",
	[5379] = "INVALID_OBJECT_ID",
	[5384] = "INVALID_OBJECT_ID",
	[5388] = "INVALID_OBJECT_ID",
	[5686] = "INVALID_OBJECT_ID",
	[5689] = "INVALID_OBJECT_ID",
	[5691] = "INVALID_OBJECT_ID",
	[5693] = "INVALID_OBJECT_ID",
	[5694] = "INVALID_OBJECT_ID",
	[5698] = "INVALID_OBJECT_ID",
	[5699] = "INVALID_OBJECT_ID",
	[5777] = "Модификация: Смерть",
	[6012] = "INVALID_OBJECT_ID",
	[6013] = "INVALID_OBJECT_ID",
	[6014] = "INVALID_OBJECT_ID",
	[6015] = "INVALID_OBJECT_ID",
	[6016] = "INVALID_OBJECT_ID",
	[6017] = "INVALID_OBJECT_ID",
	[6018] = "INVALID_OBJECT_ID",
	[6019] = "INVALID_OBJECT_ID",
	[6020] = "INVALID_OBJECT_ID",
	[6023] = "INVALID_OBJECT_ID",
	[6024] = "INVALID_OBJECT_ID",
	[6865] = "Маска с рогами & Рюкзак (Череп с рогами)",
	[7093] = "Рюкзак 'Erotic'",
	[7302] = "Стикер Victim",
	[7313] = "Ранец радио",
	[7392] = "Девушка на спину",
	[7891] = "Лист металла в руку",
	[8483] = "Маска череп",
	[8492] = "Крылья & Красная накидка",
	[8493] = "Пиратский корабль на спину",
	[8548] = "Модификация: Зомби",
	[8644] = "Два кинжала на спину",
	[8674] = "Забор в виде сетки",
	[9527] = "Когда тебе звонят",
	[9584] = "Рюкзак пароход",
	[9833] = "Реактивный водный ранец",
	[9958] = "submarr_sfe",
	[10145] = "Шляпа из будущего",
	[10281] = "Машина из стены",
	[10757] = "Самолёт за спиной",
	[11417] = "Портативная АЗС",
	[11489] = "Крылья гаргульи",
	[11700] = "Модификация Химик",
	[11704] = "Маска демона",
	[11705] = "Кейс для оружия",
	[11712] = "Крест",
	[11713] = "Рюкзак пожарного",
	[11722] = "Краситель",
	[11723] = "SauceBottle2",
	[11725] = "DONATE",
	[11726] = "Золотой посох",
	[11727] = "Реферальная монета, Очки будущего 2",
	[11728] = "Белый домофон",
	[11732] = "Маска лицо в сердечке",
	[11733] = "Снежные сани 2",
	[11734] = "Сани на спину",
	[11736] = "Антибиотики и маска от короновируса",
	[11738] = "Рюкзак медика красный",
	[11739] = "Праздничный торт",
	[11741] = "Зловещая монета & Чёрный праздничный торт (объект)",
	[11745] = "Сумка для ноутбука",
	[11748] = "Скрепки",
	[11749] = "Наручники и подводная маска",
	[11750] = "VR-очки и моноколь",
	[13562] = "Крутящаяся дубина",
	[13646] = "Золотая рулетка",
	[13667] = "Маска обезьяны",
	[14467] = "Человечек на плечо",
	[14527] = "Крылья стрекозы",
	[14608] = "Копье бога",
	[14611] = "Корона (2)",
	[14637] = "Два дракона",
	[16112] = "Точильный камень",
	[16368] = "Красная шляпа",
	[16442] = "Рюкзак корова",
	[16630] = "Металлический забор",
	[16776] = "Петух на плечо",
	[16778] = "НЛО на плечо",
	[16779] = "Люстра-вентилятор",
	[17027] = "Серебро",
	[18003] = "Оружие",
	[18632] = "Удочка",
	[18633] = "Балонный ключ на спину",
	[18634] = "Лом на спину",
	[18635] = "Молоток на спину",
	[18636] = "Кепка Police чёрная",
	[18637] = "Щит на спину",
	[18638] = "Каска строителя",
	[18640] = "Борода 1",
	[18641] = "Маска фонарь",
	[18642] = "Ранец шокер & Копье-шокер",
	[18643] = "Красная шляпа маяк",
	[18644] = "Отвёртка в руку",
	[18645] = "Мотошлем",
	[18646] = "Полицейская мигалка",
	[18647] = "Неон - красный",
	[18648] = "Неон - синий",
	[18649] = "Неон - зеленый",
	[18650] = "Неон - желтый",
	[18651] = "Неон - розовый",
	[18652] = "Неон - белый",
	[18660] = "Зелёный граффити",
	[18661] = "Ораньжевое граффити",
	[18662] = "Фиолетовое граффити",
	[18664] = "Фиолетовое граффити",
	[18667] = "Розовое граффити",
	[18782] = "Печенька на голову",
	[18848] = "Военный реактивный ранец",
	[18858] = "Реактивный рюкзак 1 & Реактивный рюкзак 2",
	[18865] = "Телефон",
	[18866] = "Телефон",
	[18867] = "Телефон",
	[18868] = "Телефон",
	[18869] = "Телефон",
	[18870] = "Телефон",
	[18871] = "Телефон",
	[18872] = "Телефон",
	[18873] = "Телефон",
	[18874] = "Телефон",
	[18875] = "ПипБой & Радио",
	[18890] = "Грабли на спину",
	[18893] = "Рваная бандана",
	[18906] = "Бандана на голову",
	[18907] = "Бандана на голову",
	[18908] = "Бандана на голову",
	[18909] = "Бандана на голову",
	[18910] = "Бандана на голову",
	[18911] = "Бандана",
	[18912] = "Бандана",
	[18913] = "Бандана",
	[18914] = "Бандана",
	[18915] = "Бандана",
	[18916] = "Бандана",
	[18917] = "Бандана",
	[18918] = "Бандана",
	[18919] = "Бандана & Рваная повязка",
	[18920] = "Бандана",
	[18921] = "Берет",
	[18922] = "Берет",
	[18923] = "Берет",
	[18924] = "Берет",
	[18925] = "Берет",
	[18926] = "Кепка передняя",
	[18927] = "Кепка передняя",
	[18928] = "Кепка передняя",
	[18929] = "Кепка передняя",
	[18930] = "Кепка передняя",
	[18931] = "Кепка передняя",
	[18932] = "Кепка передняя",
	[18933] = "Кепка передняя",
	[18934] = "Кепка передняя",
	[18935] = "Кепка передняя",
	[18936] = "Модификация: Палач",
	[18946] = "Рваная шляпа Байкеров",
	[18947] = "Шляпка",
	[18948] = "Шляпка",
	[18949] = "Шляпка",
	[18950] = "Шляпка",
	[18951] = "Шляпка",
	[18952] = "Шлем для бокса",
	[18953] = "Тёплая Шапка",
	[18954] = "Тёплая Шапка",
	[18955] = "Кепка обратная",
	[18956] = "Кепка обратная",
	[18957] = "Кепка обратная",
	[18958] = "Кепка обратная",
	[18959] = "Кепка обратная",
	[18963] = "Маска CJ",
	[18964] = "Бандитская шапка",
	[18965] = "Бандитская шапка",
	[18966] = "Бандитская шапка",
	[18967] = "Панамка",
	[18968] = "Панамка",
	[18969] = "Панамка",
	[18970] = "Шляпа",
	[18971] = "Шляпа",
	[18972] = "Шляпа",
	[18973] = "Шляпа",
	[18974] = "Рваная повязка Russian Mafia",
	[18976] = "Сумка-барыжка синяя",
	[18977] = "Мотошлем",
	[18978] = "Мотошлем",
	[18979] = "Мотошлем",
	[19006] = "Очки",
	[19007] = "Очки",
	[19008] = "Очки",
	[19009] = "Очки",
	[19010] = "Очки",
	[19011] = "Очки",
	[19012] = "Очки",
	[19013] = "Очки",
	[19014] = "Очки",
	[19015] = "Очки",
	[19016] = "Очки",
	[19017] = "Очки",
	[19018] = "Очки",
	[19019] = "Очки",
	[19020] = "Очки",
	[19021] = "Очки",
	[19022] = "Очки",
	[19023] = "Очки",
	[19024] = "Очки",
	[19025] = "Очки",
	[19026] = "Очки",
	[19027] = "Очки",
	[19028] = "Очки",
	[19029] = "Очки",
	[19030] = "Очки",
	[19031] = "Очки",
	[19032] = "Очки",
	[19033] = "Очки",
	[19034] = "Очки",
	[19035] = "Очки",
	[19036] = "Хоккейная маска",
	[19037] = "Хоккейная маска",
	[19038] = "Хоккейная маска",
	[19039] = "Часы",
	[19040] = "Часы",
	[19041] = "Часы",
	[19042] = "Часы",
	[19043] = "Часы",
	[19044] = "Часы",
	[19045] = "Часы",
	[19046] = "Часы",
	[19047] = "Часы",
	[19048] = "Часы",
	[19049] = "Часы",
	[19050] = "Часы",
	[19051] = "Часы",
	[19052] = "Часы",
	[19053] = "Часы",
	[19054] = "Красный подарок",
	[19055] = "Подарок",
	[19056] = "Подарок",
	[19057] = "Подарок",
	[19058] = "Подарок",
	[19059] = "Новог. игрушка (синяя)",
	[19060] = "Новог. игрушка (красная)",
	[19061] = "Новог. игрушка (зеленая)",
	[19062] = "Новог. игрушка (желтая)",
	[19063] = "Новог. игрушка (серая)",
	[19064] = "Новогодняя шапка",
	[19065] = "Новогодняя шапка (2)",
	[19066] = "Новогодняя шапка (3)",
	[19067] = "Шапки",
	[19068] = "Шапки",
	[19069] = "Шапка",
	[19076] = "Наряженная елка",
	[19077] = "Борода #2",
	[19078] = "Костюм попугая",
	[19079] = "Попугай на плечо",
	[19080] = "Шляпа маяк",
	[19081] = "Шляпа маяк",
	[19082] = "Шляпа маяк",
	[19083] = "Шляпа маяк",
	[19084] = "Шляпа маяк",
	[19085] = "Повязка на глаз",
	[19086] = "Улучшенное дилдо & Маска робота",
	[19090] = "Синяя новогодняя игрушка",
	[19091] = "Красный берет",
	[19092] = "Зелёный берет",
	[19093] = "Кепка DUDE белая",
	[19094] = "Гамбургер",
	[19095] = "Ковбойская шляпа",
	[19096] = "Ковбойская шляпа",
	[19097] = "Ковбойская шляпа",
	[19098] = "Ковбойская шляпа",
	[19099] = "Ковбойская шляпа",
	[19100] = "Ковбойская шляпа",
	[19101] = "Каска",
	[19102] = "Каска",
	[19103] = "Каска",
	[19104] = "Каска",
	[19105] = "Каска",
	[19106] = "Каска",
	[19107] = "Каска",
	[19108] = "Каска",
	[19109] = "Каска",
	[19110] = "Каска",
	[19111] = "Каска",
	[19112] = "Каска",
	[19113] = "Каска",
	[19114] = "Каска",
	[19115] = "Каска",
	[19116] = "Каска",
	[19117] = "Каска",
	[19118] = "Каска",
	[19119] = "Каска",
	[19120] = "Каска",
	[19121] = "Белый светильник",
	[19122] = "Синий светильник",
	[19123] = "Зелёный светильник",
	[19124] = "Красный светильник",
	[19125] = "Жёлтый светильник",
	[19126] = "Голубой светильник",
	[19127] = "Фиолетовый светильник",
	[19128] = "Кейс анимированный 3",
	[19130] = "Знак на груди",
	[19131] = "Круглая стрелка (синяя)",
	[19132] = "Стрелка",
	[19134] = "Стрелка (белая)",
	[19135] = "Вьетнамская шапка",
	[19136] = "Шляпа с дредами",
	[19137] = "Голова петуха",
	[19141] = "Каска спецназа (черная)",
	[19142] = "Бронежилет (черный)",
	[19160] = "Кепка DUDE жёлтая",
	[19161] = "Кепка Police серая",
	[19162] = "Кепка Police синяя",
	[19165] = "Карта Штата",
	[19168] = "Карта достопримечательностей (квест)",
	[19177] = "PHONE",
	[19182] = "PHONE",
	[19197] = "Ангельское кольцо на голову",
	[19200] = "Шлем с модификации Ghost",
	[19201] = "PHONE",
	[19246] = "Талон снятия предупреждения",
	[19273] = "Серый домофон",
	[19274] = "Парик (1)",
	[19306] = "Красный флажок",
	[19308] = "Шашка такси (желтая)",
	[19309] = "Шашка такси (чёрный-1)",
	[19310] = "Шашка такси (белый)",
	[19311] = "Шашка такси (чёрный-2)",
	[19314] = "Рога",
	[19315] = "Олень",
	[19317] = "Красная гитара",
	[19318] = "Чёрно-белая гитара",
	[19319] = "Чёрная гитара",
	[19320] = "Тыква",
	[19330] = "Женская шляпка",
	[19331] = "Тёмный плащ",
	[19332] = "Воздушный шар",
	[19333] = "Воздушный шар",
	[19334] = "Воздушный шар",
	[19335] = "Воздушный шар",
	[19336] = "Воздушный шар",
	[19337] = "Воздушный шар",
	[19338] = "Воздушный шар",
	[19339] = "Гроб",
	[19341] = "easter_egg01",
	[19342] = "easter_egg02",
	[19343] = "easter_egg03",
	[19344] = "easter_egg04",
	[19345] = "easter_egg05",
	[19346] = "Хот-дог на голову",
	[19347] = "Звезда на грудь",
	[19349] = "Монокль",
	[19352] = "Чёрный конус",
	[19353] = "Хз откуда",
	[19377] = "Хз откуда",
	[19399] = "Хз откуда",
	[19421] = "Наушники",
	[19422] = "Наушники",
	[19423] = "Наушники",
	[19424] = "Наушники",
	[19447] = "2 кнопки",
	[19468] = "Редкая ткань",
	[19469] = "Повязка на шею",
	[19470] = "Табличка SALE",
	[19472] = "Респиратор",
	[19487] = "Белый конус",
	[19513] = "Samsung Galaxy S10 (Серебрянный)",
	[19514] = "Каска спецназа (белая)",
	[19515] = "Бронежилет (белый)",
	[19517] = "Борода #1",
	[19518] = "Парик (2)",
	[19519] = "Парик (3)",
	[19520] = "Фуражка офицера",
	[19521] = "Фуражка офицера",
	[19522] = "Гражданский талон & Значок красного домика",
	[19523] = "Значок оранжевого домика",
	[19524] = "Значок желтого домика",
	[19525] = "Праздничный торт",
	[19527] = "Капюшон, Зелёный фонарь, Зелёные погоны, Шапка Британца",
	[19528] = "Шляпа волшебника",
	[19553] = "Фермерская шляпа",
	[19554] = "Шапка баллас",
	[19555] = "Модификация: Клешни рака",
	[19557] = "Маска Зорро",
	[19558] = "Кепка (развозчика пиццы)",
	[19559] = "Походный рюкзак",
	[19566] = "Энергитический батончик",
	[19572] = "Ларец кастомных аксессуаров",
	[19573] = "Рюкзак угол",
	[19576] = "Модификация: Гринч",
	[19578] = "Банан",
	[19580] = "Пицца",
	[19581] = "Сковородка",
	[19590] = "Меч",
	[19591] = "Китайский веер",
	[19601] = "Снегоуборочный бампер",
	[19602] = "Зелёный щит & Монета Хэллоуина",
	[19605] = "С ящик Хэллоуина",
	[19612] = "Магнитофон",
	[19613] = "Сундук рулетки",
	[19614] = "Ларец с премией",
	[19620] = "Полицейский ранец & Палка красно-синяя",
	[19621] = "Канистра на правое бедро",
	[19623] = "Фотоаппарат на грудь",
	[19624] = "Большой чемодан",
	[19625] = "Сигареты",
	[19626] = "Лопата в руку (2)",
	[19627] = "Ремонтный набор (/repcar)",
	[19630] = "Рыба",
	[19631] = "Кирка на спину",
	[19632] = "Горящий щит",
	[19636] = "Ларек с фруктами",
	[19637] = "Ящик с зелеными яблоками",
	[19638] = "Ящик с желтами яблоками",
	[19716] = "Хз откуда",
	[19737] = "С ящик Хэллоуина",
	[19748] = "С ящик Хэллоуина",
	[19773] = "Нашивка",
	[19774] = "Нашивка",
	[19775] = "Нашивка",
	[19777] = "Логотип FBI",
	[19778] = "Нашивка",
	[19779] = "Нашивка",
	[19780] = "Нашивка",
	[19781] = "Нашивка",
	[19782] = "Нашивка",
	[19783] = "Нашивка",
	[19792] = "Сим.карты",
	[19797] = "Погоны красно-синие & 3D-очки & Кейс анимированный 1",
	[19801] = "Маска (/mask)",
	[19804] = "Отмычка от тюремной двери",
	[19806] = "Новогодний реактивный ранец",
	[19807] = "Рюкзак телефон",
	[19813] = "Коричневый рюкзак",
	[19816] = "Балон",
	[19820] = "Бутылка алко 1",
	[19821] = "Бутылка алко 2",
	[19823] = "Желтая бита на спину",
	[19824] = "Бита-бутылка на спину",
	[19827] = "Хз откуда",
	[19828] = "Белый рюкзак",
	[19831] = "Рюкзак с крышкой",
	[19833] = "Корова",
	[19840] = "Красный плащ",
	[19843] = "Материалы",
	[19845] = "Панель (деталь тюнинга)",
	[19846] = "Панель",
	[19847] = "Копченая нога",
	[19848] = "Подиум",
	[19865] = "Забор из мелких досок",
	[19874] = "Адреналин",
	[19878] = "Скейт на спину",
	[19882] = "Жареное мясо оленины & Жареная рыба",
	[19893] = "Ноутбук",
	[19900] = "Ларец Super Car Box",
	[19904] = "Жилет грузчика",
	[19914] = "Бита",
	[19917] = "Техно-рюкзак 3",
	[19918] = "Сундук рулетки",
	[19921] = "Красный чемодан",
	[19928] = "Сундук Хэллоуина",
	[19941] = "Золото",
	[19942] = "Укол адреналина",
	[19996] = "Металлический стул",
	[19997] = "Деревянный стол",
	[19998] = "Зажигалка"
};
----------------------------------------
local friends =
{
	"Sawa_Seleznev",
	"Denis_Seleznev",
	"Avksentiu_Adaw",
	"Vartan_Germun",
	"Mawka_Dvornyawka",
	"Roy_Shelby"
};
----------------------------------------
local pidori =
{
	"Yuma_Tanaka",
	"Miguel_Guevara",
	"Fernando_Klyn",
	"Vartan_Germun",
	"Fabio_Vistero",
	"Denis_Watcon",
	"Yuta_Takeda",
	"Hun_Aoto",
	"Taiga_Aoto",
	"Toby_Weilong",
	"Underground_Monster",
	"Tiz_Cartier",
	"Dexter_Shakespeare",
	"Scarlet_Johansson",
	"Killa_Karsxrovs",
	"August_Walker",
	"San_Sweezy",
	"Ray_Lasco",
	"Vlad_GoIdy"
};
----------------------------------------
local _message = {}

function push_message(text, del)
	del = del or 5
	_message[#_message+1] =
	{
		active = false,
		time = 0,
		showtime = del,
		text = text
	}
end
----------------------------------------
local imgui = require('imgui')
require("encoding").default = "CP1251"
u8 = require("encoding").UTF8
local inicfg = require("inicfg")
local sampev = require("samp.events")
local key = require 'vkeys'
require "lib.moonloader"
local memory = require'memory'
local bit = require('numberlua')
----------------------------------------
arial_12_5 = renderCreateFont('Arial', 12, 5)
molot_8_5 = renderCreateFont("Molot", 8, 5)
molot_10_9 = renderCreateFont('Molot', 10, 9)
--------------------[Auto /vr]--------------------
local delay_autovr = 0.5
--------------------[Продовоз]--------------------
local prodovoz_timer = 0
local prods = 2000
--------------------[NoBalloons]--------------------
local balls = 
{
	[19332] = {3, 3}, 		-- Red
	[19333] = {152, 152}, 	-- Blue
	[19334] = {1, 1}, 		-- White
	[19335] = {152, 6}, 	-- Blue & Yellow
	[19336] = {126, 1}, 	-- Pink & White
	[19337] = {243, 6}, 	-- Green & Yellow
	[19338] = {243, 3}, 	-- Green and Red
}
--------------------[Дальний чат]--------------------
local chatbuble = {}
--------------------[Стиллер объектов на транспорт]--------------------
local objectsTable = {}
local lastPlayerState = -1
--------------------[Автоввод текста в лавку]--------------------
dialogs_lavka = -1
--------------------[Анализ цен на ЦР]--------------------
local analysis = nil
local last_text = nil
local data_cr = {}
local template = 
{
	last_update = nil,
	sell = {},
	buy = {}
}
----------------------------------------
local path_cr = getWorkingDirectory() .. '\\config\\cr_items.json'
if not doesFileExist(path_cr) then
	data_cr = template
	createDirectory(getWorkingDirectory() .. '\\config\\')
	local file_open_cr = io.open(path_cr, "w")
	file_open_cr:write(encodeJson(data_cr))
	file_open_cr:close()
else
	local file_open_cr = io.open(path_cr, "r")
	data_cr = decodeJson(file_open_cr:read('*a'))
	file_open_cr:close()
end
--------------------[Новый автолут]--------------------
local autoloot_td = {''}
--------------------[Остальное]--------------------
local chatMessages = {}
local reconnect_timer = 0
local message_report = ""
local local_name = ""
local carid = -1
local windowstate = imgui.ImBool(false)
----------------------------------------
local file = 'settings.ini'
local path = getWorkingDirectory() .. '\\config'
----------------------------------------
local mainIni = inicfg.load(
{
	config =
	{
		renderTime = true,
		killStat = true,
		HealthArmour = true,
		del_opisanie_3d = true,
		autousedrugs = false,
		prodovoz_edit = 2000,
		set_weather = 10,
		set_time = 12
	},
	account =
	{
		my_nick = 'Nickname',
		my_password = 'Password',
		my_pincode = '0000',
		my_nick_2 = 'Nickname_2',
		my_password_2 = 'Password_2',
		my_pincode_2 = '0000',
		my_nick_3 = 'Nickname_3',
		my_password_3 = 'Password_3',
		my_pincode_3 = '0000'
	},
	chat =
	{
		chatlog = true,
		----------------------------------------
		renderchatbuy = true,
		removechatbuy = false,
		tosampfuncsbuy = true,
		----------------------------------------
		removechatmicro = false,
		----------------------------------------
		removechatdepatment = true,
		----------------------------------------
		removechatnews = true,
		----------------------------------------
		removechatalians = false,
		----------------------------------------
		removechatwait = true,
		----------------------------------------
		removechatfond = true,
		----------------------------------------
		removechatspam = true,
		tosampfuncsspam = true,
		----------------------------------------
		sendconnect = true,
		senddisconnect = true,
		tosampfuncsconnect = true,
		tosampfuncsdisconnect = true,
		----------------------------------------
		rendervipchat = true,
		tosampfuncsvipchat = false,
		removevipchat = true,
		----------------------------------------
		renderjobchat = false,
		tosampfuncsjobchat = false,
		removejobchat = true,
		----------------------------------------
		renderadv = true,
		tosampfuncsadv = false,
		removeadv = true,
		----------------------------------------
		distant_active = false,
		distant_count = 10
	},
	chest =
	{
		roll_standart = true,
		roll_platinum = true,
		roll_maska = true,
		roll_state = true,
		roll_wait = 10,
	},
	destroy =
	{
		bucket = true,
		tree = true,
		serdce = true,
		xlam = true,
	},
	lavka =
	{
		drugs = 0,
		drugs_price = 100,
		----------------------------------------
		materials = 0,
		materials_price = 10,
		----------------------------------------
		fam_talon = 0,
		fam_talon_price = 5000,
		----------------------------------------
		cherepa = 0,
		cherepa_price = 1000,
		----------------------------------------
		sale_talon = 0,
		sale_talon_price = 300000,
		----------------------------------------
		gift = 0,
		gift_price = 4000,
		----------------------------------------
		cooper_roll = 0,
		cooper_roll_price = 6000,
		----------------------------------------
		silver_roll = 0,
		silver_roll_price = 20000,
		----------------------------------------
		gold_roll = 0,
		gold_roll_price = 150000,
		----------------------------------------
		xlopok = 0,
		xlopok_price = 100,
		----------------------------------------
		lens = 0,
		lens_price = 100,
		----------------------------------------
		stone = 0,
		stone_price = 200,
		----------------------------------------
		metal = 0,
		metal_price = 1000,
		----------------------------------------
		bronze = 0,
		bronze_price = 1500,
		----------------------------------------
		silver = 0,
		silver_price = 2000,
		----------------------------------------
		gold = 0,
		gold_price = 5000,
		----------------------------------------
		alyminiu = 0,
		alyminiu_price = 4000,
		----------------------------------------
		tywka = 0,
		tywka_price = 500,
		----------------------------------------
		wkyra = 0,
		wkyra_price = 500,
		----------------------------------------
		euro = 0,
		euro_price = 4000,
		----------------------------------------
		gr_talon = 0,
		gr_talon_price = 1000,
		----------------------------------------
		antibiotiki = 0,
		antibiotiki_price = 2000,
		----------------------------------------
		prison = 0,
		prison_price = 35000,
		----------------------------------------
		mod_wings_price = 0,
		----------------------------------------
		mod_reg_eyes_price = 0,
		----------------------------------------
		zlov_moneta = 0,
		zlov_moneta_price = 200000,
		----------------------------------------
		toch_stone = 0,
		toch_stone_price = 20000,
		----------------------------------------
		bilet_6 = 0,
		bilet_6_price = 1000,
		----------------------------------------
		sticker_cluck = 0,
		sticker_cluck_price = 5000,
		----------------------------------------
		sticker_binko = 0,
		sticker_binko_price = 5000,
		----------------------------------------
		sticker_jizzy = 0,
		sticker_jizzy_price = 5000,
		----------------------------------------
		platinum_roll = 0,
		platinum_roll_price = 300000,
		----------------------------------------
		rare_yellow = 0,
		rare_yellow_price = 150000,
		----------------------------------------
		rare_red = 0,
		rare_red_price = 100000,
		----------------------------------------
		rare_blue = 0,
		rare_blue_price = 150000,
		----------------------------------------
		fam_money = 0,
		fam_money_price = 1000,
		----------------------------------------
		box_marvel = 0,
		box_marvel_price = 50000,
		----------------------------------------
		box_djent = 0,
		box_djent_price = 50000,
		----------------------------------------
		box_minecraft = 0,
		box_minecraft_price = 50000,
		----------------------------------------
		box_moto = 0,
		box_moto_price = 50000,
		----------------------------------------
		box_car = 0,
		box_car_price = 50000,
		----------------------------------------
		box_nostalg = 0,
		box_nostalg_price = 50000,
		----------------------------------------
		larec_oligarha = 0,
		larec_oligarha_price = 100000,
		----------------------------------------
		rykzak_para_price = 0,
		----------------------------------------
		rykzak_pirat_price = 0,
		----------------------------------------
		mod_teddi_1_price = 0,
		----------------------------------------
		mod_teddi_2_price = 0,
		----------------------------------------
		mod_teddi_3_price = 0,
		----------------------------------------
		band_respect = 0,
		band_respect_price = 500,
		----------------------------------------
		larec_premium = 0,
		larec_premium_price = 50000,
		----------------------------------------
		larec_car_box = 0,
		larec_car_box_price = 500000
	},
	autopiar =
	{
		----------------------------------------
		vr_text = '',
		vr_delay = 3,
		vr_active = false,
		----------------------------------------
		fam_text = '',
		fam_delay = 3,
		fam_active = false,
		----------------------------------------
		al_text = '',
		al_delay = 3,
		al_active = false
		----------------------------------------
	}
},file)

if not doesDirectoryExist(path) then
	inicfg.save(mainIni,file)
end

local elements =
{
	config =
	{
		renderTime = imgui.ImBool(mainIni.config.renderTime),
		killStat = imgui.ImBool(mainIni.config.killStat),
		HealthArmour = imgui.ImBool(mainIni.config.HealthArmour),
		del_opisanie_3d = imgui.ImBool(mainIni.config.del_opisanie_3d),
		autousedrugs = imgui.ImBool(mainIni.config.autousedrugs),
		prodovoz_edit = imgui.ImInt(mainIni.config.prodovoz_edit),
		attach_id = imgui.ImInt(1001),
		del_stream = imgui.ImBool(false),
		del_shout = imgui.ImBool(false),
		del_stream_pl = imgui.ImBool(false),
		anim_car = imgui.ImBool(false),
		set_weather = imgui.ImInt(mainIni.config.set_weather),
		set_time = imgui.ImInt(mainIni.config.set_time)
	},
	account =
	{
		my_nick = imgui.ImBuffer(tostring(mainIni.account.my_nick), 24),
		my_password = imgui.ImBuffer(tostring(mainIni.account.my_password), 100),
		my_pincode = imgui.ImBuffer(tostring(mainIni.account.my_pincode), 24),
		my_nick_2 = imgui.ImBuffer(tostring(mainIni.account.my_nick_2), 24),
		my_password_2 = imgui.ImBuffer(tostring(mainIni.account.my_password_2), 100),
		my_pincode_2 = imgui.ImBuffer(tostring(mainIni.account.my_pincode_2), 24),
		my_nick_3 = imgui.ImBuffer(tostring(mainIni.account.my_nick_3), 24),
		my_password_3 = imgui.ImBuffer(tostring(mainIni.account.my_password_3), 100),
		my_pincode_3 = imgui.ImBuffer(tostring(mainIni.account.my_pincode_3), 24)
	},
	chat =
	{
		chatlog = imgui.ImBool(mainIni.chat.chatlog),
		----------------------------------------
		renderchatbuy = imgui.ImBool(mainIni.chat.renderchatbuy),
		removechatbuy = imgui.ImBool(mainIni.chat.removechatbuy),
		tosampfuncsbuy = imgui.ImBool(mainIni.chat.tosampfuncsbuy),
		----------------------------------------
		removechatmicro = imgui.ImBool(mainIni.chat.removechatmicro),
		----------------------------------------
		removechatdepatment = imgui.ImBool(mainIni.chat.removechatdepatment),
		----------------------------------------
		removechatnews = imgui.ImBool(mainIni.chat.removechatnews),
		----------------------------------------
		removechatalians = imgui.ImBool(mainIni.chat.removechatalians),
		----------------------------------------
		removechatwait = imgui.ImBool(mainIni.chat.removechatwait),
		----------------------------------------
		removechatfond = imgui.ImBool(mainIni.chat.removechatfond),
		----------------------------------------
		removechatspam = imgui.ImBool(mainIni.chat.removechatspam),
		tosampfuncsspam = imgui.ImBool(mainIni.chat.tosampfuncsspam),
		----------------------------------------
		sendconnect = imgui.ImBool(mainIni.chat.sendconnect),
		senddisconnect = imgui.ImBool(mainIni.chat.senddisconnect),
		tosampfuncsconnect = imgui.ImBool(mainIni.chat.tosampfuncsconnect),
		tosampfuncsdisconnect = imgui.ImBool(mainIni.chat.tosampfuncsdisconnect),
		----------------------------------------
		rendervipchat = imgui.ImBool(mainIni.chat.rendervipchat),
		tosampfuncsvipchat = imgui.ImBool(mainIni.chat.tosampfuncsvipchat),
		removevipchat = imgui.ImBool(mainIni.chat.removevipchat),
		----------------------------------------
		renderjobchat = imgui.ImBool(mainIni.chat.renderjobchat),
		tosampfuncsjobchat = imgui.ImBool(mainIni.chat.tosampfuncsjobchat),
		removejobchat = imgui.ImBool(mainIni.chat.removejobchat),
		----------------------------------------
		renderadv = imgui.ImBool(mainIni.chat.renderadv),
		tosampfuncsadv = imgui.ImBool(mainIni.chat.tosampfuncsadv),
		removeadv = imgui.ImBool(mainIni.chat.removeadv),
		----------------------------------------
		distant_active = imgui.ImBool(mainIni.chat.distant_active),
		distant_count = imgui.ImInt(mainIni.chat.distant_count)
	},
	chest =
	{
		roll_standart = imgui.ImBool(mainIni.chest.roll_standart),
		roll_platinum = imgui.ImBool(mainIni.chest.roll_platinum),
		roll_maska = imgui.ImBool(mainIni.chest.roll_maska),
		roll_state = imgui.ImBool(mainIni.chest.roll_state),
		roll_wait = imgui.ImInt(mainIni.chest.roll_wait),
	},
	destroy =
	{
		bucket = imgui.ImBool(mainIni.destroy.bucket),
		tree = imgui.ImBool(mainIni.destroy.tree),
		serdce = imgui.ImBool(mainIni.destroy.serdce),
		xlam = imgui.ImBool(mainIni.destroy.xlam)
	},
	lavka =
	{
		drugs = imgui.ImInt(mainIni.lavka.drugs),
		drugs_price = imgui.ImInt(mainIni.lavka.drugs_price),
		----------------------------------------
		materials = imgui.ImInt(mainIni.lavka.materials),
		materials_price = imgui.ImInt(mainIni.lavka.materials_price),
		----------------------------------------
		fam_talon = imgui.ImInt(mainIni.lavka.fam_talon),
		fam_talon_price = imgui.ImInt(mainIni.lavka.fam_talon_price),
		----------------------------------------
		cherepa = imgui.ImInt(mainIni.lavka.cherepa),
		cherepa_price = imgui.ImInt(mainIni.lavka.cherepa_price),
		----------------------------------------
		sale_talon = imgui.ImInt(mainIni.lavka.sale_talon),
		sale_talon_price = imgui.ImInt(mainIni.lavka.sale_talon_price),
		----------------------------------------
		gift = imgui.ImInt(mainIni.lavka.gift),
		gift_price = imgui.ImInt(mainIni.lavka.gift_price),
		----------------------------------------
		cooper_roll = imgui.ImInt(mainIni.lavka.cooper_roll),
		cooper_roll_price = imgui.ImInt(mainIni.lavka.cooper_roll_price),
		----------------------------------------
		silver_roll = imgui.ImInt(mainIni.lavka.silver_roll),
		silver_roll_price = imgui.ImInt(mainIni.lavka.silver_roll_price),
		----------------------------------------
		gold_roll = imgui.ImInt(mainIni.lavka.gold_roll),
		gold_roll_price = imgui.ImInt(mainIni.lavka.gold_roll_price),
		----------------------------------------
		xlopok = imgui.ImInt(mainIni.lavka.xlopok),
		xlopok_price = imgui.ImInt(mainIni.lavka.xlopok_price),
		----------------------------------------
		lens = imgui.ImInt(mainIni.lavka.lens),
		lens_price = imgui.ImInt(mainIni.lavka.lens_price),
		----------------------------------------
		stone = imgui.ImInt(mainIni.lavka.stone),
		stone_price = imgui.ImInt(mainIni.lavka.stone_price),
		----------------------------------------
		metal = imgui.ImInt(mainIni.lavka.metal),
		metal_price = imgui.ImInt(mainIni.lavka.metal_price),
		----------------------------------------
		bronze = imgui.ImInt(mainIni.lavka.bronze),
		bronze_price = imgui.ImInt(mainIni.lavka.bronze_price),
		----------------------------------------
		silver = imgui.ImInt(mainIni.lavka.silver),
		silver_price = imgui.ImInt(mainIni.lavka.silver_price),
		----------------------------------------
		gold = imgui.ImInt(mainIni.lavka.gold),
		gold_price = imgui.ImInt(mainIni.lavka.gold_price),
		----------------------------------------
		alyminiu = imgui.ImInt(mainIni.lavka.alyminiu),
		alyminiu_price = imgui.ImInt(mainIni.lavka.alyminiu_price),
		----------------------------------------
		tywka = imgui.ImInt(mainIni.lavka.tywka),
		tywka_price = imgui.ImInt(mainIni.lavka.tywka_price),
		----------------------------------------
		wkyra = imgui.ImInt(mainIni.lavka.wkyra),
		wkyra_price = imgui.ImInt(mainIni.lavka.wkyra_price),
		----------------------------------------
		euro = imgui.ImInt(mainIni.lavka.euro),
		euro_price = imgui.ImInt(mainIni.lavka.euro_price),
		----------------------------------------
		gr_talon = imgui.ImInt(mainIni.lavka.gr_talon),
		gr_talon_price = imgui.ImInt(mainIni.lavka.gr_talon_price),
		----------------------------------------
		antibiotiki = imgui.ImInt(mainIni.lavka.antibiotiki),
		antibiotiki_price = imgui.ImInt(mainIni.lavka.antibiotiki_price),
		----------------------------------------
		prison = imgui.ImInt(mainIni.lavka.prison),
		prison_price = imgui.ImInt(mainIni.lavka.prison_price),
		----------------------------------------
		mod_wings_price = imgui.ImInt(mainIni.lavka.mod_wings_price),
		----------------------------------------
		mod_reg_eyes_price = imgui.ImInt(mainIni.lavka.mod_reg_eyes_price),
		----------------------------------------
		zlov_moneta = imgui.ImInt(mainIni.lavka.zlov_moneta),
		zlov_moneta_price = imgui.ImInt(mainIni.lavka.zlov_moneta_price),
		----------------------------------------
		toch_stone = imgui.ImInt(mainIni.lavka.toch_stone),
		toch_stone_price = imgui.ImInt(mainIni.lavka.toch_stone_price),
		----------------------------------------
		bilet_6 = imgui.ImInt(mainIni.lavka.bilet_6),
		bilet_6_price = imgui.ImInt(mainIni.lavka.bilet_6_price),
		----------------------------------------
		sticker_cluck = imgui.ImInt(mainIni.lavka.sticker_cluck),
		sticker_cluck_price = imgui.ImInt(mainIni.lavka.sticker_cluck_price),
		----------------------------------------
		sticker_binko = imgui.ImInt(mainIni.lavka.sticker_binko),
		sticker_binko_price = imgui.ImInt(mainIni.lavka.sticker_binko_price),
		----------------------------------------
		sticker_jizzy = imgui.ImInt(mainIni.lavka.sticker_jizzy),
		sticker_jizzy_price = imgui.ImInt(mainIni.lavka.sticker_jizzy_price),
		----------------------------------------
		platinum_roll = imgui.ImInt(mainIni.lavka.platinum_roll),
		platinum_roll_price = imgui.ImInt(mainIni.lavka.platinum_roll_price),
		----------------------------------------
		rare_yellow = imgui.ImInt(mainIni.lavka.rare_yellow),
		rare_yellow_price = imgui.ImInt(mainIni.lavka.rare_yellow_price),
		----------------------------------------
		rare_red = imgui.ImInt(mainIni.lavka.rare_red),
		rare_red_price = imgui.ImInt(mainIni.lavka.rare_red_price),
		----------------------------------------
		rare_blue = imgui.ImInt(mainIni.lavka.rare_blue),
		rare_blue_price = imgui.ImInt(mainIni.lavka.rare_blue_price),
		----------------------------------------
		fam_money = imgui.ImInt(mainIni.lavka.fam_money),
		fam_money_price = imgui.ImInt(mainIni.lavka.fam_money_price),
		----------------------------------------
		box_marvel = imgui.ImInt(mainIni.lavka.box_marvel),
		box_marvel_price = imgui.ImInt(mainIni.lavka.box_marvel_price),
		----------------------------------------
		box_djent = imgui.ImInt(mainIni.lavka.box_djent),
		box_djent_price = imgui.ImInt(mainIni.lavka.box_djent_price),
		----------------------------------------
		box_minecraft = imgui.ImInt(mainIni.lavka.box_minecraft),
		box_minecraft_price = imgui.ImInt(mainIni.lavka.box_minecraft_price),
		----------------------------------------
		box_moto = imgui.ImInt(mainIni.lavka.box_moto),
		box_moto_price = imgui.ImInt(mainIni.lavka.box_moto_price),
		----------------------------------------
		box_car = imgui.ImInt(mainIni.lavka.box_car),
		box_car_price = imgui.ImInt(mainIni.lavka.box_car_price),
		----------------------------------------
		box_nostalg = imgui.ImInt(mainIni.lavka.box_nostalg),
		box_nostalg_price = imgui.ImInt(mainIni.lavka.box_nostalg_price),
		----------------------------------------
		larec_oligarha = imgui.ImInt(mainIni.lavka.larec_oligarha),
		larec_oligarha_price = imgui.ImInt(mainIni.lavka.larec_oligarha_price),
		----------------------------------------
		rykzak_para_price = imgui.ImInt(mainIni.lavka.rykzak_para_price),
		----------------------------------------
		rykzak_pirat_price = imgui.ImInt(mainIni.lavka.rykzak_pirat_price),
		----------------------------------------
		mod_teddi_1_price = imgui.ImInt(mainIni.lavka.mod_teddi_1_price),
		----------------------------------------
		mod_teddi_2_price = imgui.ImInt(mainIni.lavka.mod_teddi_2_price),
		----------------------------------------
		mod_teddi_3_price = imgui.ImInt(mainIni.lavka.mod_teddi_3_price),
		----------------------------------------
		band_respect = imgui.ImInt(mainIni.lavka.band_respect),
		band_respect_price = imgui.ImInt(mainIni.lavka.band_respect_price),
		----------------------------------------
		larec_premium = imgui.ImInt(mainIni.lavka.larec_premium),
		larec_premium_price = imgui.ImInt(mainIni.lavka.larec_premium_price),
		----------------------------------------
		larec_car_box = imgui.ImInt(mainIni.lavka.larec_car_box),
		larec_car_box_price = imgui.ImInt(mainIni.lavka.larec_car_box_price)
	},
	autopiar =
	{
		----------------------------------------
		vr_text = imgui.ImBuffer(tostring(mainIni.autopiar.vr_text), 144),
		vr_delay = imgui.ImInt(mainIni.autopiar.vr_delay),
		vr_active = imgui.ImBool(mainIni.autopiar.vr_active),
		----------------------------------------
		fam_text = imgui.ImBuffer(tostring(mainIni.autopiar.fam_text), 144),
		fam_delay = imgui.ImInt(mainIni.autopiar.fam_delay),
		fam_active = imgui.ImBool(mainIni.autopiar.fam_active),
		----------------------------------------
		al_text = imgui.ImBuffer(tostring(mainIni.autopiar.al_text), 144),
		al_delay = imgui.ImInt(mainIni.autopiar.al_delay),
		al_active = imgui.ImBool(mainIni.autopiar.al_active)
		----------------------------------------
	},
	autotoch =
	{
		autotoch_active = false,
		checked_radio = imgui.ImInt(12),
		checked_inv = imgui.ImInt(2),
		autotoch_enable = imgui.ImBool(false)
	},
	autoopenroul =
	{
		open_roul_bronze = imgui.ImBool(false),
		open_roul_silver = imgui.ImBool(false),
		open_roul_gold = imgui.ImBool(false),
		open_roul_platina = imgui.ImBool(false),
		open_roul_active = true,
	},
	state =
	{
		----------------------------------------
		nicks = false,
		----------------------------------------
		pidors = false,
		----------------------------------------
		bagajnik = false,
		----------------------------------------
		finds = 65535,
		----------------------------------------
		waxta = false,
		----------------------------------------
		BTC = false,
		----------------------------------------
		autoloot = false,
		autoloot_number = 0,
		----------------------------------------
		showid = false,
		showpos = false,
		showmodel = false,
		----------------------------------------
		stealer_td = true,
		----------------------------------------
		alt = false
		----------------------------------------
	}
}
----------------------------------------
local vr_timer = 0
if elements.autopiar.vr_active.v == true then
	vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
end
----------------------------------------
local fam_timer = 0
if elements.autopiar.fam_active.v == true then
	fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
end
----------------------------------------
local al_timer = 0
if elements.autopiar.al_active.v == true then
	al_timer = os.time()+(elements.autopiar.al_delay.v*60)
end
----------------------------------------
chest_timer_1 = os.time()+(elements.chest.roll_wait.v*60)
chest_timer_2 = 0
chest_timer_3 = 0
----------------------------------------
function main()
	while not isSampAvailable() do wait(0) end
	if not doesDirectoryExist("moonloader\\logs") then createDirectory("moonloader\\logs") end
	if not doesDirectoryExist("moonloader\\stealer") then createDirectory("moonloader\\stealer") end
	if not doesDirectoryExist("moonloader\\stealer\\vehicles") then createDirectory("moonloader\\stealer\\vehicles") end
	if not doesDirectoryExist("moonloader\\stealer\\textdraws") then createDirectory("moonloader\\stealer\\textdraws") end
	----------------------------------------
	memory.setuint8(0x5700F7, 0xB8, true)
	memory.copy(0x5700FB, memory.strptr('\x89\x96\xBC\x00\x00\x00'), 6, true)
	memory.setuint8(0x570103, 0xEB, true)
	--------------------[NoBalloons]--------------------
	local result, samp = loadDynamicLibrary("samp.dll")
	if result then 
		-- fix changeCarColour function
		writeMemory(samp + 0xB0DE0, 0x02, 0xC390, true) 
	end
	--------------------[Продолжительность взрывов воздушного транспорта]--------------------
	memory.setuint32(0x736F88, 0, true)
	--------------------[Отключает песок из под колес]--------------------
	memory.fill(0x6AA8CF, 0x90, 53, true)
	--------------------[Отключение волн на воде]--------------------
	memory.fill(0x6E968A, 0x90, 2, true)
	memory.fill(0x6E7210, 0x90, 4, true)
	--------------------[Возвращает солнце в SAMP]--------------------
	local oldProtect = memory.unprotect(0x53C136, 5)
	memory.hex2bin("E865041C00", 0x53C136, 5)
	memory.protect(0x53C136, 5, oldProtect)
	----------------------------------------
	sampHandle = sampGetBase()
	writeMemory(sampHandle + 0x2D3C45, 4, 0, 1)
	--------------------[Тени]--------------------
	memory.write(5635169, 0, 1, false)
	memory.write(5635259, 0, 1, false)
	memory.setint32(12043496, 0, false)
	memory.setint32(12043500, 0, false)
	--------------------[Низкие облака выкл.]--------------------
	memory.fill(5497121, 144, 5, false)
	--------------------[Высокие облака выкл.]--------------------
	memory.write(5497268, -1869574000, 4, false)
	memory.write(5497272, 144, 1, false)
	--------------------[Отключение птиц]--------------------
	memory.fill(5497200, 144, 5, false)
	--------------------[Отключение эффектов]--------------------
	writeMemory(4891712, 4, 1443425411, false)
	writeMemory(7205311, 4, 1056964608, false)
	writeMemory(7205316, 4, 1065353216, false)
	writeMemory(7205321, 4, 1065353216, false)
	writeMemory(7205389, 4, 1056964608, false)
	writeMemory(7204123, 4, 1050253722, false)
	writeMemory(7204128, 4, 1065353216, false)
	writeMemory(7204133, 4, 1060320051, false)
	writeMemory(5527777, 4, 1036831949, false)
	writeMemory(4846974, 4, 1053609165, false)
	writeMemory(4846757, 4, 1053609165, false)
	----------------------------------------
	--autoupdate("https://raw.githubusercontent.com/metk1u/scripts/main/update.json", '['..string.upper(thisScript().name)..']: ')
	----------------------------------------
	for id_model_anti_stealer, name_model_anti_stealer in pairs(model_name_anti_stealer) do
		os.remove("moonloader\\stealer\\"..id_model_anti_stealer.." - "..name_model_anti_stealer..".notepad")
		os.remove("moonloader\\stealer\\"..id_model_anti_stealer.." - .notepad")
	end
	os.remove("moonloader\\stealer\\textdraws\\0000.notepad")
	----------------------------------------
	for model_id, name in pairs(textdraw_name) do
		os.remove("moonloader\\stealer\\textdraws\\"..model_id..".notepad")
	end
	----------------------------------------
	_, playerid = sampGetPlayerIdByCharHandle(PLAYER_PED)
	local_name = sampGetPlayerNickname(playerid)
	----------------------------------------
	sampRegisterChatCommand('chat',function() 
		windowstate.v = not windowstate.v
	end)
	-- sampRegisterChatCommand('sliver', function(arg)
		-- if arg:find('(.+), (.+)') then
			-- lua_thread.create(function()
				-- local command, delay = arg:match('(.+), (.+)')
					-- for i = 0, 999 do
							-- sampSendChat(command, tostring(i))
							-- wait(tonumber(delay))
					-- end
			-- end)		 
		-- else
			-- sampAddChatMessage('[Sliver by chapo]: {ffffff}/sliver [команда], [задержка]', 0xFFff004d)
		-- end
	-- end)
	-- local test = 9
	-- sampRegisterChatCommand('1',function()
		-- sampAddChatMessage(string.format('Успех! Вам удалось улучшить предмет Ёлка c +%d на +%d',test,test+1), 0x73b461)
		-- test = test+1
	-- end)
	----------------------------------------
	sampRegisterChatCommand('rec',function() 
		sampDisconnectWithReason(false)
		sampSetGamestate(1)
		push_message('Перезахожу...')
	end)
	----------------------------------------
	sampRegisterChatCommand('rr',function(arg)
		if #arg == 0 then
			sampAddChatMessage('Используй: /rr [жалоба]', 0xAFAFAF)
		else
			message_report = arg
			sampSendChat("/report")
		end
	end)
	----------------------------------------
	sampRegisterChatCommand('gocolor',function(number)
		if #number == 0 then
			sampAddChatMessage('Используй: /gocolor [color]', 0xAFAFAF)
		else
			r, g, b, a = explode_argb(number)
			join_rgb(r,g,b)
			sampAddChatMessage(string.format('%06X',join_rgb(r,g,b)), 0xAFAFAF)
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("nicks",function()
		elements.state.nicks = not elements.state.nicks
		push_message((elements.state.nicks and "Включаю" or "Выключаю")..' поиск игроков в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("pp",function()
		elements.state.pidors = not elements.state.pidors
		push_message((elements.state.pidors and "Включаю" or "Выключаю")..' поиск пидоров в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("p",function()
		for i = 0, sampGetMaxPlayerId() do
			if sampIsPlayerConnected(i) then
				nickname = sampGetPlayerNickname(i)
				for id = 1, #pidori do
					if nickname == pidori[id] then
						sampAddChatMessage('Пидор '..nickname..'['..i..'] находится на сервере.', 0xFF3300)
					end
				end
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand('finds',function(playerid)
		if #playerid == 0 then
			sampAddChatMessage('Используй: /finds [playerid]', 0xAFAFAF)
			if elements.state.finds ~= 65535 then
				elements.state.finds = 65535
				printString('~r~Find disable',2000)
				push_message('Выключаю поиск игрока.')
			end
		else
			if sampIsPlayerConnected(playerid) then
				if elements.state.finds == playerid then
					elements.state.finds = 65535
					printString('~r~Find disable',2000)
					push_message('Выключаю поиск игрока.')
				else
					sampSendChat("/id "..playerid)
					elements.state.finds = playerid
					printString('~g~Find enable',2000)
					push_message('Поиск ID:'..elements.state.finds..' активирован.')
				end
			else
				sampAddChatMessage('{FF3300}x{AFAFAF} Игрок не в игре.',0xAFAFAF)
			end
		end
	end)
	----------------------------------------
	sampRegisterChatCommand("waxta",function()
		elements.state.waxta = not elements.state.waxta
		push_message((elements.state.waxta and "Включаю" or "Выключаю")..' поиск руды в зоне стрима.')
	end)
	----------------------------------------
	sampRegisterChatCommand("btc",function()
		elements.state.BTC = not elements.state.BTC
		push_message((elements.state.BTC and "Включаю" or "Выключаю")..' скуп биткоинов.')
		printString('',0)
	end)
	----------------------------------------
	sampRegisterChatCommand("loot",function()
		elements.state.autoloot = not elements.state.autoloot
		push_message((elements.state.autoloot and "Включаю" or "Выключаю")..' пылесос.')
	end)
	----------------------------------------
	sampRegisterChatCommand('ud',function()
		sampSendChat("/usedrugs 3")
	end)
	----------------------------------------
	sampRegisterChatCommand('ar',function()
		sampSendChat("/armour")
	end)
	----------------------------------------
	sampRegisterChatCommand("showid",function()
		elements.state.showid = not elements.state.showid
		push_message((elements.state.showid and "Включаю" or "Выключаю")..' ID текстдравов.')
		----------------------------------------
		if elements.state.showmodel == true then
			elements.state.showmodel = false
			push_message('Выключаю MODEL текстдравов.')
		end
		----------------------------------------
		if elements.state.showpos == true then
			elements.state.showpos = false
			push_message('Выключаю X / Y текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("showpos",function()
		elements.state.showpos = not elements.state.showpos
		push_message((elements.state.showpos and "Включаю" or "Выключаю")..' X / Y текстдравов.')
		----------------------------------------
		if elements.state.showmodel == true then
			elements.state.showmodel = false
			push_message('Выключаю MODEL текстдравов.')
		end
		----------------------------------------
		if elements.state.showid == true then
			elements.state.showid = false
			push_message('Выключаю ID текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand("showmodel",function()
		elements.state.showmodel = not elements.state.showmodel
		push_message((elements.state.showmodel and "Включаю" or "Выключаю")..' MODEL текстдравов.')
		----------------------------------------
		if elements.state.showid == true then
			elements.state.showid = false
			push_message('Выключаю ID текстдравов.')
		end
		----------------------------------------
		if elements.state.showpos == true then
			elements.state.showpos = false
			push_message('Выключаю X / Y текстдравов.')
		end
		----------------------------------------
	end)
	----------------------------------------
	sampRegisterChatCommand('price',function(item)
		item = string_to_lower(tostring(item))
		if item ~= nil then
			local temp = {}
			for _, info_sell in ipairs(data_cr.sell) do
				if string_to_lower(info_sell['i']):find(item, 1, true) then
					local t = 
					{
						name = nil,
						sell = 'Неизвестно',
						buy = 'Неизвестно'
					}
					----------------------------------------
					t.name = info_sell['i']
					t.sell = sumFormat(tostring(info_sell['p']))
					----------------------------------------
					for _, info_buy in ipairs(data_cr.buy) do
						if info_sell['i'] == info_buy['i'] then
							t.buy = sumFormat(tostring(info_buy['p']))
							break
						end
					end
					----------------------------------------
					temp[#temp + 1] = (' > {FFFFFF}Товар: {FDDB6D}%s{FFFFFF} | На продажу: {FDDB6D}%s{FFFFFF} | На покупку: {FDDB6D}%s'):format(t.name, t.sell, t.buy)
				end
			end
			----------------------------------------
			if #temp >= 1 then
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Найден'.. (#temp > 1 and 'о' or '') .. ' {FDDB6D}' .. #temp .. '{FFFFFF} товар' .. (#temp > 1 and 'ов' or '') .. ':', 0xFFFFFF)
				for _, str in ipairs(temp) do
					sampAddChatMessage(str, 0xFFFFFF)
				end
				local isOld = os.time() - data_cr.last_update >= 86400
				sampAddChatMessage(('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Информация о цен' .. (#temp > 1 and 'ах' or 'е') .. ' от {FF3300}%s'):format(os.date('%d.%m.%Y ' .. (isOld and '( устарела )' or ''), data_cr.last_update)), 0xFFFFFF)
				return
			end
			sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Не удалось найти товар с похожим названием.', 0xFFFFFF)
			return
		end
		sampAddChatMessage('Используй: /price [название товара]', 0xAFAFAF)
	end)
	----------------------------------------
	sampRegisterChatCommand("alt",function()
		elements.state.alt = not elements.state.alt
		push_message((elements.state.alt and "Включаю" or "Выключаю")..' click ALT.')
	end)
	----------------------------------------
	for i = 0, sampGetMaxPlayerId() do
		if sampIsPlayerConnected(i) then
			nickname = sampGetPlayerNickname(i)
			for id = 1, #friends do
				if nickname == friends[id] and local_name ~= friends[id] then
					----------------------------------------
					table.insert(chatMessages, '{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..i..'] находится на сервере.')
					----------------------------------------
					if elements.chat.tosampfuncsconnect.v then
						sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..i..'] находится на сервере.')
					end
					----------------------------------------
					if elements.chat.sendconnect.v then
						sampAddChatMessage('Игрок '..nickname..'['..i..'] находится на сервере.', 0xFF3300)
					end
					----------------------------------------
				end
			end
		end
	end
	----------------------------------------
	setTimeOfDay(elements.config.set_time.v, 0)
	forceWeatherNow(elements.config.set_weather.v)
	----------------------------------------
	sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] {299800}Загружен{FFFFFF}. Настройки: /chat.', 0xFFFFFF)
	----------------------------------------
	-- lua_thread.create(function()
		-- while true do
			-- wait(0)
			--------------[Авто-открытие сундуков]--------------------
			-- if elements.chest.roll_state.v == true and
				-- elements.state.autoloot == false and
				-- elements.autoopenroul.open_roul_bronze.v == false and
				-- elements.autoopenroul.open_roul_silver.v == false and
				-- elements.autoopenroul.open_roul_gold.v == false and
				-- elements.autoopenroul.open_roul_platina.v == false and
				-- elements.autoopenroul.open_roul_active == true and
				-- elements.autotoch.autotoch_enable.v == false and
				-- (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190") then
				-- if elements.chest.roll_standart.v == true then
					-- chest_timer = os.time()+(elements.chest.roll_wait.v*60)
					-- wait(elements.chest.roll_wait.v*60000)
					-- active = true
					-- sampSendChat("/invent")
					-- wait(2500)
				-- end
				-- if elements.chest.roll_platinum.v == true then
					-- sampSendClickTextdraw(65535)
					-- wait(355)
					-- active2 = true
					-- sampSendChat("/invent")
					-- wait(2500)
				-- end
				-- if elements.chest.roll_maska.v == true then
					-- sampSendClickTextdraw(65535)
					-- wait(355)
					-- active3 = true
					-- sampSendChat("/invent")
					-- wait(2500)
				-- end
			-- end
			--------------------------------------
		-- end
	-- end)
	----------------------------------------
	while true do
		wait(0)
		ip, port = sampGetCurrentServerAddress()
		local sx, sy = getScreenResolution()
		--------------------[Очистка памяти]--------------------
		if memory.read(0x8E4CB4, 4, true) > 1048576*550 then -- 800 МБайт (500 МБайт - 524288000)
			cleanStreamMemoryBuffer()
			sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Произвелась очистка памяти!', 0xFFFFFF)
		end
		--------------------[InputHelp]--------------------
		showInputHelp()
		--------------------[Реконнект]--------------------
		if reconnect_timer >= os.time() then
			printString(string.format('~r~RECONNECT: %d cek',reconnect_timer-os.time()),100)
			if reconnect_timer == os.time() then
				sampConnectToServer(ip, port)				
				reconnect_timer = 0
			end
		end
		----------------------------------------
		if elements.state.alt == true and not sampIsChatInputActive() then
			setVirtualKeyDown(18, true)
			wait(20)
			setVirtualKeyDown(18, false)
		end
		--------------------[Автопиар]--------------------
		if elements.autopiar.vr_active.v and vr_timer == os.time() and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190") then
			sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
			vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
		end
		----------------------------------------
		if elements.autopiar.fam_active.v and fam_timer == os.time() and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190") then
			sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
			fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
		end
		----------------------------------------
		if elements.autopiar.al_active.v and al_timer == os.time() and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190") then
			sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
			al_timer = os.time()+(elements.autopiar.al_delay.v*60)
		end
		--------------------[Дата и время под радаром]--------------------
		if elements.config.renderTime.v == true and (ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190") then
			local tWeekdays = 
			{
				[0] = 'Воскресенье',
				[1] = 'Понедельник',
				[2] = 'Вторник',
				[3] = 'Среда',
				[4] = 'Четверг',
				[5] = 'Пятница',
				[6] = 'Суббота'
			}
			----------------------------------------
			kd_vr = 0
			if vr_timer-os.time() > 0 then
				kd_vr = vr_timer-os.time()
			end
			----------------------------------------
			kd_fam = 0
			if fam_timer-os.time() > 0 then
				kd_fam = fam_timer-os.time()
			end
			----------------------------------------
			kd_al = 0
			if al_timer-os.time() > 0 then
				kd_al = al_timer-os.time()
			end
			----------------------------------------
			kd_chest = 0
			if chest_timer_1-os.time() > 0 then
				kd_chest = chest_timer_1-os.time()
			end
			----------------------------------------
			renderFontDrawText(molot_8_5, string.format("[%02d.%02d.%02d || %02d.%02d.%02d] (%s)\n[/vr: %d] [/fam: %d] [/al: %d] [chest: %d]",
			os.date("%d"),os.date("%m"),os.date("%Y"),
			os.date("%H"),os.date("%M"),os.date("%S"),
			tWeekdays[tonumber(os.date("%w"))],
			kd_vr,
			kd_fam,
			kd_al,
			kd_chest), sx / 50, sy - 30, 0xAAFFFFFF)
		end
		--------------------[Health and Armour]--------------------
		if sampIsLocalPlayerSpawned() and elements.config.HealthArmour.v == true then
			useRenderCommands(true)
			setTextCentre(true)
			setTextScale(0.3, 1.3)
			setTextColour(255, 255, 255, 255)
			setTextEdge(1, 0, 0, 0, 255)
			displayTextWithNumber(578.0, 64.0, 'NUMBER', getCharHealth(PLAYER_PED))
			----------------------------------------
			if getCharArmour(PLAYER_PED) > 0 then
				useRenderCommands(true)
				setTextCentre(true)
				setTextScale(0.3, 1.3)
				setTextColour(255, 255, 255, 255)
				setTextEdge(1, 0, 0, 0, 255)
				displayTextWithNumber(578.0, 41.5, 'NUMBER', getCharArmour(PLAYER_PED))
			end
		end
		--------------------[Radio Off]--------------------
		if isCharInAnyCar(playerPed) and getRadioChannel(playerPed) < 12 then
			setRadioChannel(12)
		end
		--------------------[Авто-открытие сундуков]--------------------
		if elements.chest.roll_state.v == true and
			elements.state.autoloot == false and
			elements.autoopenroul.open_roul_bronze.v == false and
			elements.autoopenroul.open_roul_silver.v == false and
			elements.autoopenroul.open_roul_gold.v == false and
			elements.autoopenroul.open_roul_platina.v == false and
			elements.autoopenroul.open_roul_active == true and
			elements.autotoch.autotoch_enable.v == false and
			(ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190") then
			if elements.chest.roll_standart.v == true and chest_timer_1 <= os.time() and chest_timer_1 ~= 0 then
				chest_timer_1 = 0
				chest_timer_2 = os.time()+2
				active = true
				sampSendChat("/invent")
			end
			if elements.chest.roll_platinum.v == true and chest_timer_2 <= os.time() and chest_timer_2 ~= 0 then
				chest_timer_2 = 0
				chest_timer_3 = os.time()+2
				sampSendClickTextdraw(65535)
				active2 = true
				sampSendChat("/invent")
			end
			if elements.chest.roll_maska.v == true and chest_timer_3 <= os.time() and chest_timer_3 ~= 0 then
				chest_timer_3 = 0
				chest_timer_1 = os.time()+(elements.chest.roll_wait.v*60)
				sampSendClickTextdraw(65535)
				active3 = true
				sampSendChat("/invent")
			end
		end
		--------------------[Новый автолут]--------------------
		if elements.state.autoloot == true then
			--for i = 0, 2304 do
			renderFontDrawText(arial_12_5,'autoloot {33AA33}enable', sx / 20, sy - 260, 0xFF3300FF)
			for i = 2000, 2160 do
				if sampTextdrawIsExists(i) then
					model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(i)
					if model ~= 1649 then
						x, y = sampTextdrawGetPos(i)
						--------------------[Первая строка]--------------------
						if x == 184.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 1
						elseif x == 211 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 2
						elseif x == 237.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 3
						elseif x == 264 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 4
						elseif x == 290.5 and math.floor(y) == 164 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 5
						--------------------[Вторая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 6
						elseif x == 211 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 7
						elseif x == 237.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 8
						elseif x == 264 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 9
						elseif x == 290.5 and math.floor(y) == 195 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 10
						--------------------[Третья строка]--------------------
						elseif x == 184.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 11
						elseif x == 211 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 12
						elseif x == 237.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 13
						elseif x == 264 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 14
						elseif x == 290.5 and math.floor(y) == 225 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 15
						--------------------[Четвертая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 16
						elseif x == 211 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 17
						elseif x == 237.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 18
						elseif x == 264 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 19
						elseif x == 290.5 and math.floor(y) == 256 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 20
						--------------------[Пятая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 21
						elseif x == 211 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 22
						elseif x == 237.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 23
						elseif x == 264 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 24
						elseif x == 290.5 and math.floor(y) == 286 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 25
						--------------------[Шестая строка]--------------------
						elseif x == 184.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 26
						elseif x == 211 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 27
						elseif x == 237.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 28
						elseif x == 264 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 29
						elseif x == 290.5 and math.floor(y) == 317 and elements.state.autoloot_number == 0 then
							sampSendClickTextdraw(i)
							elements.state.autoloot_number = 30
						end
					end
				end
			end
		end
		--------------------[Игроки в зоне стрима]--------------------
		if elements.state.nicks == true then
			players_count = 0
			for i = 0, sampGetMaxPlayerId(true) do -- true - максимальный ID в зоне стрима
				local result, ped = sampGetCharHandleBySampPlayerId(i)
				if result and doesCharExist(ped) then
					players_count = players_count + 1
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
					local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
					----------------------------------------
					playername = sampGetPlayerNickname(i)
					color = sampGetPlayerColor(i)
					----------------------------------------
					afk = ""
					if sampIsPlayerPaused(i) then
						afk = "{FF3300}(AFK)"
					end
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
					renderFontDrawText(arial_12_5, playername..'['..i..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
				end
			end
			if players_count < 2 then
				renderFontDrawText(arial_12_5,'Игроков в зоне стрима: '..players_count, sx / 5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial_12_5,'Игроков в зоне стрима: '..players_count, sx / 5, sy - 30, 0xFFFF0000)
			end
		end
		--------------------[Пидоры в зоне стрима]--------------------
		if elements.state.pidors == true then
			for i = 0, sampGetMaxPlayerId(true) do -- true - максимальный ID в зоне стрима
				local result, ped = sampGetCharHandleBySampPlayerId(i)
				if result and doesCharExist(ped) then
					playername = sampGetPlayerNickname(i)
					for id = 1, #pidori do
						if playername == pidori[id] then
							local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
							local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
							local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
							local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
							distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
							
							color = sampGetPlayerColor(i)
							----------------------------------------
							afk = ""
							if sampIsPlayerPaused(i) then
								afk = "{FF3300}(AFK)"
							end
							----------------------------------------
							renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
							renderFontDrawText(arial_12_5, playername..'['..i..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
						end
					end
				end
			end
		end
		--------------------[Поиск игрока]--------------------
		if elements.state.finds ~= 65535 then
			if sampIsPlayerConnected(elements.state.finds) then
				local result, ped = sampGetCharHandleBySampPlayerId(elements.state.finds) 
				if result and doesCharExist(ped) then
					local mypos_x, mypos_y, mypos_z = getCharCoordinates(PLAYER_PED)
					local PlayerX2, PlayerY2 = convert3DCoordsToScreen(mypos_x, mypos_y, mypos_z)
					local PlayerX, PlayerY, PlayerZ = getCharCoordinates(ped)
					local x1, y1 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
					distance = string.format("%.0f",getDistanceBetweenCoords3d(PlayerX, PlayerY, PlayerZ, mypos_x, mypos_y, mypos_z))
					playername = sampGetPlayerNickname(elements.state.finds)
					color = sampGetPlayerColor(elements.state.finds)
					----------------------------------------
					afk = ""
					if sampIsPlayerPaused(elements.state.finds) then
						afk = "{FF3300}(AFK)"
					end
					----------------------------------------
					renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, getColor(color))
					renderFontDrawText(arial_12_5, playername..'['..elements.state.finds..'] ['..distance..' м.] '..afk, x1, y1, getColor(color))
				end
			else
				elements.state.finds = 65535
				push_message('Выключаю поиск игрока (disconnect).')
			end
		end
		--------------------[Поиск руды на шахте]--------------------
		if elements.state.waxta == true then
			local waxta_count = 0
			for _, i in pairs(getAllObjects()) do
				if getObjectModel(i) == 854 then
					waxta_count = waxta_count + 1
					if isObjectOnScreen(i) then
						local result, oX, oY, oZ = getObjectCoordinates(i)
						----------------------------------------
						local x1, y1 = convert3DCoordsToScreen(oX,oY,oZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(oX, oY, oZ, PlayerX, PlayerY, PlayerZ))
						----------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x1, y1, 2, 0xFF3300FF) 
						renderFontDrawText(arial_12_5,"{FF0000}Руда: {3300FF}"..distance, x1, y1, -1)
					end
				end
			end
			if waxta_count == 0 then
				renderFontDrawText(arial_12_5,'Руды в зоне стрима: '..waxta_count, sx / 2.5, sy - 30, 0xFF3300FF)
			else
				renderFontDrawText(arial_12_5,'Руды в зоне стрима: '..waxta_count, sx / 2.5, sy - 30, 0xFFFF0000)
			end
		end
		--------------------[Поиск открытых багажников]--------------------
		if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190" then
			if carid ~= -1 then
				result, carhandle = sampGetCarHandleBySampVehicleId(carid)
				if carhandle ~= -1 then
					if carid >= 839 then
						x, y, z = getCarCoordinates(carhandle)
						name_vehicle = getNameOfVehicleModel(getCarModel(carhandle))
						----------------------------------------
						printString('~p~OPEN BAGAJHUK~n~'..name_vehicle..'['..carid..']',1000)
						----------------------------------------
						local x2, y2 = convert3DCoordsToScreen(x, y, z)
						local PlayerX3, PlayerY3, PlayerZ3 = getCharCoordinates(PLAYER_PED)
						local PlayerX4, PlayerY4 = convert3DCoordsToScreen(PlayerX3, PlayerY3, PlayerZ3)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(x, y, z, PlayerX3, PlayerY3, PlayerZ3))
						----------------------------------------
						renderDrawLine(PlayerX4, PlayerY4, x2, y2, 2, 0x8B00FFFF) 
						renderFontDrawText(arial_12_5,"{8B00FF}"..name_vehicle.."["..carid.."]\nБагажник: {3300FF}"..distance, x2, y2, -1)
					end
				else
					carid = -1
				end
			end
		end
		--------------------[ID's текстдравов]--------------------
		if elements.state.showid == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					x, y = sampTextdrawGetPos(i)
					x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					renderFontDrawText(molot_8_5, i, x1, y1, 0xFFBEBEBE)
				end
			end
		end
		--------------------[X / Y текстдравов]--------------------
		if elements.state.showpos == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					x, y = sampTextdrawGetPos(i)
					x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					renderFontDrawText(molot_8_5, 'x: '..math.floor(x)..'\ny: '..math.floor(y), x1, y1, 0xFFBEBEBE)
				end
			end
		end
		--------------------[MODEL's текстдравов]--------------------
		if elements.state.showmodel == true then
			for i = 0, 2304 do
				if sampTextdrawIsExists(i) then
					x, y = sampTextdrawGetPos(i)
					x1, y1 = convertGameScreenCoordsToWindowScreenCoords(x, y)
					model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(i)
					if model ~= 0 and model ~= 1649 then
						renderFontDrawText(molot_8_5, model, x1, y1, 0xFFBEBEBE)
					end
				end
			end
		end
		--------------------[Продовоз]--------------------
		if prodovoz_timer >= os.time() then
			printString(string.format('~g~OTKAT: %d cek',prodovoz_timer-os.time()),2000)
			if prodovoz_timer == os.time() then
				sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Ты снова можешь закупить продукты.', 0xFFFFFF)
				prodovoz_timer = 0
			end
		end
		----------------------------------------
		if isCharInAnyCar(PLAYER_PED) and getCarModel( storeCarCharIsInNoSave(PLAYER_PED) ) == 456 then
			for i = 0, 2048 do
				if sampIs3dTextDefined(i) then
					local text, color, posX, posY, posZ, distance, ignoreWalls, player, vehicle = sampGet3dTextInfoById(i)
					if text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин 24/7') and text:find('продуктов с разгрузочной станции.') or
						text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин аксессуаров') and text:find('продуктов с разгрузочной станции.') or
						text:find('{73B461}Тип бизнеса: {FFFFFF}Магазин одежды') and text:find('продуктов с разгрузочной станции.') then
						----------------------------------------
						buy_prods = string.match(text,'Скупает {CBB42F}(%d+)')
						price_prods = string.match(text,'предмета: {CBB42F}(%d+)')
						----------------------------------------
						local x10, y10 = convert3DCoordsToScreen(posX, posY, posZ)
						local PlayerX, PlayerY, PlayerZ = getCharCoordinates(PLAYER_PED)
						local PlayerX2, PlayerY2 = convert3DCoordsToScreen(PlayerX, PlayerY, PlayerZ)
						distance = string.format("%.0f",getDistanceBetweenCoords3d(posX, posY, posZ, PlayerX, PlayerY, PlayerZ))
						----------------------------------------
						renderDrawLine(PlayerX2, PlayerY2, x10, y10, 2, 0xFF3300FF)
						renderFontDrawText(arial_12_5,'{CBB42F}Бизнес скупает {33AA33}'..buy_prods..'{CBB42F} продуктов\nСтоимость 1 продукта {33AA33}'..price_prods..'${CBB42F}\nДистанция: {3300FF}'..distance..'м.', x10, y10, -1)	
					end
				end
			end
		end
		if elements.state.BTC == true then
			for i = 0, 2048 do
				if sampIs3dTextDefined(i) then
					local text, color, posX, posY, posZ, distance, ignoreWalls, player, vehicle = sampGet3dTextInfoById(i)
					if text:find('Сейчас в банке:') then
						----------------------------------------
						local bank_BTC = string.match(text,'Сейчас в банке: (%d+) BTC')
						local bank_sell = string.match(text,'Банк продаёт 1 BTC за $(%d+)')
						----------------------------------------
						if tonumber(bank_BTC) > 0 and tonumber(bank_sell) < 44000 then
							----------------------------------------
							local count = getPlayerMoney(Player)/tonumber(bank_sell)
							----------------------------------------
							if count > tonumber(bank_BTC) then
								count = tonumber(bank_BTC)
							end
							----------------------------------------
							if not sampIsChatInputActive() and not sampIsDialogActive() then
								setVirtualKeyDown(VK_N, false)
								wait(500)
								setVirtualKeyDown(VK_N, true)
								-- setGameKeyState(CONVERSATIONNO, 255)
								-- wait(0)
								-- setGameKeyState(CONVERSATIONNO, 0)
							end
							----------------------------------------
							local dialogId = sampGetCurrentDialogId()
							if dialogId == 15276 then
								sampSendDialogResponse(dialogId, 1, 1, nil)
								sampCloseCurrentDialogWithButton(0)
							elseif dialogId == 15279 then
								sampSendDialogResponse(dialogId, 1, 0, count)
								sampCloseCurrentDialogWithButton(0)
							else
								sampSendDialogResponse(dialogId, 1, 0, nil)
								sampCloseCurrentDialogWithButton(0)
							end
							----------------------------------------
						else
							setVirtualKeyDown(VK_N, false)
							sampCloseCurrentDialogWithButton(0)
						end
					end
				end
			end
		end
		--------------------[Калькулятор]--------------------
		text = sampGetChatInputText()
		----------------------------------------
		if text:find('%d+') and text:find('[-+/*^%%]') and not text:find('%a+') and text ~= nil then
			ok, number = pcall(load('return '..text))
			result_calc = 'Результат: '..number
			if not isKeyDown(0x08) then
				setClipboardText(number)
			end
		end
		----------------------------------------
		if text:find('%d+%%%*%d+') then
			number1, number2 = text:match('(%d+)%%%*(%d+)')
			number = number1*number2/100
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number
			if not isKeyDown(0x08) and ok then
				setClipboardText(number)
			end
		end
		----------------------------------------
		if text:find('%d+%%%/%d+') then
			number1, number2 = text:match('(%d+)%%%/(%d+)')
			number = number2/number1*100
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number
			if not isKeyDown(0x08) and ok then
				setClipboardText(number)
			end
		end
		----------------------------------------
		if text:find('%d+/%d+%%') then
			number1, number2 = text:match('(%d+)/(%d+)%%')
			number = number1*100/number2
			ok, number = pcall(load('return '..number))
			result_calc = 'Результат: '..number..'%'
			if not isKeyDown(0x08) and ok then
				setClipboardText(number..'%')
			end
		end
		----------------------------------------
		if text == '' then
			ok = false
		end
		imgui.Process = ok
		--------------------[Дальний чат]--------------------
		if elements.chat.distant_active.v == true then
			local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
			local windowPosX = getStructElement(input, 0x8, 4)
			local windowPosY = getStructElement(input, 0xC, 4)
			renderFontDrawText(molot_8_5, "Дальний чат:", windowPosX, windowPosY+80, -1)
			----------------------------------------
			for _, message in ipairs(chatbuble) do
				renderFontDrawText(molot_8_5, message, windowPosX, windowPosY+92, -1)
				windowPosY = windowPosY+13
			end
		end
		--------------------[Стиллер объектов на транспорт]--------------------
		local pState = sampGetGamestate()
		if pState == 5 and lastPlayerState ~= 5 and lastPlayerState ~= -1 then
			for i = 1, #objectsTable do
				if objectsTable[i] ~= nil then
					objectsTable[i] = nil
				end
			end
			lastPlayerState = pState
		end
		--------------------[Авто-открытие рулеток]--------------------
		if elements.autoopenroul.open_roul_bronze.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		if elements.autoopenroul.open_roul_silver.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2083)
			wait(500)
			sampSendClickTextdraw(2085)
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		if elements.autoopenroul.open_roul_gold.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2088)
			wait(500)
			sampSendClickTextdraw(2090)
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		if elements.autoopenroul.open_roul_platina.v == true and elements.autoopenroul.open_roul_active == true then
			auto_roul()
			wait(500)
			sampSendClickTextdraw(2108)
			wait(500)
			sampSendClickTextdraw(2110)
			wait(500)
			sampSendClickTextdraw(2089)
			wait(500)
			sampSendClickTextdraw(2091)
			elements.autoopenroul.open_roul_active = false
		end
		--------------------[Авто-сбор шара]--------------------
		local text = sampTextdrawGetString(2069)
		if text:match("%[ ~p~%u+~w~ %]") then
			setGameKeyState(16, 255)
			setGameKeyState(21, 255)
			setGameKeyState(9, 255)
			wait(0)
			setGameKeyState(16, 0)
			setGameKeyState(21, 0)
			setGameKeyState(9, 0)
		end
		--------------------[Главный ImGui]--------------------
		imgui.Process = true
		imgui.ShowCursor = windowstate.v
		----------------------------------------
	end
end

function saveini()
	inicfg.save(
	{
		config =
		{
			renderTime = elements.config.renderTime.v,
			killStat = elements.config.killStat.v,
			HealthArmour = elements.config.HealthArmour.v,
			del_opisanie_3d = elements.config.del_opisanie_3d.v,
			autousedrugs = elements.config.autousedrugs.v,
			prodovoz_edit = elements.config.prodovoz_edit.v,
			set_weather = elements.config.set_weather.v,
			set_time = elements.config.set_time.v
		},
		account =
		{
			my_nick = elements.account.my_nick.v,
			my_password = elements.account.my_password.v,
			my_pincode = elements.account.my_pincode.v,
			my_nick_2 = elements.account.my_nick_2.v,
			my_password_2 = elements.account.my_password_2.v,
			my_pincode_2 = elements.account.my_pincode_2.v,
			my_nick_3 = elements.account.my_nick_3.v,
			my_password_3 = elements.account.my_password_3.v,
			my_pincode_3 = elements.account.my_pincode_3.v
		},
		chat =
		{
			chatlog = elements.chat.chatlog.v,
			renderchatbuy = elements.chat.renderchatbuy.v,
			removechatbuy = elements.chat.removechatbuy.v,
			tosampfuncsbuy = elements.chat.tosampfuncsbuy.v,
			removechatdepatment = elements.chat.removechatdepatment.v,
			removechatnews = elements.chat.removechatnews.v,
			removechatalians = elements.chat.removechatalians.v,
			removechatwait = elements.chat.removechatwait.v,
			removechatfond = elements.chat.removechatfond.v,
			removechatspam = elements.chat.removechatspam.v,
			tosampfuncsspam = elements.chat.tosampfuncsspam.v,
			removechatmicro = elements.chat.removechatmicro.v,
			sendconnect = elements.chat.sendconnect.v,
			senddisconnect = elements.chat.senddisconnect.v,
			tosampfuncsconnect = elements.chat.tosampfuncsconnect.v,
			tosampfuncsdisconnect = elements.chat.tosampfuncsdisconnect.v,
			rendervipchat = elements.chat.rendervipchat.v,
			tosampfuncsvipchat = elements.chat.tosampfuncsvipchat.v,
			removevipchat = elements.chat.removevipchat.v,
			renderjobchat = elements.chat.renderjobchat.v,
			tosampfuncsjobchat = elements.chat.tosampfuncsjobchat.v,
			removejobchat = elements.chat.removejobchat.v,
			renderadv = elements.chat.renderadv.v,
			tosampfuncsadv = elements.chat.tosampfuncsadv.v,
			removeadv = elements.chat.removeadv.v,
			distant_active = elements.chat.distant_active.v,
			distant_count = elements.chat.distant_count.v
		},
		chest =
		{
			roll_standart = elements.chest.roll_standart.v,
			roll_platinum = elements.chest.roll_platinum.v,
			roll_maska = elements.chest.roll_maska.v,
			roll_state = elements.chest.roll_state.v,
			roll_wait = elements.chest.roll_wait.v,
		},
		destroy =
		{
			bucket = elements.destroy.bucket.v,
			tree = elements.destroy.tree.v,
			serdce = elements.destroy.serdce.v,
			xlam = elements.destroy.xlam.v,
		},
		lavka =
		{
			drugs = elements.lavka.drugs.v,
			drugs_price = elements.lavka.drugs_price.v,
			----------------------------------------
			materials = elements.lavka.materials.v,
			materials_price = elements.lavka.materials_price.v,
			----------------------------------------
			fam_talon = elements.lavka.fam_talon.v,
			fam_talon_price = elements.lavka.fam_talon_price.v,
			----------------------------------------
			cherepa = elements.lavka.cherepa.v,
			cherepa_price = elements.lavka.cherepa_price.v,
			----------------------------------------
			sale_talon = elements.lavka.sale_talon.v,
			sale_talon_price = elements.lavka.sale_talon_price.v,
			----------------------------------------
			gift = elements.lavka.gift.v,
			gift_price = elements.lavka.gift_price.v,
			----------------------------------------
			cooper_roll = elements.lavka.cooper_roll.v,
			cooper_roll_price = elements.lavka.cooper_roll_price.v,
			----------------------------------------
			silver_roll = elements.lavka.silver_roll.v,
			silver_roll_price = elements.lavka.silver_roll_price.v,
			----------------------------------------
			gold_roll = elements.lavka.gold_roll.v,
			gold_roll_price = elements.lavka.gold_roll_price.v,
			----------------------------------------
			xlopok = elements.lavka.xlopok.v,
			xlopok_price = elements.lavka.xlopok_price.v,
			----------------------------------------
			lens = elements.lavka.lens.v,
			lens_price = elements.lavka.lens_price.v,
			----------------------------------------
			stone = elements.lavka.stone.v,
			stone_price = elements.lavka.stone_price.v,
			----------------------------------------
			metal = elements.lavka.metal.v,
			metal_price = elements.lavka.metal_price.v,
			----------------------------------------
			bronze = elements.lavka.bronze.v,
			bronze_price = elements.lavka.bronze_price.v,
			----------------------------------------
			silver = elements.lavka.silver.v,
			silver_price = elements.lavka.silver_price.v,
			----------------------------------------
			gold = elements.lavka.gold.v,
			gold_price = elements.lavka.gold_price.v,
			----------------------------------------
			alyminiu = elements.lavka.alyminiu.v,
			alyminiu_price = elements.lavka.alyminiu_price.v,
			----------------------------------------
			tywka = elements.lavka.tywka.v,
			tywka_price = elements.lavka.tywka_price.v,
			----------------------------------------
			wkyra = elements.lavka.wkyra.v,
			wkyra_price = elements.lavka.wkyra_price.v,
			----------------------------------------
			euro = elements.lavka.euro.v,
			euro_price = elements.lavka.euro_price.v,
			----------------------------------------
			gr_talon = elements.lavka.gr_talon.v,
			gr_talon_price = elements.lavka.gr_talon_price.v,
			----------------------------------------
			antibiotiki = elements.lavka.antibiotiki.v,
			antibiotiki_price = elements.lavka.antibiotiki_price.v,
			----------------------------------------
			prison = elements.lavka.prison.v,
			prison_price = elements.lavka.prison_price.v,
			----------------------------------------
			mod_wings_price = elements.lavka.mod_wings_price.v,
			----------------------------------------
			mod_reg_eyes_price = elements.lavka.mod_reg_eyes_price.v,
			----------------------------------------
			zlov_moneta = elements.lavka.zlov_moneta.v,
			zlov_moneta_price = elements.lavka.zlov_moneta_price.v,
			----------------------------------------
			toch_stone = elements.lavka.toch_stone.v,
			toch_stone_price = elements.lavka.toch_stone_price.v,
			----------------------------------------
			bilet_6 = elements.lavka.bilet_6.v,
			bilet_6_price = elements.lavka.bilet_6_price.v,
			----------------------------------------
			sticker_cluck = elements.lavka.sticker_cluck.v,
			sticker_cluck_price = elements.lavka.sticker_cluck_price.v,
			----------------------------------------
			sticker_binko = elements.lavka.sticker_binko.v,
			sticker_binko_price = elements.lavka.sticker_binko_price.v,
			----------------------------------------
			sticker_jizzy = elements.lavka.sticker_jizzy.v,
			sticker_jizzy_price = elements.lavka.sticker_jizzy_price.v,
			----------------------------------------
			platinum_roll = elements.lavka.platinum_roll.v,
			platinum_roll_price = elements.lavka.platinum_roll_price.v,
			----------------------------------------
			rare_yellow = elements.lavka.rare_yellow.v,
			rare_yellow_price = elements.lavka.rare_yellow_price.v,
			----------------------------------------
			rare_red = elements.lavka.rare_red.v,
			rare_red_price = elements.lavka.rare_red_price.v,
			----------------------------------------
			rare_blue = elements.lavka.rare_blue.v,
			rare_blue_price = elements.lavka.rare_blue_price.v,
			----------------------------------------
			fam_money = elements.lavka.fam_money.v,
			fam_money_price = elements.lavka.fam_money_price.v,
			----------------------------------------
			box_marvel = elements.lavka.box_marvel.v,
			box_marvel_price = elements.lavka.box_marvel_price.v,
			----------------------------------------
			box_djent = elements.lavka.box_djent.v,
			box_djent_price = elements.lavka.box_djent_price.v,
			----------------------------------------
			box_minecraft = elements.lavka.box_minecraft.v,
			box_minecraft_price = elements.lavka.box_minecraft_price.v,
			----------------------------------------
			box_moto = elements.lavka.box_moto.v,
			box_moto_price = elements.lavka.box_moto_price.v,
			----------------------------------------
			box_car = elements.lavka.box_car.v,
			box_car_price = elements.lavka.box_car_price.v,
			----------------------------------------
			box_nostalg = elements.lavka.box_nostalg.v,
			box_nostalg_price = elements.lavka.box_nostalg_price.v,
			----------------------------------------
			larec_oligarha = elements.lavka.larec_oligarha.v,
			larec_oligarha_price = elements.lavka.larec_oligarha_price.v,
			----------------------------------------
			rykzak_para_price = elements.lavka.rykzak_para_price.v,
			----------------------------------------
			rykzak_pirat_price = elements.lavka.rykzak_pirat_price.v,
			----------------------------------------
			mod_teddi_1_price = elements.lavka.mod_teddi_1_price.v,
			----------------------------------------
			mod_teddi_2_price = elements.lavka.mod_teddi_2_price.v,
			----------------------------------------
			mod_teddi_3_price = elements.lavka.mod_teddi_3_price.v,
			----------------------------------------
			band_respect = elements.lavka.band_respect.v,
			band_respect_price = elements.lavka.band_respect_price.v,
			----------------------------------------
			larec_premium = elements.lavka.larec_premium.v,
			larec_premium_price = elements.lavka.larec_premium_price.v,
			----------------------------------------
			larec_car_box = elements.lavka.larec_car_box.v,
			larec_car_box_price = elements.lavka.larec_car_box_price.v
		},
		autopiar =
		{
			----------------------------------------
			vr_text = elements.autopiar.vr_text.v,
			vr_delay = elements.autopiar.vr_delay.v,
			vr_active = elements.autopiar.vr_active.v,
			----------------------------------------
			fam_text = elements.autopiar.fam_text.v,
			fam_delay = elements.autopiar.fam_delay.v,
			fam_active = elements.autopiar.fam_active.v,
			----------------------------------------
			al_text = elements.autopiar.al_text.v,
			al_delay = elements.autopiar.al_delay.v,
			al_active = elements.autopiar.al_active.v
			----------------------------------------
		}
	},file)
end
function imgui.OnDrawFrame()
	----------------------------------------
	onRenderNotification()
	----------------------------------------
	local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
	local windowPosX = getStructElement(input, 0x8, 4)
	local windowPosY = getStructElement(input, 0xC, 4)
	--------------------[Калькулятор]--------------------
	if sampIsChatInputActive() and ok then
		imgui.SetNextWindowPos(imgui.ImVec2(windowPosX, windowPosY + 30 + 15), imgui.Cond.FirstUseEver)
		imgui.SetNextWindowSize(imgui.ImVec2(result_calc:len()*10, 30))
		imgui.Begin('Solve', window, imgui.WindowFlags.NoTitleBar + imgui.WindowFlags.NoResize + imgui.WindowFlags.NoMove)
		imgui.CenterText(u8(number_separator(result_calc)))
		imgui.End()
	end
	----------------------------------------
	local sw,sh = getScreenResolution()
	if windowstate.v == true then
		----------------------------------------
		imgui.SetNextWindowPos(imgui.ImVec2(sw/2,sh/3),imgui.Cond.FirstUseEver,imgui.ImVec2(0.5,0.5))
		imgui.SetNextWindowSize(imgui.ImVec2(860,700),imgui.Cond.FirstUseEver)
		imgui.Begin(u8(script_names..' | v'..thisScript().version),windowstate,imgui.WindowFlags.HorizontalScrollbar)
		imgui.BeginGroup()
		----------------------------------------
		if imgui.Button(u8('Сохранить настройки'),imgui.ImVec2(170,20)) then
			saveini()
			sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Настройки успешно сохранены.', 0xFFFFFF)
			push_message('Настройки сохранены!')
		end
		imgui.SameLine()
		----------------------------------------
		if imgui.Button(u8('Перезагрузить скрипт'),imgui.ImVec2(170,20)) then
			thisScript():reload()
		end
		----------------------------------------
		if imgui.Button(u8('Переподключиться (/rec)'),imgui.ImVec2(170,20)) then
			sampDisconnectWithReason(false)
			sampSetGamestate(1)
		end
		imgui.SameLine()
		----------------------------------------
		if imgui.Button(u8('Суицид'),imgui.ImVec2(170,20)) then
			setCharHealth(PLAYER_PED, 0)
			push_message('Покойся с миром!')
		end
		----------------------------------------
		imgui.Text(u8"Основные команды:")
		imgui.Text(u8"/rec - Перезайти на сервер")
		imgui.Text(u8"/rr [текст] - Написать в репорт")
		imgui.Text(u8"/nicks - Включить поиск игроков в зоне стрима")
		imgui.SameLine()
		imgui.TextQuestion(u8'Чтобы отключить введи /nicks ещё раз.')
		imgui.Text(u8"/finds [playerid] - Включить поиск игрока в зоне стрима")
		imgui.SameLine()
		imgui.TextQuestion(u8'Чтобы отключить введи /finds ещё раз.')
		imgui.Text(u8"/ll - Подсветить радиусы переносных лавок")
		imgui.Text(u8"/waxta - Включить поиск руды в зоне стрима")
		imgui.Text(u8"/loot - Автосбор с мусорки/багажника")
		imgui.SameLine()
		imgui.TextQuestion(u8'Заходишь в мусорку, вводишь /loot и скрипт будет автоматически\nлутать все что появится.')
		imgui.Text(u8"/ud - Использует 3 грамма наркотиков")
		imgui.Text(u8"/ar - Надевает броню")
		imgui.Text(u8"/price [название] - Посмотреть цену на товар")
		imgui.Text(u8"/pp - Поиск пидоров")
		imgui.Text(u8"/p - Посмотреть пидоров онлайн")
		----------------------------------------
		imgui.EndGroup()
		imgui.SameLine()
		imgui.BeginGroup()
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки') then
			imgui.Separator()
			imgui.Checkbox(u8('Включить чатлог'),elements.chat.chatlog)
			----------------------------------------
			imgui.Checkbox(u8('Включить время в левом нижнем углу'),elements.config.renderTime)
			----------------------------------------
			imgui.Checkbox(u8('Выключить киллстат'),elements.config.killStat)
			imgui.Checkbox(u8('Включить Health & Armour в цифрах'),elements.config.HealthArmour)
			imgui.Checkbox(u8('Убрать \'Описание\' игроков'),elements.config.del_opisanie_3d)
			imgui.Checkbox(u8('Автоматический /usedrugs 3 при ломке'),elements.config.autousedrugs)
			imgui.Checkbox(u8('Отключение анимации посадки в транспорт у игроков'),elements.config.anim_car)
			----------------------------------------
			imgui.Separator()
			imgui.PushItemWidth(100)
			imgui.InputInt(u8('Кол-во продукции для завозки в бизнесы'),elements.config.prodovoz_edit)
			if elements.config.prodovoz_edit.v > 2000 then
				elements.config.prodovoz_edit.v = 2000
			end
			if elements.config.prodovoz_edit.v < 1 then
				elements.config.prodovoz_edit.v = 1
			end
			imgui.Separator()
			----------------------------------------
			imgui.PushItemWidth(300)
			imgui.SliderInt(u8('Погода'),elements.config.set_weather,0,45)
			forceWeatherNow(elements.config.set_weather.v)
			imgui.Separator()
			----------------------------------------
			imgui.PushItemWidth(300)
			imgui.SliderInt(u8('Время'),elements.config.set_time,0,23)
			setTimeOfDay(elements.config.set_time.v, 0)
			imgui.Separator()
			----------------------------------------
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки автологина') then
			imgui.Separator()
			imgui.InputText(u8('Ник'),elements.account.my_nick)
			imgui.InputText(u8('Пароль'),elements.account.my_password)
			imgui.InputText(u8('Пинкод'),elements.account.my_pincode)
			imgui.Separator()
			imgui.InputText(u8('Ник##2'),elements.account.my_nick_2)
			imgui.InputText(u8('Пароль##2'),elements.account.my_password_2)
			imgui.InputText(u8('Пинкод##2'),elements.account.my_pincode_2)
			imgui.Separator()
			imgui.InputText(u8('Ник##3'),elements.account.my_nick_3)
			imgui.InputText(u8('Пароль##3'),elements.account.my_password_3)
			imgui.InputText(u8('Пинкод##3'),elements.account.my_pincode_3)
			imgui.Separator()
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки автопиара') then
			imgui.Separator()
			imgui.PushItemWidth(300)
			imgui.InputText(u8('[/vr] Текст'),elements.autopiar.vr_text)
			imgui.SliderInt(u8('[/vr] Задержка (мин.)'),elements.autopiar.vr_delay,1,60)
			imgui.Checkbox(u8('[/vr] Активировать'),elements.autopiar.vr_active)
			----------------------------------------
			if elements.autopiar.vr_active.v == true then
				if vr_timer < os.time() then
					vr_timer = os.time()+(elements.autopiar.vr_delay.v*60)
					sampSendChat(u8:decode('/vr '..elements.autopiar.vr_text.v))
				end
			end
			----------------------------------------
			imgui.Separator()
			imgui.InputText(u8('[/fam] Текст'),elements.autopiar.fam_text)
			imgui.SliderInt(u8('[/fam] Задержка (мин.)'),elements.autopiar.fam_delay,1,60)
			imgui.Checkbox(u8('[/fam] Активировать'),elements.autopiar.fam_active)
			----------------------------------------
			if elements.autopiar.fam_active.v == true then
				if fam_timer < os.time() then
					fam_timer = os.time()+(elements.autopiar.fam_delay.v*60)
					sampSendChat(u8:decode('/fam '..elements.autopiar.fam_text.v))
				end
			end
			----------------------------------------
			imgui.Separator()
			imgui.InputText(u8('[/al] Текст'),elements.autopiar.al_text)
			imgui.SliderInt(u8('[/al] Задержка (мин.)'),elements.autopiar.al_delay,1,60)
			imgui.Checkbox(u8('[/al] Активировать'),elements.autopiar.al_active)
			----------------------------------------
			if elements.autopiar.al_active.v == true then
				if al_timer < os.time() then
					al_timer = os.time()+(elements.autopiar.al_delay.v*60)
					sampSendChat(u8:decode('/al '..elements.autopiar.al_text.v))
				end
			end
			----------------------------------------
			imgui.Separator()
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Настройки чатов') then
			imgui.Separator()
			if imgui.CollapsingHeader(u8'Сообщения о покупке') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер сообщений о покупке'),elements.chat.renderchatbuy)
				imgui.Checkbox(u8('Отключить в чате сообщения о покупке'),elements.chat.removechatbuy)
				imgui.Checkbox(u8('Выводить сообщения о покупке в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsbuy)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'SPAM сообщения') then
				imgui.Separator()
				imgui.Checkbox(u8('Отключить в чате "микрофон"'),elements.chat.removechatmicro)
				imgui.Separator()
				imgui.Checkbox(u8('Отключить чат "департамента"'),elements.chat.removechatdepatment)
				imgui.Separator()
				imgui.Checkbox(u8('Отключить чат "NEWS"'),elements.chat.removechatnews)
				imgui.Separator()
				imgui.Checkbox(u8('Отключить чат "альянса"'),elements.chat.removechatalians)
				imgui.Separator()
				imgui.Checkbox(u8('Отключить в чате сообщение "Подождите немного..."'),elements.chat.removechatwait)
				imgui.Separator()
				imgui.Checkbox(u8('Отключить в чате сообщения о пожертвовании'),elements.chat.removechatfond)
				imgui.Separator()
				imgui.Checkbox(u8('Отключить в чате SPAM сообщения'),elements.chat.removechatspam)
				----------------------------------------
				imgui.SameLine()
				imgui.TextQuestion(u8'1. Удаляет рекламу от сервера.\n2. Удаляет репортажи СМИ (Гость, Репортёр).\n4. Удаляет сообщения в бандах об инкассаторах.\n5. Сообщения о собеседованиях.')
				----------------------------------------
				imgui.Checkbox(u8('Выводить SPAM сообщения в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsspam)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Сообщения о подключении/отключении игроков') then
				imgui.Separator()
				imgui.Checkbox(u8('Сообщения о входе игроков'),elements.chat.sendconnect)
				imgui.Checkbox(u8('Сообщения о выходе игроков'),elements.chat.senddisconnect)
				imgui.Checkbox(u8('Сообщения о входе игроков в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsconnect)
				imgui.Checkbox(u8('Сообщения о выходе игроков в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsdisconnect)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки VIP чата') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер вип чата'),elements.chat.rendervipchat)
				imgui.Checkbox(u8('Выводить вип чат в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsvipchat)
				imgui.Checkbox(u8('Отключить вип чат'),elements.chat.removevipchat)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки /j чата') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер /j чата'),elements.chat.renderjobchat)
				imgui.Checkbox(u8('Выводить /j чат в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsjobchat)
				imgui.Checkbox(u8('Отключить /j чат'),elements.chat.removejobchat)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки объявлений (/ad)') then
				imgui.Separator()
				imgui.Checkbox(u8('Рендер объявлений'),elements.chat.renderadv)
				imgui.Checkbox(u8('Выводить объявления в консоль SAMPFUNCS (~)'),elements.chat.tosampfuncsadv)
				imgui.Checkbox(u8('Отключить объявления'),elements.chat.removeadv)
				imgui.Separator()
			end
			----------------------------------------
			if imgui.CollapsingHeader(u8'Настройки дальнего чата') then
				imgui.Separator()
				imgui.Checkbox(u8('Включить дальний чат'),elements.chat.distant_active)
				imgui.PushItemWidth(370)
				imgui.SliderInt(u8('Кол-во строк'),elements.chat.distant_count,3,15)
				imgui.Separator()
			end
			imgui.Separator()
		end
		----------------------------------------
		if imgui.CollapsingHeader(u8'Удаление мусора с сервера') then
			imgui.Separator()
			imgui.Checkbox(u8('Отключить на сервере \'ковши\''),elements.destroy.bucket)
			imgui.Checkbox(u8('Отключить на сервере \'ёлки\''),elements.destroy.tree)
			imgui.Checkbox(u8('Отключить на сервере \'огромное сердце\''),elements.destroy.serdce)
			imgui.Checkbox(u8('Отключить на сервере \'хлам\''),elements.destroy.xlam)
			imgui.SameLine()
			imgui.TextQuestion(u8'Отключает:\n\
Большой Куст #1\n\
Большой Куст #2\n\
Небольшое дерево #1\n\
Небольшое дерево #2\n\
INVALID_OBJECT_ID\n\
INVALID_OBJECT_ID\n\
Флаг\n\
Граффити\n\
Красный флажок\n\
Красная гитара\n\
Чёрно-белая гитара\n\
Чёрная гитара\n\
Праздничный торт')
			imgui.Separator()
		end
		if imgui.CollapsingHeader(u8'Авто-точилка аксессуаров') then
			imgui.Separator()
			imgui.Checkbox(u8'Включить авто-точилку',elements.autotoch.autotoch_enable)
			imgui.PushItemWidth(200)
			imgui.SliderInt(u8('На сколько будет точится аксессуар'),elements.autotoch.checked_radio,1,12)
			imgui.SliderInt(u8('Выбери страницу инвентаря'),elements.autotoch.checked_inv,1,3)
			imgui.Separator()
		end
		if imgui.CollapsingHeader(u8'Авто-открытие рулеток') then
			imgui.Separator()
			imgui.Checkbox(u8'Бронзовая рулетка',elements.autoopenroul.open_roul_bronze)
			imgui.Checkbox(u8'Серебряная рулетка',elements.autoopenroul.open_roul_silver)
			imgui.Checkbox(u8'Золотая рулетка',elements.autoopenroul.open_roul_gold)
			imgui.Checkbox(u8'Платиновая рулетка',elements.autoopenroul.open_roul_platina)
			----------------------------------------
			if elements.autoopenroul.open_roul_bronze == false and elements.autoopenroul.open_roul_silver == false and elements.autoopenroul.open_roul_gold == false and elements.autoopenroul.open_roul_platina == false then
				elements.autoopenroul.open_roul_active = true
			end
			if elements.autoopenroul.open_roul_bronze == true then
				elements.autoopenroul.open_roul_bronze.v = true
				elements.autoopenroul.open_roul_silver.v = false
				elements.autoopenroul.open_roul_gold.v = false
				elements.autoopenroul.open_roul_platina.v = false
			end
			if elements.autoopenroul.open_roul_silver == true then
				elements.autoopenroul.open_roul_bronze.v = false
				elements.autoopenroul.open_roul_silver.v = true
				elements.autoopenroul.open_roul_gold.v = false
				elements.autoopenroul.open_roul_platina.v = false
			end
			if elements.autoopenroul.open_roul_gold == true then
				elements.autoopenroul.open_roul_bronze.v = false
				elements.autoopenroul.open_roul_silver.v = false
				elements.autoopenroul.open_roul_gold.v = true
				elements.autoopenroul.open_roul_platina.v = false
			end
			if elements.autoopenroul.open_roul_platina == true then
				elements.autoopenroul.open_roul_bronze.v = false
				elements.autoopenroul.open_roul_silver.v = false
				elements.autoopenroul.open_roul_gold.v = false
				elements.autoopenroul.open_roul_platina.v = true
			end
			----------------------------------------
			imgui.Separator()
		end
		if imgui.CollapsingHeader(u8'Авто-скуп в ларьке') then
			imgui.Separator()
			imgui.PushItemWidth(113)
			----------------------------------------
			imgui.InputInt(u8('Цена  ##1'),elements.lavka.drugs_price)
			imgui.SameLine()
			imgui.InputInt(u8('Наркотики (кол-во)'),elements.lavka.drugs)
			if elements.lavka.drugs.v < 0 then elements.lavka.drugs.v = 0 end
			if elements.lavka.drugs_price.v < 0 then elements.lavka.drugs_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##2'),elements.lavka.materials_price)
			imgui.SameLine()
			imgui.InputInt(u8('Материалы (кол-во)'),elements.lavka.materials)
			if elements.lavka.materials.v < 0 then elements.lavka.materials.v = 0 end
			if elements.lavka.materials_price.v < 0 then elements.lavka.materials_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##3'),elements.lavka.fam_talon_price)
			imgui.SameLine()
			imgui.InputInt(u8('Семейный талон (кол-во)'),elements.lavka.fam_talon)
			if elements.lavka.fam_talon.v < 0 then elements.lavka.fam_talon.v = 0 end
			if elements.lavka.fam_talon_price.v < 0 then elements.lavka.fam_talon_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##4'),elements.lavka.cherepa_price)
			imgui.SameLine()
			imgui.InputInt(u8('Черепа (кол-во)'),elements.lavka.cherepa)
			if elements.lavka.cherepa.v < 0 then elements.lavka.cherepa.v = 0 end
			if elements.lavka.cherepa_price.v < 0 then elements.lavka.cherepa_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##5'),elements.lavka.sale_talon_price)
			imgui.SameLine()
			imgui.InputInt(u8('Скидочный талон (кол-во)'),elements.lavka.sale_talon)
			if elements.lavka.sale_talon.v < 0 then elements.lavka.sale_talon.v = 0 end
			if elements.lavka.sale_talon_price.v < 0 then elements.lavka.sale_talon_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##6'),elements.lavka.gift_price)
			imgui.SameLine()
			imgui.InputInt(u8('Подарки (кол-во)'),elements.lavka.gift)
			if elements.lavka.gift.v < 0 then elements.lavka.gift.v = 0 end
			if elements.lavka.gift_price.v < 0 then elements.lavka.gift_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##7'),elements.lavka.cooper_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Бронзовые рулетки (кол-во)'),elements.lavka.cooper_roll)
			if elements.lavka.cooper_roll.v < 0 then elements.lavka.cooper_roll.v = 0 end
			if elements.lavka.cooper_roll_price.v < 0 then elements.lavka.cooper_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##8'),elements.lavka.silver_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Серебрянные рулетки (кол-во)'),elements.lavka.silver_roll)
			if elements.lavka.silver_roll.v < 0 then elements.lavka.silver_roll.v = 0 end
			if elements.lavka.silver_roll_price.v < 0 then elements.lavka.silver_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##9'),elements.lavka.gold_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Золотые рулетки (кол-во)'),elements.lavka.gold_roll)
			if elements.lavka.gold_roll.v < 0 then elements.lavka.gold_roll.v = 0 end
			if elements.lavka.gold_roll_price.v < 0 then elements.lavka.gold_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##10'),elements.lavka.xlopok_price)
			imgui.SameLine()
			imgui.InputInt(u8('Хлопок (кол-во)'),elements.lavka.xlopok)
			if elements.lavka.xlopok.v < 0 then elements.lavka.xlopok.v = 0 end
			if elements.lavka.xlopok_price.v < 0 then elements.lavka.xlopok_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##11'),elements.lavka.lens_price)
			imgui.SameLine()
			imgui.InputInt(u8('Лён (кол-во)'),elements.lavka.lens)
			if elements.lavka.lens.v < 0 then elements.lavka.lens.v = 0 end
			if elements.lavka.lens_price.v < 0 then elements.lavka.lens_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##12'),elements.lavka.stone_price)
			imgui.SameLine()
			imgui.InputInt(u8('Камень (кол-во)'),elements.lavka.stone)
			if elements.lavka.stone.v < 0 then elements.lavka.stone.v = 0 end
			if elements.lavka.stone_price.v < 0 then elements.lavka.stone_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##13'),elements.lavka.metal_price)
			imgui.SameLine()
			imgui.InputInt(u8('Металл (кол-во)'),elements.lavka.metal)
			if elements.lavka.metal.v < 0 then elements.lavka.metal.v = 0 end
			if elements.lavka.metal_price.v < 0 then elements.lavka.metal_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##14'),elements.lavka.bronze_price)
			imgui.SameLine()
			imgui.InputInt(u8('Бронза (кол-во)'),elements.lavka.bronze)
			if elements.lavka.bronze.v < 0 then elements.lavka.bronze.v = 0 end
			if elements.lavka.bronze_price.v < 0 then elements.lavka.bronze_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##15'),elements.lavka.silver_price)
			imgui.SameLine()
			imgui.InputInt(u8('Серебро (кол-во)'),elements.lavka.silver)
			if elements.lavka.silver.v < 0 then elements.lavka.silver.v = 0 end
			if elements.lavka.silver_price.v < 0 then elements.lavka.silver_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##16'),elements.lavka.gold_price)
			imgui.SameLine()
			imgui.InputInt(u8('Золото (кол-во)'),elements.lavka.gold)
			if elements.lavka.gold.v < 0 then elements.lavka.gold.v = 0 end
			if elements.lavka.gold_price.v < 0 then elements.lavka.gold_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##17'),elements.lavka.alyminiu_price)
			imgui.SameLine()
			imgui.InputInt(u8('Алюминий (кол-во)'),elements.lavka.alyminiu)
			if elements.lavka.alyminiu.v < 0 then elements.lavka.alyminiu.v = 0 end
			if elements.lavka.alyminiu_price.v < 0 then elements.lavka.alyminiu_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##18'),elements.lavka.tywka_price)
			imgui.SameLine()
			imgui.InputInt(u8('Тушка оленя (кол-во)'),elements.lavka.tywka)
			if elements.lavka.tywka.v < 0 then elements.lavka.tywka.v = 0 end
			if elements.lavka.tywka_price.v < 0 then elements.lavka.tywka_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##19'),elements.lavka.wkyra_price)
			imgui.SameLine()
			imgui.InputInt(u8('Шкура оленя (кол-во)'),elements.lavka.wkyra)
			if elements.lavka.wkyra.v < 0 then elements.lavka.wkyra.v = 0 end
			if elements.lavka.wkyra_price.v < 0 then elements.lavka.wkyra_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##20'),elements.lavka.euro_price)
			imgui.SameLine()
			imgui.InputInt(u8('Евро (кол-во)'),elements.lavka.euro)
			if elements.lavka.euro.v < 0 then elements.lavka.euro.v = 0 end
			if elements.lavka.euro_price.v < 0 then elements.lavka.euro_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##21'),elements.lavka.gr_talon_price)
			imgui.SameLine()
			imgui.InputInt(u8('Гражданский талон (кол-во)'),elements.lavka.gr_talon)
			if elements.lavka.gr_talon.v < 0 then elements.lavka.gr_talon.v = 0 end
			if elements.lavka.gr_talon_price.v < 0 then elements.lavka.gr_talon_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##22'),elements.lavka.antibiotiki_price)
			imgui.SameLine()
			imgui.InputInt(u8('Антибиотики (кол-во)'),elements.lavka.antibiotiki)
			if elements.lavka.antibiotiki.v < 0 then elements.lavka.antibiotiki.v = 0 end
			if elements.lavka.antibiotiki_price.v < 0 then elements.lavka.antibiotiki_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##23'),elements.lavka.prison_price)
			imgui.SameLine()
			imgui.InputInt(u8('Отмычки от ТСР (кол-во)'),elements.lavka.prison)
			if elements.lavka.prison.v < 0 then elements.lavka.prison.v = 0 end
			if elements.lavka.prison_price.v < 0 then elements.lavka.prison_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Модификация Wings'),elements.lavka.mod_wings_price)
			if elements.lavka.mod_wings_price.v < 0 then elements.lavka.mod_wings_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Модификация Reg Eyes'),elements.lavka.mod_reg_eyes_price)
			if elements.lavka.mod_reg_eyes_price.v < 0 then elements.lavka.mod_reg_eyes_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##24'),elements.lavka.zlov_moneta_price)
			imgui.SameLine()
			imgui.InputInt(u8('Зловещая монета (кол-во)'),elements.lavka.zlov_moneta)
			if elements.lavka.zlov_moneta.v < 0 then elements.lavka.zlov_moneta.v = 0 end
			if elements.lavka.zlov_moneta_price.v < 0 then elements.lavka.zlov_moneta_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##25'),elements.lavka.toch_stone_price)
			imgui.SameLine()
			imgui.InputInt(u8('Точильные камни (кол-во)'),elements.lavka.toch_stone)
			if elements.lavka.toch_stone.v < 0 then elements.lavka.toch_stone.v = 0 end
			if elements.lavka.toch_stone_price.v < 0 then elements.lavka.toch_stone_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##26'),elements.lavka.bilet_6_price)
			imgui.SameLine()
			imgui.InputInt(u8('Билет 6 годовщины (кол-во)'),elements.lavka.bilet_6)
			if elements.lavka.bilet_6.v < 0 then elements.lavka.bilet_6.v = 0 end
			if elements.lavka.bilet_6_price.v < 0 then elements.lavka.bilet_6_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##27'),elements.lavka.sticker_cluck_price)
			imgui.SameLine()
			imgui.InputInt(u8('Стикер Cluckin Bell (кол-во)'),elements.lavka.sticker_cluck)
			if elements.lavka.sticker_cluck.v < 0 then elements.lavka.sticker_cluck.v = 0 end
			if elements.lavka.sticker_cluck_price.v < 0 then elements.lavka.sticker_cluck_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##28'),elements.lavka.sticker_binko_price)
			imgui.SameLine()
			imgui.InputInt(u8('Стикер Binko (кол-во)'),elements.lavka.sticker_binko)
			if elements.lavka.sticker_binko.v < 0 then elements.lavka.sticker_binko.v = 0 end
			if elements.lavka.sticker_binko_price.v < 0 then elements.lavka.sticker_binko_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##29'),elements.lavka.sticker_jizzy_price)
			imgui.SameLine()
			imgui.InputInt(u8('Стикер Jizzy (кол-во)'),elements.lavka.sticker_jizzy)
			if elements.lavka.sticker_jizzy.v < 0 then elements.lavka.sticker_jizzy.v = 0 end
			if elements.lavka.sticker_jizzy_price.v < 0 then elements.lavka.sticker_jizzy_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##30'),elements.lavka.platinum_roll_price)
			imgui.SameLine()
			imgui.InputInt(u8('Платиновая рулетка (кол-во)'),elements.lavka.platinum_roll)
			if elements.lavka.platinum_roll.v < 0 then elements.lavka.platinum_roll.v = 0 end
			if elements.lavka.platinum_roll_price.v < 0 then elements.lavka.platinum_roll_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##31'),elements.lavka.rare_yellow_price)
			imgui.SameLine()
			imgui.InputInt(u8('Rare Box Yellow (кол-во)'),elements.lavka.rare_yellow)
			if elements.lavka.rare_yellow.v < 0 then elements.lavka.rare_yellow.v = 0 end
			if elements.lavka.rare_yellow_price.v < 0 then elements.lavka.rare_yellow_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##32'),elements.lavka.rare_red_price)
			imgui.SameLine()
			imgui.InputInt(u8('Rare Box Red (кол-во)'),elements.lavka.rare_red)
			if elements.lavka.rare_red.v < 0 then elements.lavka.rare_red.v = 0 end
			if elements.lavka.rare_red_price.v < 0 then elements.lavka.rare_red_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##33'),elements.lavka.rare_blue_price)
			imgui.SameLine()
			imgui.InputInt(u8('Rare Box Blue (кол-во)'),elements.lavka.rare_blue)
			if elements.lavka.rare_blue.v < 0 then elements.lavka.rare_blue.v = 0 end
			if elements.lavka.rare_blue_price.v < 0 then elements.lavka.rare_blue_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##34'),elements.lavka.fam_money_price)
			imgui.SameLine()
			imgui.InputInt(u8('Семейная монета (кол-во)'),elements.lavka.fam_money)
			if elements.lavka.fam_money.v < 0 then elements.lavka.fam_money.v = 0 end
			if elements.lavka.fam_money_price.v < 0 then elements.lavka.fam_money_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##35'),elements.lavka.box_marvel_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик \'Marvel\' (кол-во)'),elements.lavka.box_marvel)
			if elements.lavka.box_marvel.v < 0 then elements.lavka.box_marvel.v = 0 end
			if elements.lavka.box_marvel_price.v < 0 then elements.lavka.box_marvel_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##36'),elements.lavka.box_djent_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик \'Джентельменов\' (кол-во)'),elements.lavka.box_djent)
			if elements.lavka.box_djent.v < 0 then elements.lavka.box_djent.v = 0 end
			if elements.lavka.box_djent_price.v < 0 then elements.lavka.box_djent_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##37'),elements.lavka.box_minecraft_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик \'Minecraft\' (кол-во)'),elements.lavka.box_minecraft)
			if elements.lavka.box_minecraft.v < 0 then elements.lavka.box_minecraft.v = 0 end
			if elements.lavka.box_minecraft_price.v < 0 then elements.lavka.box_minecraft_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##38'),elements.lavka.box_moto_price)
			imgui.SameLine()
			imgui.InputInt(u8('Супер мото-ящик (кол-во)'),elements.lavka.box_moto)
			if elements.lavka.box_moto.v < 0 then elements.lavka.box_moto.v = 0 end
			if elements.lavka.box_moto_price.v < 0 then elements.lavka.box_moto_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##39'),elements.lavka.box_car_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ящик авто-ящик (кол-во)'),elements.lavka.box_car)
			if elements.lavka.box_car.v < 0 then elements.lavka.box_car.v = 0 end
			if elements.lavka.box_car_price.v < 0 then elements.lavka.box_car_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##40'),elements.lavka.box_nostalg_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ностальгический ящик (кол-во)'),elements.lavka.box_nostalg)
			if elements.lavka.box_nostalg.v < 0 then elements.lavka.box_nostalg.v = 0 end
			if elements.lavka.box_nostalg_price.v < 0 then elements.lavka.box_nostalg_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##41'),elements.lavka.larec_oligarha_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ларец Олигарха (кол-во)'),elements.lavka.larec_oligarha)
			if elements.lavka.larec_oligarha.v < 0 then elements.lavka.larec_oligarha.v = 0 end
			if elements.lavka.larec_oligarha_price.v < 0 then elements.lavka.larec_oligarha_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Рюкзак пара'),elements.lavka.rykzak_para_price)
			if elements.lavka.rykzak_para_price.v < 0 then elements.lavka.rykzak_para_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Рюкзак пират'),elements.lavka.rykzak_pirat_price)
			if elements.lavka.rykzak_pirat_price.v < 0 then elements.lavka.rykzak_pirat_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Тедди в бирюзовой кофте'),elements.lavka.mod_teddi_1_price)
			if elements.lavka.mod_teddi_1_price.v < 0 then elements.lavka.mod_teddi_1_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Тедди в красной кофте'),elements.lavka.mod_teddi_2_price)
			if elements.lavka.mod_teddi_2_price.v < 0 then elements.lavka.mod_teddi_2_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Тедди в зеленой кофте'),elements.lavka.mod_teddi_3_price)
			if elements.lavka.mod_teddi_3_price.v < 0 then elements.lavka.mod_teddi_3_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##42'),elements.lavka.band_respect_price)
			imgui.SameLine()
			imgui.InputInt(u8('Бандитские респекты (кол-во)'),elements.lavka.band_respect)
			if elements.lavka.band_respect.v < 0 then elements.lavka.band_respect.v = 0 end
			if elements.lavka.band_respect_price.v < 0 then elements.lavka.band_respect_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##43'),elements.lavka.larec_premium_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ларец с премией (кол-во)'),elements.lavka.larec_premium)
			if elements.lavka.larec_premium.v < 0 then elements.lavka.larec_premium.v = 0 end
			if elements.lavka.larec_premium_price.v < 0 then elements.lavka.larec_premium_price.v = 0 end
			----------------------------------------
			imgui.InputInt(u8('Цена  ##44'),elements.lavka.larec_car_box_price)
			imgui.SameLine()
			imgui.InputInt(u8('Ларец Super Car Box (кол-во)'),elements.lavka.larec_car_box)
			if elements.lavka.larec_car_box.v < 0 then elements.lavka.larec_car_box.v = 0 end
			if elements.lavka.larec_car_box_price.v < 0 then elements.lavka.larec_car_box_price.v = 0 end
			----------------------------------------
			count_all = 0
			if elements.lavka.drugs.v ~= 0 then
				count_all = count_all+(elements.lavka.drugs_price.v*elements.lavka.drugs.v)
			end
			if elements.lavka.materials.v ~= 0 then
				count_all = count_all+(elements.lavka.materials_price.v*elements.lavka.materials.v)
			end
			if elements.lavka.fam_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.fam_talon_price.v*elements.lavka.fam_talon.v)
			end
			if elements.lavka.cherepa.v ~= 0 then
				count_all = count_all+(elements.lavka.cherepa_price.v*elements.lavka.cherepa.v)
			end
			if elements.lavka.sale_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.sale_talon_price.v*elements.lavka.sale_talon.v)
			end
			if elements.lavka.gift.v ~= 0 then
				count_all = count_all+(elements.lavka.gift_price.v*elements.lavka.gift.v)
			end
			if elements.lavka.cooper_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.cooper_roll_price.v*elements.lavka.cooper_roll.v)
			end
			if elements.lavka.silver_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.silver_roll_price.v*elements.lavka.silver_roll.v)
			end
			if elements.lavka.gold_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.gold_roll_price.v*elements.lavka.gold_roll.v)
			end
			if elements.lavka.xlopok.v ~= 0 then
				count_all = count_all+(elements.lavka.xlopok_price.v*elements.lavka.xlopok.v)
			end
			if elements.lavka.lens.v ~= 0 then
				count_all = count_all+(elements.lavka.lens_price.v*elements.lavka.lens.v)
			end
			if elements.lavka.stone.v ~= 0 then
				count_all = count_all+(elements.lavka.stone_price.v*elements.lavka.stone.v)
			end
			if elements.lavka.metal.v ~= 0 then
				count_all = count_all+(elements.lavka.metal_price.v*elements.lavka.metal.v)
			end
			if elements.lavka.bronze.v ~= 0 then
				count_all = count_all+(elements.lavka.bronze_price.v*elements.lavka.bronze.v)
			end
			if elements.lavka.silver.v ~= 0 then
				count_all = count_all+(elements.lavka.silver_price.v*elements.lavka.silver.v)
			end
			if elements.lavka.gold.v ~= 0 then
				count_all = count_all+(elements.lavka.gold_price.v*elements.lavka.gold.v)
			end
			if elements.lavka.alyminiu.v ~= 0 then
				count_all = count_all+(elements.lavka.alyminiu_price.v*elements.lavka.alyminiu.v)
			end
			if elements.lavka.tywka.v ~= 0 then
				count_all = count_all+(elements.lavka.tywka_price.v*elements.lavka.tywka.v)
			end
			if elements.lavka.wkyra.v ~= 0 then
				count_all = count_all+(elements.lavka.wkyra_price.v*elements.lavka.wkyra.v)
			end
			if elements.lavka.euro.v ~= 0 then
				count_all = count_all+(elements.lavka.euro_price.v*elements.lavka.euro.v)
			end
			if elements.lavka.gr_talon.v ~= 0 then
				count_all = count_all+(elements.lavka.gr_talon_price.v*elements.lavka.gr_talon.v)
			end
			if elements.lavka.antibiotiki.v ~= 0 then
				count_all = count_all+(elements.lavka.antibiotiki_price.v*elements.lavka.antibiotiki.v)
			end
			if elements.lavka.prison.v ~= 0 then
				count_all = count_all+(elements.lavka.prison_price.v*elements.lavka.prison.v)
			end
			if elements.lavka.mod_wings_price.v ~= 0 then
				count_all = count_all+elements.lavka.mod_wings_price.v
			end
			if elements.lavka.mod_reg_eyes_price.v ~= 0 then
				count_all = count_all+elements.lavka.mod_reg_eyes_price.v
			end
			if elements.lavka.zlov_moneta.v ~= 0 then
				count_all = count_all+(elements.lavka.zlov_moneta_price.v*elements.lavka.zlov_moneta.v)
			end
			if elements.lavka.toch_stone.v ~= 0 then
				count_all = count_all+(elements.lavka.toch_stone_price.v*elements.lavka.toch_stone.v)
			end
			if elements.lavka.bilet_6.v ~= 0 then
				count_all = count_all+(elements.lavka.bilet_6_price.v*elements.lavka.bilet_6.v)
			end
			if elements.lavka.sticker_cluck.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_cluck_price.v*elements.lavka.sticker_cluck.v)
			end
			if elements.lavka.sticker_binko.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_binko_price.v*elements.lavka.sticker_binko.v)
			end
			if elements.lavka.sticker_jizzy.v ~= 0 then
				count_all = count_all+(elements.lavka.sticker_jizzy_price.v*elements.lavka.sticker_jizzy.v)
			end
			if elements.lavka.platinum_roll.v ~= 0 then
				count_all = count_all+(elements.lavka.platinum_roll_price.v*elements.lavka.platinum_roll.v)
			end
			if elements.lavka.rare_yellow.v ~= 0 then
				count_all = count_all+(elements.lavka.rare_yellow_price.v*elements.lavka.rare_yellow.v)
			end
			if elements.lavka.rare_red.v ~= 0 then
				count_all = count_all+(elements.lavka.rare_red_price.v*elements.lavka.rare_red.v)
			end
			if elements.lavka.rare_blue.v ~= 0 then
				count_all = count_all+(elements.lavka.rare_blue_price.v*elements.lavka.rare_blue.v)
			end
			if elements.lavka.box_marvel.v ~= 0 then
				count_all = count_all+(elements.lavka.box_marvel_price.v*elements.lavka.box_marvel.v)
			end
			if elements.lavka.fam_money.v ~= 0 then
				count_all = count_all+(elements.lavka.fam_money_price.v*elements.lavka.fam_money.v)
			end
			if elements.lavka.box_djent.v ~= 0 then
				count_all = count_all+(elements.lavka.box_djent_price.v*elements.lavka.box_djent.v)
			end
			if elements.lavka.box_minecraft.v ~= 0 then
				count_all = count_all+(elements.lavka.box_minecraft_price.v*elements.lavka.box_minecraft.v)
			end
			if elements.lavka.box_moto.v ~= 0 then
				count_all = count_all+(elements.lavka.box_moto_price.v*elements.lavka.box_moto.v)
			end
			if elements.lavka.box_car.v ~= 0 then
				count_all = count_all+(elements.lavka.box_car_price.v*elements.lavka.box_car.v)
			end
			if elements.lavka.box_nostalg.v ~= 0 then
				count_all = count_all+(elements.lavka.box_nostalg_price.v*elements.lavka.box_nostalg.v)
			end
			if elements.lavka.larec_oligarha.v ~= 0 then
				count_all = count_all+(elements.lavka.larec_oligarha_price.v*elements.lavka.larec_oligarha.v)
			end
			if elements.lavka.rykzak_para_price.v ~= 0 then
				count_all = count_all+elements.lavka.rykzak_para_price.v
			end
			if elements.lavka.rykzak_pirat_price.v ~= 0 then
				count_all = count_all+elements.lavka.rykzak_pirat_price.v
			end
			if elements.lavka.mod_teddi_1_price.v ~= 0 then
				count_all = count_all+elements.lavka.mod_teddi_1_price.v
			end
			if elements.lavka.mod_teddi_2_price.v ~= 0 then
				count_all = count_all+elements.lavka.mod_teddi_2_price.v
			end
			if elements.lavka.mod_teddi_3_price.v ~= 0 then
				count_all = count_all+elements.lavka.mod_teddi_3_price.v
			end
			if elements.lavka.band_respect.v ~= 0 then
				count_all = count_all+(elements.lavka.band_respect_price.v*elements.lavka.band_respect.v)
			end
			if elements.lavka.larec_premium.v ~= 0 then
				count_all = count_all+(elements.lavka.larec_premium_price.v*elements.lavka.larec_premium.v)
			end
			if elements.lavka.larec_car_box.v ~= 0 then
				count_all = count_all+(elements.lavka.larec_car_box_price.v*elements.lavka.larec_car_box.v)
			end
			imgui.Text('')
			imgui.Text(u8('Для покупки всех товаров необходимо $'..count_all))
			if count_all > getPlayerMoney(Player) then
				imgui.TextColoredRGB(u8('{FF3300}Тебе нехватает $'..count_all-getPlayerMoney(Player)))
			end
			if imgui.Button(u8"Начать скупку",imgui.ImVec2(250,25)) then
				skupka()
				windowstate.v = not windowstate.v
			end
			imgui.Separator()
		end
		----------------------------------------
		imgui.Separator()
		imgui.PushItemWidth(90)
		imgui.InputInt(u8('Своровать модификацию с указанного ID'),elements.config.attach_id)
		if elements.config.attach_id.v < 0 or elements.config.attach_id.v > 1001 then
			elements.config.attach_id.v = 1001
		end
		imgui.Separator()
		----------------------------------------
		imgui.Checkbox(u8('Открывать стандартный сундук'),elements.chest.roll_standart)
		imgui.Checkbox(u8('Открывать платиновый сундук'),elements.chest.roll_platinum)
		imgui.Checkbox(u8('Открывать тайник Маска'),elements.chest.roll_maska)
		----------------------------------------
		imgui.PushItemWidth(81)
		imgui.InputInt(u8('Задержка в мин.'),elements.chest.roll_wait)
		if elements.chest.roll_wait.v < 1 then elements.chest.roll_wait.v = 1 end
		----------------------------------------
		if imgui.Checkbox(u8('Открывать сундуки'),elements.chest.roll_state) then
			if elements.chest.roll_state.v == true then
				windowstate.v = not windowstate.v
				lua_thread.create(function()
					if elements.chest.roll_standart.v == true then
						sampSendClickTextdraw(65535)
						active = true
						sampSendChat("/invent")
						wait(2500)
					end
					if elements.chest.roll_platinum.v == true then
						sampSendClickTextdraw(65535)
						wait(355)
						active2 = true
						sampSendChat("/invent")
						wait(2500)
					end
					if elements.chest.roll_maska.v == true then
						sampSendClickTextdraw(65535)
						wait(355)
						active3 = true
						sampSendChat("/invent")
						wait(2500)
					end
				end)
			end
		end
		imgui.Separator()
		----------------------------------------
		imgui.Checkbox(u8('Выключить игроков в зоне стрима'),elements.config.del_stream_pl)
		imgui.SameLine()
		imgui.TextQuestion(u8'Отключает появление ИГРОКОВ в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		if imgui.Checkbox(u8('Выключить обновление зоны стрима'),elements.config.del_stream) then
			if elements.config.del_stream.v == true then
				elements.config.del_shout.v = true
			end
			if elements.config.del_stream.v == false then
				elements.config.del_shout.v = false
			end
		end
		imgui.SameLine()
		----------------------------------------
		imgui.TextQuestion(u8'Отключает появление игроков и транспорта в зоне стрима.\nПосле отключения функции необходимо обновить зону стрима (достаточно зайти и выйти в любой интерьер).')
		----------------------------------------
		imgui.SameLine()
		imgui.Checkbox(u8('Выключить /s чат'),elements.config.del_shout)
		----------------------------------------
		imgui.EndGroup()
		imgui.Separator()
		imgui.CenterTextColored(u8('{FDDB6D}Лог'))
		imgui.Separator()
		imgui.BeginChild('rendertextimguifam',imgui.ImVec2(imgui.GetWindowSize().x - 20,imgui.GetWindowSize().y - 110),true, imgui.WindowFlags.HorizontalScrollbar)
		if #chatMessages > 0  then
			local clipper = imgui.ImGuiListClipper(#chatMessages)
			while clipper:Step() do
				for i = clipper.DisplayStart + 1, clipper.DisplayEnd do
					imgui.TextColoredRGB(u8(chatMessages[i]))
				end
			end
		else
			imgui.CenterWindowText(u8('Пустота...'),imgui.TextDisabled)
		end
		imgui.EndChild()
		imgui.End()
	end
end

function sampev.onSendClickTextDraw(textdrawId)
	if elements.state.showmodel == true then
		model, rotX, rotY, rotZ, zoom, clr1, clr2 = sampTextdrawGetModelRotationZoomVehColor(textdrawId)
		if model ~= 0 and model ~= 65535 then
			sampAddChatMessage(string.format('Model: %d, %0.6f, %0.6f, %0.6f, %0.6f',model,rotX,rotY,rotZ,zoom),0xFF3300)
			-- sampAddChatMessage(string.format('/**/{%d, true, true, 1, 0, "USE", "…CЊO‡’€OBAT’", 0x4F4F4FFF, "Неизвестно (дт)", "", %0.6f, %0.6f, %0.6f, %0.6f},',model,rotX,rotY,rotZ,zoom),0xFF3300)
		end
	end
end

function sampev.onShowTextDraw(textdrawId, data)
	-- if elements.config.anim_car.v == true then
		-- if data.text:find('+1') or data.text:find('+2') or data.text:find('+3') or data.text:find('+4') or data.text:find('+5') or data.text:find('+6') or data.text:find('+7') or data.text:find('+8') or data.text:find('+9') or data.text:find('+10') or data.text:find('+11') then  
			-- data.text = '+12'
			
		-- end
	-- end
	if data.modelId == 1649 then
		--------------------[Первая строка]--------------------
		if data.position.x == 184.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 1 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 2 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 3 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 4 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 164 and elements.state.autoloot_number == 5 then
			elements.state.autoloot_number = 0
			--------------------[Вторая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 6 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 7 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 8 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 9 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 195 and elements.state.autoloot_number == 10 then
			elements.state.autoloot_number = 0
		--------------------[Третья строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 11 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 12 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 13 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 14 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 225 and elements.state.autoloot_number == 15 then
			elements.state.autoloot_number = 0
		--------------------[Четвертая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 16 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 17 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 18 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 19 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 256 and elements.state.autoloot_number == 20 then
			elements.state.autoloot_number = 0
		--------------------[Пятая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 21 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 22 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 23 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 24 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 286 and elements.state.autoloot_number == 25 then
			elements.state.autoloot_number = 0
		--------------------[Шестая строка]--------------------
		elseif data.position.x == 184.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 26 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 211 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 27 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 237.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 28 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 264 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 29 then
			elements.state.autoloot_number = 0
		elseif data.position.x == 290.5 and math.floor(data.position.y) == 317 and elements.state.autoloot_number == 30 then
			elements.state.autoloot_number = 0
		end
	end
	--------------------[Первая строка]--------------------
	if data.position.x == 209 and math.floor(data.position.y) == 186 then
		autoloot_td[1] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 186 then
		autoloot_td[2] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 186 then
		autoloot_td[3] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 186 then
		autoloot_td[4] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 186 then
		autoloot_td[5] = data.text
	--------------------[Вторая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 217 then
		autoloot_td[6] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 217 then
		autoloot_td[7] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 217 then
		autoloot_td[8] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 217 then
		autoloot_td[9] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 217 then
		autoloot_td[10] = data.text
	--------------------[Третья строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 247 then
		autoloot_td[11] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 247 then
		autoloot_td[12] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 247 then
		autoloot_td[13] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 247 then
		autoloot_td[14] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 247 then
		autoloot_td[15] = data.text
	--------------------[Четвертая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 278 then
		autoloot_td[16] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 278 then
		autoloot_td[17] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 278 then
		autoloot_td[18] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 278 then
		autoloot_td[19] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 278 then
		autoloot_td[20] = data.text
	--------------------[Пятая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 308 then
		autoloot_td[21] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 308 then
		autoloot_td[22] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 308 then
		autoloot_td[23] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 308 then
		autoloot_td[24] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 308 then
		autoloot_td[25] = data.text
	--------------------[Шестая строка]--------------------
	elseif data.position.x == 209 and math.floor(data.position.y) == 339 then
		autoloot_td[26] = data.text
	elseif data.position.x == 235.5 and math.floor(data.position.y) == 339 then
		autoloot_td[27] = data.text
	elseif data.position.x == 262 and math.floor(data.position.y) == 339 then
		autoloot_td[28] = data.text
	elseif data.position.x == 288.5 and math.floor(data.position.y) == 339 then
		autoloot_td[29] = data.text
	elseif data.position.x == 315 and math.floor(data.position.y) == 339 then
		autoloot_td[30] = data.text
	end
	--------------------[Прочее]--------------------
	if data.modelId == 330 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 360 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 616 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 617 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 620 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1018 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1020 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1022 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1104 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1428 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1512 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1520 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1546 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1588 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 1614 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 2049 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 2050 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 2051 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 2224 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 2744 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 2973 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 3065 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 3426 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 18244 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 18891 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 19348 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 19592 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 19610 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 19822 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 19959 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end
	if data.modelId == 19967 then sampAddChatMessage(string.format(data.modelId.." - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFFFF00) end


	if data.modelId == 217 then sampAddChatMessage("Скин ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 1598 then sampAddChatMessage(string.format("Девушка на спину ("..data.modelId..") - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFF3300) end
	if data.modelId == 2061 then sampAddChatMessage("Вертель за спиной ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 2224 then sampAddChatMessage("Карамельная бита ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 2446 then sampAddChatMessage(string.format("Красный ящик ("..data.modelId..") - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFF3300) end
	if data.modelId == 2855 then sampAddChatMessage("Рюкзак-журнальный ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 3385 then sampAddChatMessage("Рюкзак будущего ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 8483 then sampAddChatMessage("Маска череп ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 10145 then sampAddChatMessage("Шляпа из будущего ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 11733 then sampAddChatMessage("Снежные сани 2 ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 18858 then sampAddChatMessage("Реактивный рюкзак 1-2 ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 19086 then sampAddChatMessage(string.format("Маска робота ("..data.modelId..") - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFF3300) end
	if data.modelId == 19573 then sampAddChatMessage("Рюкзак угол ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 19592 then sampAddChatMessage(string.format("Корзина ("..data.modelId..") - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFF3300) end
	if data.modelId == 19822 then sampAddChatMessage("Щит за спиной ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 19823 then sampAddChatMessage("Желтая бита на спину ("..data.modelId..") - Если дешево стоит - то купить.", 0xFF3300) end
	if data.modelId == 19893 then sampAddChatMessage(string.format("Карта на спину ("..data.modelId..") - заскринить название предмета + TD! (%0.6f, %0.6f, %0.6f, %0.6f) (/showmodel)",data.rotation.x,data.rotation.y,data.rotation.z,data.zoom), 0xFF3300) end
	--------------------[Помощь на заводе]--------------------
	if getActiveInterior() == 2 then
		if data.modelId == 7891 or data.modelId == 18644 then
			sampSendClickTextdraw(textdrawId)
		end
	end
	--------------------[Авто-точилка аксессуаров]--------------------
	if data.modelId == 16112 or data.modelId == 1615 then
		if elements.autotoch.autotoch_active then
			lua_thread.create(function()
				if textdrawId ~= 2108 and elements.autotoch.autotoch_active == true then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					wait(500)
					sampSendClickTextdraw(2077)
					elements.autotoch.autotoch_active = false
				else
					wait(500)
					sampSendClickTextdraw(2077)
					elements.autotoch.autotoch_active = false
				end
			end)
		end
	end
	--------------------[Авто-открытие сундуков]--------------------
	ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190" then
		if elements.chest.roll_state.v == true and active then
			lua_thread.create(function()
				if data.modelId == 19918 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use then
					sampSendClickTextdraw(textdrawId + 1)
					use = false
					close = true
				end
				if close then
					sampSendClickTextdraw(65535)
					close = false
					active = false
				end
			end)
		end
		----------------------------------------
		if elements.chest.roll_state.v == true and active2 then
			lua_thread.create(function()
				if data.modelId == 1353 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use2 = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use2 then
					sampSendClickTextdraw(textdrawId + 1)
					use2 = false
					close2 = true
				end
				if close2 then
					sampSendClickTextdraw(65535)
					close2 = false
					active2 = false
				end
			end)
		end
		----------------------------------------
		if elements.chest.roll_state.v == true and active3 then
			lua_thread.create(function()
				if data.modelId == 1733 then
					wait(500)
					sampSendClickTextdraw(textdrawId)
					use3 = true
				end
				if data.text == 'USE' or data.text == '…CЊO‡’€O‹AЏ’' and use3 then
					sampSendClickTextdraw(textdrawId + 1)
					use3 = false
					close3 = true
				end
				if close3 then
					sampSendClickTextdraw(65535)
					close3 = false
					active3 = false
				end
			end)
		end
		----------------------------------------
	end
	--------------------[Удаление текстдравов]--------------------
	if data.position.x == 34 and data.position.y == 230 then
		return false
	end
	if data.position.x == 37 and data.position.y == 233 then
		return false
	end
	if data.position.x == 39 and data.position.y == 235 then
		return false
	end
	if data.position.x == 18 and data.position.y == 182 then
		return false
	end
	if data.position.x == 66 and data.position.y == 232 then
		return false
	end
	if data.position.x == 66 and data.position.y == 240 then
		return false
	end
	if data.position.x == 79 and data.position.y == 248 then
		return false
	end
	if data.position.x == 85 and data.position.y == 256 then
		return false
	end
	----------------------------------------
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 32 and data.position.y == 204 then
		return false
	end
	if data.position.x == -8 and data.position.y == 198 then
		return false
	end
	if data.position.x == 70 and data.position.y == 204 then
		return false
	end
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 71 and data.position.y == 215 then
		return false
	end
	if data.position.x == 72 and data.position.y == 224 then
		return false
	end
	----------------------------------------
	if data.position.x == 29 and data.position.y == 200 then
		return false
	end
	if data.position.x == 32 and data.position.y == 204 then
		return false
	end
	if data.position.x == 36 and data.position.y == 208 then
		return false
	end
	if data.position.x == -9 and data.position.y == 198 then
		return false
	end
	if data.position.x == 74 and data.position.y == 204 then
		return false
	end
	if data.position.x == 74 and data.position.y == 215 then
		return false
	end
	if data.position.x == 74 and data.position.y == 224 then
		return false
	end
	--------------------[Стиллер текстдравов]--------------------
	ip, port = sampGetCurrentServerAddress()
	if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190" then
		if elements.state.stealer_td == true and data.modelId ~= 0 and data.modelId ~= 1649 then
			----------------------------------------
			for model_id, name in pairs(textdraw_name) do
				if model_id == data.modelId then
					return
				end
			end
			----------------------------------------
			if (data.modelId >= 0 and data.modelId <= 311) or  -- Скины
				(data.modelId >= 400 and data.modelId <= 611) then -- Транспорт
				return
			end
			----------------------------------------
			local file = io.open('moonloader/stealer/textdraws/'..data.modelId..'.notepad', 'a+')
			if file ~= -1 and file ~= nil then
				code_temp_3 = ""
				code_temp_3 = string.format(string.format('Model: %d, %0.6f, %0.6f, %0.6f, %0.6f\n',data.modelId,data.rotation.x,data.rotation.y,data.rotation.z,data.zoom))
				if string.find(file:read("*all"), code_temp_3, 1, true) then
					--sampfuncsLog('{FF3300}<Копия> '..code_temp_3)
					io.close(file)
					return
				end
				file:write('////////////////////['..os.date('%d-%m-%Y || %H:%M:%S')..']////////////////////\n')
				file:write(string.format('Model: %d, %0.6f, %0.6f, %0.6f, %0.6f\n',data.modelId,data.rotation.x,data.rotation.y,data.rotation.z,data.zoom))
				io.close(file)
			end
		end
	end
	----------------------------------------
	return {textdrawId, data}
end

function sampev.onDisplayGameText(style, time, text)
	----------------------------------------
	if isCharInAnyCar(PLAYER_PED) then
		carhandle = storeCarCharIsInNoSave(PLAYER_PED)
		if getCarModel(carhandle) == 456 then
			if string.find(text,"-12000%$") then
				prodovoz_timer = os.time()+240
			end
		end
	end
	----------------------------------------
	if text:find('Go to the lottery') then
		sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Посети лотерейную!', 0xFFFFFF)
		return false
	end
	----------------------------------------
	if text:find('-1 HP') or
	text:find('-2 HP') or
	text:find('-3 HP') or
	text:find('-4 HP') or
	text:find('-5 HP') or
	text:find('-6 HP') or
	text:find('-7 HP') or
	text:find('-8 HP') or
	text:find('-9 HP') or
	text:find('-10 HP') or
	text:find('+1 HP') or
	text:find('+2 HP') or
	text:find('+3 HP') or
	text:find('+4 HP') or
	text:find('+5 HP') or
	text:find('+6 HP') or
	text:find('+7 HP') or
	text:find('+8 HP') or
	text:find('+9 HP') or
	text:find('+10 HP') or
	text:find('You are hungry!') or
	text:find('You are very hungry!') or
	text:find('attention') then
		return false
	end
end

function sampev.onServerMessage(color, text)
	----------------------------------------
	if elements.state.autoloot == true and text:find('Подождите немного...') then
		return false
	end
	----------------------------------------
	if elements.chat.chatlog.v == true and text ~= ' ' and sampGetCurrentServerAddress() ~= "127.0.0.1" then
		----------------------------------------
		if not doesDirectoryExist("moonloader\\logs\\"..sampGetCurrentServerAddress()) then createDirectory("moonloader\\logs\\"..sampGetCurrentServerAddress()) end
		----------------------------------------
		local file_logs = io.open('moonloader/logs/'..sampGetCurrentServerAddress()..'/'..os.date('%d-%m-%Y')..'.txt', 'a+')
		if file_logs ~= -1 and file_logs ~= nil then
			file_logs:write('['..os.date('%d-%m-%Y || %H:%M:%S')..']['..color..'] '..text..'\n')
			file_logs:close()
		end
	end
	--------------------[Авто-открытие рулеток]--------------------
	if text:find("Вам был добавлен предмет") then
		elements.autoopenroul.open_roul_active = true
	end
	if text:find('%[Подсказка%] %{FFFFFF%}Вы получили +(.+)%$!') then
		elements.autoopenroul.open_roul_active = true
	end
	--------------------[Авто-точилка аксессуаров]--------------------
	if text:find('Увы, вам не удалось улучшить предмет') and elements.autotoch.autotoch_enable.v == true then
		elements.autotoch.autotoch_active = true
		inventory(elements.autotoch.checked_inv.v)
	end
	if text:find('Успех! Вам удалось улучшить предмет') and elements.autotoch.autotoch_enable.v == true then
		number = string.match(text, 'на ++(%d+)')+0
		if number < elements.autotoch.checked_radio.v and elements.autotoch.autotoch_enable.v == true then
			elements.autotoch.autotoch_active = true
			inventory(elements.autotoch.checked_inv.v)
		end
	end
	----------------------------------------
	if string.find(text,"купил у вас") or string.find(text,"Вы купили") or string.find(text,"Вы успешно купили") then
		if elements.chat.renderchatbuy.v == true then
			table.insert(chatMessages, '{FDDB6D}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsbuy.v == true then
			sampfuncsLog('{FDDB6D}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removechatbuy.v == true then
			return false
		end
	end
	----------------------------------------
	if elements.chat.removechatmicro.v == true and (text:find("Микрофон") and color == -1863723265) then
		return false
	end
	----------------------------------------
	if elements.chat.removechatdepatment.v == true and string.find(text,"%[D%]") then
		return false
	end
	----------------------------------------
	if elements.chat.removechatnews.v == true and string.find(text,"%[ News ") then
		return false
	end
	----------------------------------------
	if elements.chat.removechatalians.v == true and (text:find("Альянс") and color == -1178486529) then
		return false
	end
	----------------------------------------
	if elements.chat.removechatwait.v == true and (text:find("Подождите немного...") and color == -10270721) then
		return false
	end
	----------------------------------------
	if elements.chat.removechatfond.v == true and (text:find("в благотворительный фонд штата") and color == -2686721) then
		return false
	end
	----------------------------------------
	if (text:find("В нашем магазине ты можешь приобрести нужное количество игровых денег и потратить") or
		text:find("их на желаемый тобой") or
		text:find("имеют большие возможности") or
		text:find("можно приобрести редкие") or
		text:find("которые выделят тебя из толпы")) and color == 1687547391 or
		----------------------------------------
		(text:find("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~") or
		text:find("Основные команды сервера:") or
		text:find("Пригласи друга и получи") or
		text:find("Наш сайт:")) and color == -89368321 or
		----------------------------------------
		(text:find("Гость ") or
		text:find("Репортёр ")) and color == -1697828097 or
		----------------------------------------
		text:find("С помощью телефона можно заказать такси") and color == -170229249 or
		----------------------------------------
		text:find("Битва за контроль грузового корабля начнется через") and color == -10270721 or
		----------------------------------------
		((text:find(" ") and string.len(text) == 1) and color == -1) or
		----------------------------------------
		(text:find("Уважаемые жители штата! Минуточку внимания") or
		text:find("В данный момент проходит собеседование") or
		text:find("Для Вступления необходимо прибыть в") and color == 73381119) or
		----------------------------------------
		string.find(text,"Альхамбра") or
		string.find(text,"CS:GO") or
		string.find(text,"DOTA") or
		string.find(text,"Valhalla") or
		string.find(text,"Скупаю") or
		string.find(text,"СКУПАЮ") or
		string.find(text,"Buy") or
		string.find(text,"Аукцион") or
		string.find(text,"Выставил") or
		----------------------------------------
		string.find(text,"начал работу новый инкассатор") or
		string.find(text,"Убив его, вы сможете получить деньги") or
		string.find(text,"Со склада Армии") then
		if elements.chat.tosampfuncsspam.v == true then
			sampfuncsLog(os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removechatspam.v == true then
			return false
		end
	end
	----------------------------------------
	if string.find(text,"%[PREMIUM%]") or
	(string.find(text,"%[VIP%]") and not string.find(text,"%[VIP%] Объявление")) or
	string.find(text,"%[ADMIN%]") then
		if elements.chat.rendervipchat.v == true then
			table.insert(chatMessages, '{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsvipchat.v == true then
			sampfuncsLog('{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removevipchat.v == true then
			return false
		end
	end
	----------------------------------------
	if ((string.find(text,"%[Механик%]") or
	string.find(text,"%[Развозчик продуктов%]") or
	string.find(text,"%[Крупье%]") or
	string.find(text,"%[Работник Налоговой%]") or
	string.find(text,"%[Инкассатор%]") or
	string.find(text,"%[Дальнобойщик%]") or
	string.find(text,"%[Развозчик металлолома%]") or
	string.find(text,"%[Мусорщик%]") or
	string.find(text,"%[Водитель автобуса%]") or
	string.find(text,"%[Пожарный%]") or
	string.find(text,"%[Водитель трамвая%]") or
	string.find(text,"%[Машинист электропоезда%]") or
	string.find(text,"%[Главный фермер%]") or
	string.find(text,"%[Руководитель грузчиков%]") or
	string.find(text,"%[Руководитель завода%]") or
	string.find(text,"%[Ремонтник дорог%]") or
	string.find(text,"%[Продавец хотдогов%]") or
	string.find(text,"%[Развозчик пиццы%]") or
	string.find(text,"%[Адвокат%]") or
	string.find(text,"%[Таксист%]") or
	string.find(text,"%[Грузчик%]")) and color == -2686721) or
	-- string.find(text,"Таксист (%w+_%w+) принял вызов игрока (%w+_%w+)") and color == 1687547391 or
	string.find(text,"принял вызов игрока") and color == 1687547391 or
	string.find(text,"вызывает такси") and (color == 1687547391 or color == 2046517247) or
	string.find(text,"Поступил вызов, чтобы принять введите") and color == -1347440641 or
	string.find(text,"Местоположение:") and color == -1
	then
		if elements.chat.renderjobchat.v == true then
			table.insert(chatMessages, '{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsjobchat.v == true then
			sampfuncsLog('{FFD700}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removejobchat.v == true then
			return false
		end
	end
	----------------------------------------
	if ((string.find(text,"Объявление") or string.find(text,"Отредактировал сотрудник СМИ")) and (color == 1941201407 or color == -1)) then
		if elements.chat.renderadv.v == true then
			table.insert(chatMessages, '{FFFFFF}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.tosampfuncsadv.v == true then
			sampfuncsLog('{FFD700}'..os.date('[%H:%M:%S] ')..text)
		end
		if elements.chat.removeadv.v == true then
			return false
		end
	end
	----------------------------------------
	if (string.find(text,"кричит") and color == -253326081) then
		if elements.config.del_shout.v == true then
			return false
		end
	end
	----------------------------------------
	-- if text:find("Сработала защита от реконнекта! Попробуйте переподключиться через") and color == -10270721 then
		-- sec = string.match(text,'Сработала защита от реконнекта! Попробуйте переподключиться через (%d+)')
		-- reconnect_timer = os.time()+sec
	-- end
	----------------------------------------
	if text:find("Необходимо вставить ключи в зажигание. Используйте:") and color == -1347440641 then
		lua_thread.create(function()
			sampSendChat("/key")
			wait(500)
			sampSendChat("/engine")
		end)
	end
	----------------------------------------
	if text:find("В этом транспорте закончилось топливо.") and color == -1347440641 then
		sampAddChatMessage('В этом транспорте закончилось топливо.', 0xAFAFAF)
		sampSendChat("/key")
	end
	----------------------------------------
	if text:find("Чтобы вызвать механика, используйте телефон") and color == -1347440641 then
		sampSendChat("/key")
	end
	----------------------------------------
	if text:find("заглушил%(а%) двигатель") and color == -1029514497 then
		if text:find(string.format("%s заглушил",local_name)) then
			if isCharInAnyCar(PLAYER_PED) then
				sampAddChatMessage(' '..local_name..' заглушил(а) двигатель', 0xC2A2DA)
				sampSendChat("/key")
			end
		end
	end
	----------------------------------------
	if text:find('Попробуйте через {FF6347}') then
		second = string.match(text,'Попробуйте через {FF6347}(%d+)')
		prodovoz_timer = os.time()+second
	end
	----------------------------------------
	if text:find("У вас началась сильная ломка!") and color == -10270721 then
		if elements.config.autousedrugs.v == true then
			sampSendChat("/usedrugs 3")
		end
		return false
	end
	----------------------------------------
	if text:find("Вашему персонажу нужно принять") and color == -10270721 then
		return false
	end
	----------------------------------------
	if not finished and elements.chat.removevipchat.v == false then
		if text:find('^%[Ошибка%].*После последнего сообщения в этом чате нужно подождать') then
			lua_thread.create(function()
				wait(delay_autovr * 1000);
				sampSendChat('/vr ' .. message)
			end)
			return false
		end
		----------------------------------------
		local id = select(2, sampGetPlayerIdByCharHandle(PLAYER_PED))
		if text:match('%[%u+%] {%x+}[A-z0-9_]+%[' .. id .. '%]:') then
			finished = true
		end
	end
	----------------------------------------
	if text:find('^Вы заглушены') or text:find('Для возможности повторной отправки сообщения в этот чат') then
		finished = true
	end
	----------------------------------------
end

function sampev.onPlayerJoin(playerid, color, isNpc, nickname)
	for i = 1, #friends do
		if nickname == friends[i] and local_name ~= friends[i] then
			----------------------------------------
			table.insert(chatMessages, '{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] заходит на сервер.')
			----------------------------------------
			if elements.chat.tosampfuncsconnect.v then
				sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] заходит на сервер.')
			end
			----------------------------------------
			if elements.chat.sendconnect.v then
				sampAddChatMessage(nickname..'['..playerid..'] заходит на сервер.', 0xFF3300)
			end
			----------------------------------------
		end
	end
	----------------------------------------
end

function sampev.onPlayerQuit(playerid, reason)
	for i = 1, #friends do
		nickname = sampGetPlayerNickname(playerid)
		if nickname == friends[i] then
			----------------------------------------
			if reason == 0 then reason_s = string.format("Ошибка")
			elseif reason == 1 then reason_s = string.format("Вышел")
			else reason_s = string.format("Кик/Бан") end
			----------------------------------------
			table.insert(chatMessages, '{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s)
			----------------------------------------
			if elements.chat.tosampfuncsdisconnect.v then
				sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s)
			end
			----------------------------------------
			if elements.chat.senddisconnect.v then
				sampAddChatMessage(nickname..'['..playerid..'] выходит с сервера. Причина: '..reason_s, 0xFF3300)
			end
			----------------------------------------
		end
	end
	----------------------------------------
end

function sampev.onSetWorldTime(hour)
	if hour ~= elements.config.set_time.v then
		setTimeOfDay(elements.config.set_time.v, 0)
		forceWeatherNow(elements.config.set_weather.v)
		return false
	end
	return false
end

function sampev.onSetPlayerTime(hour, minute)
	if hour ~= elements.config.set_time.v then
		setTimeOfDay(elements.config.set_time.v, 0)
		forceWeatherNow(elements.config.set_weather.v)
		return false
	end
	return false
end

function sampev.onSetWeather(weatherId)
	if weatherId ~= elements.config.set_weather.v then
		setTimeOfDay(elements.config.set_time.v, 0)
		forceWeatherNow(elements.config.set_weather.v)
		return false
	end
	return false
end

function sampev.onSetVehicleParamsEx(vehicleId, params, doors, windows)
	if elements.config.del_stream.v == true then
		return false
	end
	if params.boot == 1 then
		carid = vehicleId
	end
	if carid == vehicleId and params.boot == 0 then
		carid = -1
		printString('',0)
	end
	result, carhandle = sampGetCarHandleBySampVehicleId(vehicleId)
	if carhandle ~= -1 then
		----------------------------------------
		model = getCarModel(carhandle)
		ip, port = sampGetCurrentServerAddress()
		----------------------------------------
		if ip ~= "127.0.0.1" and vehicleId >= 839 then
			if model ~= 401 and
			model ~= 411 and
			model ~= 413 and
			model ~= 451 and
			model ~= 470 and
			model ~= 475 and
			model ~= 483 and
			model ~= 487 and
			model ~= 490 and
			model ~= 495 and
			model ~= 497 and
			model ~= 502 and
			model ~= 541 and
			model ~= 550 and
			model ~= 560 and
			model ~= 562 and
			model ~= 565 and
			model ~= 566 and
			model ~= 579 then
				fsoav(vehicleId)
			end
		end
		----------------------------------------
	end
end

function sampev.onVehicleStreamOut(vehicleId)
	if carid ~= -1 and carid == vehicleId then
		carid = -1
		printString('',0)
	end
end

function sampev.onPlayerStreamIn(playerId, team, model, position, rotation, color, fightingStyle)
	local friend = false
	nickname = sampGetPlayerNickname(playerId)
	for id = 1, #friends do
		if nickname == friends[id] then
			friend = true
		end
	end
	if friend == false then
		if elements.config.del_stream.v == true then
			return false
		end
		if elements.config.del_stream_pl.v == true then
			return false
		end
	end
end

function sampev.onVehicleStreamIn(vehicleId, data)
	if elements.config.del_stream.v == true then
		return false
	end
end

function sampev.onPlayerDeathNotification(killerid, killedid, reason)
	if elements.config.killStat.v == true then
		return false
	end
end

function sampev.onSendDeathNotification(reason, killerId)
	playername = sampGetPlayerNickname(killerId)
	sampAddChatMessage(playername, -1)
end

function sampev.onCreate3DText(id, color, position, distance, testLOS, attachedPlayerId, attachedVehicleId, text)
	if elements.config.del_opisanie_3d.v == true and position.x == 0 and position.y == 0 and position.z == -1 and distance == 7 and attachedPlayerId ~= 65535 then
		return false
	end
end

function onReceivePacket(id, bitStream)
	if reconnect_timer >= os.time() and (id ~= PACKET_DISCONNECTION_NOTIFICATION and id ~= PACKET_INVALID_PASSWORD and id ~= PACKET_CONNECTION_BANNED) then
		reconnect_timer = 0
	end
	if id == PACKET_DISCONNECTION_NOTIFICATION or id == PACKET_INVALID_PASSWORD or id == PACKET_CONNECTION_BANNED then
		sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'Server closed the connection.')
		if reconnect_timer < os.time() then
			reconnect_timer = os.time()+3
		end
	end
	if (id == PACKET_CONNECTION_ATTEMPT_FAILED) then
		sampfuncsLog('{FF3300}'..os.date('[%H:%M:%S] ')..'Server didn\'t not respond.')
	end
end

function linkVehicleToInterior(vehicleId, interior) -- NoBalloons
	local BS = raknetNewBitStream()
	raknetBitStreamWriteInt16(BS, vehicleId)
	raknetBitStreamWriteInt8(BS, interior)
	raknetEmulRpcReceiveBitStream(65, BS)
	raknetDeleteBitStream(BS)
end

function sampev.onCreateObject(objectId, data)
	-- if data.modelId == 854 then
		-- local file = io.open('moonloader/waxta.notepad', 'a+')
		-- if file ~= -1 and file ~= nil then
			-- file:write(string.format('{120,{%0.6f,%0.6f,%0.6f,%0.6f,%0.6f,%0.6f}},\n',data.position.x,data.position.y,data.position.z,data.rotation.x,data.rotation.y,data.rotation.z))
			-- io.close(file)
		-- end
	-- end
	if data.attachToVehicleId ~= 0xFFFF then -- NoBalloons
		local result, car = sampGetCarHandleBySampVehicleId(data.attachToVehicleId)
		if result and isCarModel(car, 487) then
			local model = data.modelId
			if model == 2923 or model == 19131 then
				return false
			else
				for id, color in pairs(balls) do
					if model == id then
						linkVehicleToInterior(data.attachToVehicleId, 0)
						changeCarColour(car, color[1], color[2])
						return false
					end
				end
			end
		end
	end
	--------------------[Стиллер объектов на транспорт]--------------------
	local tempObj = { }
	----------------------------------------
	tempObj['objectId'] = objectId
	tempObj['modelId'] = data.modelId
	tempObj['position'] = data.position
	tempObj['rotation'] = data.rotation
	tempObj['drawDistance'] = data.drawDistance
	tempObj['cameraCol'] = data.cameraCol
	tempObj['materialHave'] = false
	tempObj['materialNum'] = 0
	tempObj['materialTxtNum'] = 0
	----------------------------------------
	if sampGetGamestate() == 2 then
		tempObj['streamerDynamic'] = false
	else
		tempObj['streamerDynamic'] = true
	end
	----------------------------------------
	if data.texturesCount > 0 then
		if #data.materials ~= 0 then
			for i = 1, #data.materials do
				local tempMatObj = { }
				----------------------------------------
				tempMatObj['objectId'] = data.objectId
				tempMatObj['materialId'] = data.materials[i]['materialId']
				tempMatObj['modelId'] = data.materials[i]['modelId']
				tempMatObj['libraryName'] = data.materials[i]['libraryName']
				tempMatObj['textureName'] = data.materials[i]['textureName']
				tempMatObj['materialType'] = true
				----------------------------------------
				if data.materials[i]['color'] == 0 then
					tempMatObj['color'] = '0'
				else
					tempMatObj['color'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.materials[i]['color']))
				end
				----------------------------------------
				tempObj['materialHave'] = true
				tempObj['materialNum'] = tempObj['materialNum'] + 1
				----------------------------------------
				table.insert(tempObj, tempMatObj)
			end
		end
		----------------------------------------
		if #data.materialText ~= 0 then
			for i = 1, #data.materialText do
				local tempMatObj = {}
				----------------------------------------
				tempMatObj['objectId'] = data.objectId
				tempMatObj['materialId'] = data.materialText[i]['materialId']
				tempMatObj['materialSize'] = data.materialText[i]['materialSize']
				tempMatObj['fontName'] = data.materialText[i]['fontName']
				tempMatObj['fontSize'] = data.materialText[i]['fontSize']
				tempMatObj['bold'] = data.materialText[i]['bold']
				tempMatObj['materialType'] = false
				----------------------------------------
				if data.materialText[i]['fontColor'] == 0 then
					tempMatObj['fontColor'] = '0'
				else
					tempMatObj['fontColor'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.materialText[i]['fontColor']))
				end
				----------------------------------------
				if data.materialText[i]['backGroundColor'] == 0 then
					tempMatObj['backGroundColor'] = '0'
				else
					tempMatObj['backGroundColor'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.materialText[i]['backGroundColor']))
				end
				----------------------------------------
				tempMatObj['align'] = data.materialText[i]['align']
				data.materialText[i]['text'] = string.gsub(data.materialText[i]['text'], '\n', '\\n')
				tempMatObj['text'] = data.materialText[i]['text']
				----------------------------------------
				tempObj['materialHave'] = true
				tempObj['materialTxtNum'] = tempObj['materialTxtNum'] + 1
				----------------------------------------
				table.insert(tempObj, tempMatObj)
			end
		end
	end
	----------------------------------------
	function sampev.onSetObjectMaterialText(objectId, data)
		--------------------[Автобазар]--------------------
		if data.align == 1 and data.fontSize == 40 then
			local veh, price = data.text:match('^([^\n]+)\n{%x+}%$(%d+)')
			if veh and price then
				price = sumFormat(price)
				--sampfuncsLog('{FFFFFF}На продажу выставлен {FDDB6D}'..veh..'{FFFFFF} за {FDDB6D}$'..price..'{FFFFFF}.')
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] На продажу выставлен {FDDB6D}'..veh..'{FFFFFF} за {FDDB6D}$'..price..'{FFFFFF}.', 0xFFFFFF)
				----------------------------------------
				data.text = data.text:gsub('%$%d+', '$' .. price)
				return { objectId, data }
			end
		end
		----------------------------------------
		if tempObj['objectId'] == objectId then
			local tempMatObj = {}
			----------------------------------------
			tempMatObj['objectId'] = objectId
			tempMatObj['materialId'] = data.materialId
			tempMatObj['materialSize'] = data.materialSize
			tempMatObj['fontName'] = data.fontName
			tempMatObj['fontSize'] = data.fontSize
			tempMatObj['bold'] = data.bold
			tempMatObj['materialType'] = false
			----------------------------------------
			if data.fontColor == 0 then
				tempMatObj['fontColor'] = '0'
			else
				tempMatObj['fontColor'] = string.format('0x%X', bit.band(0xFFFFFFFF, data.fontColor))
			end
			if data.backGroundColor == 0 then
				tempMatObj['backGroundColor'] = '0'
			else
				tempMatObj['backGroundColor'] = string.format('0x%X', bit.band(0xFFFFFFFF,data.backGroundColor))
			end
			----------------------------------------
			tempMatObj['align'] = data.align
			data.text = string.gsub(data.text, '\n', '\\n')
			tempMatObj['text'] = data.text
			----------------------------------------
			tempObj['materialHave'] = true
			tempObj['materialTxtNum'] = tempObj['materialTxtNum'] + 1
			----------------------------------------
			table.insert(tempObj, tempMatObj)
		end
	end
	----------------------------------------
	if data.attachToVehicleId ~= nil and data.attachToVehicleId ~= 65535 and data.modelId == 19476 then
		local vehicleData = {}
		----------------------------------------
		vehicleData['id'] = data.attachToVehicleId
		vehicleData['data'] = tempObj
		----------------------------------------
		vehicleData['OffsetX'] = data.attachOffsets.x
		vehicleData['OffsetY'] = data.attachOffsets.y
		vehicleData['OffsetZ'] = data.attachOffsets.z
		vehicleData['RotX'] = data.attachRotation.x
		vehicleData['RotY'] = data.attachRotation.y
		vehicleData['RotZ'] = data.attachRotation.z
		----------------------------------------
		table.insert(objectsTable, vehicleData)
		----------------------------------------
	end
end

function sampev.onDestroyObject(objectId)
	for i = 1, #objectsTable do
		if objectsTable[i] ~= nil then
			if objectsTable[i]['data']['objectId'] == objectId then
				objectsTable[i] = nil
				break
			end
		end
	end
end

function fsoav(vehicleId)
	if tonumber(vehicleId) == nil then return sampAddChatMessage('Invalid vehicleId', 0xFF9ACD32) end
	----------------------------------------
	local res, vHandle = sampGetCarHandleBySampVehicleId(vehicleId)
	if not res then
		return
	end
	----------------------------------------
	count = false
	----------------------------------------
	for i = 1, #objectsTable do
		if objectsTable[i] ~= nil then
			if objectsTable[i]['id'] == tonumber(vehicleId) then
				count = true
			end
		end
	end
	if count == true then
		model = getCarModel(carhandle)
		----------------------------------------
		vehicle_name = getNameOfVehicleModel(model)
		----------------------------------------
		directory = 'moonloader/stealer/vehicles/'..model..' - '..vehicle_name..'('..vehicleId..').notepad'
		----------------------------------------
		os.remove(directory)
		local file = io.open(directory, 'a+')
		----------------------------------------
		local vPosX, vPosY, vPosZ = getCarCoordinates(carhandle)
		local vAngle = getCarHeading(carhandle)
		local vColorPrim, vColorSec = getCarColours(carhandle)
		----------------------------------------
		file:write(string.format('new vehicleid = CreateVehicle(%i, %f, %f, %f, %f, %i, %i, -1);', getCarModel(carhandle), vPosX, vPosY, vPosZ, vAngle, vColorPrim, vColorSec) .. '\n\n')
		----------------------------------------
		for i = 1, #objectsTable do
			if objectsTable[i] ~= nil then
				if objectsTable[i]['id'] == tonumber(vehicleId) then
					local setDrawDist = 'STREAMER_OBJECT_DD'
					local setDrawDistNum = '0.0'
					----------------------------------------
					if objectsTable[i]['data']['drawDistance'] > 0 then
						setDrawDist = tostring(objectsTable[i]['data']['drawDistance'])
						setDrawDistNum = tostring(objectsTable[i]['data']['drawDistance'])
						----------------------------------------
						if setDrawDist == nil and setDrawDistNum == nil then
							setDrawDist = 'STREAMER_OBJECT_DD'
							setDrawDistNum = '0.0'
						else
							setDrawDist = tostring(math.floor(objectsTable[i]['data']['drawDistance'])) .. '.0'
							setDrawDistNum = tostring(math.floor(objectsTable[i]['data']['drawDistance'])) .. '.0'
						end
					end
					----------------------------------------
					local objVar = 'vaos_' .. tostring(i)
					----------------------------------------
					if objectsTable[i]['data']['materialNum'] == 0 and objectsTable[i]['data']['materialTxtNum'] == 0 then
						if objectsTable[i]['data']['streamerDynamic'] then
							file:write(string.format('%sCreateDynamicObject(%d, %f, %f, %f, %f, %f, %f, %d, %d, -1, STREAMER_OBJECT_SD, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							0,
							0,
							setDrawDist))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetDynamicObjectNoCameraCol(%s);\n', objVar)) end
							file:write(string.format('AttachDynamicObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						else
							file:write(string.format('%sCreateObject(%d, %f, %f, %f, %f, %f, %f, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							setDrawDistNum))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetObjectNoCameraCol(%s);\n', objVar)) end
							file:write(string.format('AttachObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						end
					else
						if objectsTable[i]['data']['streamerDynamic'] then
							file:write(string.format('%sCreateDynamicObject(%d, %f, %f, %f, %f, %f, %f, %d, %d, -1, STREAMER_OBJECT_SD, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							0,
							0,
							setDrawDist))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetDynamicObjectNoCameraCol(%s);\n', objVar)) end
							----------------------------------------
							for j = 1, #objectsTable[i]['data'] do
								if objectsTable[i]['data'][j] ~= nil then
									if objectsTable[i]['data'][j]['materialType'] == true then
										file:write(string.format('SetDynamicObjectMaterial(%s, %d, %d, "%s", "%s", %s);\n',
										objVar,
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['modelId'],
										objectsTable[i]['data'][j]['libraryName'],
										objectsTable[i]['data'][j]['textureName'],
										objectsTable[i]['data'][j]['color']))
									else
										file:write(string.format('SetDynamicObjectMaterialText(%s, %d, "%s", %d, "%s", %d, %d, %s, %s, %d);\n',
										objVar,
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['text'],
										objectsTable[i]['data'][j]['materialSize'],
										objectsTable[i]['data'][j]['fontName'],
										objectsTable[i]['data'][j]['fontSize'],
										objectsTable[i]['data'][j]['bold'],
										objectsTable[i]['data'][j]['fontColor'],
										objectsTable[i]['data'][j]['backGroundColor'],
										objectsTable[i]['data'][j]['align']))
									end
								end
							end
							----------------------------------------
							file:write(string.format('AttachDynamicObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						else
							file:write(string.format('%sCreateObject(%d, %f, %f, %f, %f, %f, %f, %s);\n',
							'new ' .. objVar .. ' = ',
							objectsTable[i]['data']['modelId'],
							objectsTable[i]['data']['position']['x'],
							objectsTable[i]['data']['position']['y'],
							objectsTable[i]['data']['position']['z'],
							objectsTable[i]['data']['rotation']['x'],
							objectsTable[i]['data']['rotation']['y'],
							objectsTable[i]['data']['rotation']['z'],
							setDrawDistNum))
							if objectsTable[i]['data']['cameraCol'] == 1 then file:write(string.format('SetObjectNoCameraCol(%s);\n', objVar)) end
							----------------------------------------
							for j = 1, #objectsTable[i]['data'] do
								if objectsTable[i]['data'][j] ~= nil then
									if objectsTable[i]['data'][j]['materialType'] == true then
										file:write(string.format('SetObjectMaterial(%s, %d, %d, "%s", "%s", %s);\n',
										objVar,
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['modelId'],
										objectsTable[i]['data'][j]['libraryName'],
										objectsTable[i]['data'][j]['textureName'],
										objectsTable[i]['data'][j]['color']))
									else
										file:write(string.format('SetObjectMaterialText(%s, "%s", %d, %d, "%s", %d, %d, %s, %s, %d);\n',
										objVar,
										objectsTable[i]['data'][j]['text'],
										objectsTable[i]['data'][j]['materialId'],
										objectsTable[i]['data'][j]['materialSize'],
										objectsTable[i]['data'][j]['fontName'],
										objectsTable[i]['data'][j]['fontSize'],
										objectsTable[i]['data'][j]['bold'],
										objectsTable[i]['data'][j]['fontColor'],
										objectsTable[i]['data'][j]['backGroundColor'],
										objectsTable[i]['data'][j]['align']))
									end
								end
							end
							----------------------------------------
							file:write(string.format('AttachObjectToVehicle(%s, vehicleid, %f, %f, %f, %f, %f, %f);\n\n',
							objVar,
							objectsTable[i]['OffsetX'],
							objectsTable[i]['OffsetY'],
							objectsTable[i]['OffsetZ'],
							objectsTable[i]['RotX'],
							objectsTable[i]['RotY'],
							objectsTable[i]['RotZ']))
						end
					end
				end
			end
		end
		io.close(file)
	end
end

function onReceiveRpc(id, bitStream)
	if id == RPC_SCRCREATEOBJECT and sampIsLocalPlayerSpawned() then
		local id = raknetBitStreamReadInt16(bitStream)
		local model = raknetBitStreamReadInt32(bitStream)
		if elements.destroy.bucket.v == true and (model == 2404 or model == 2405 or model == 2406 or model == 2410 or model == 19601 or model == 19848) then
			return false
		end
		if elements.destroy.tree.v == true and model == 19076 then
			return false
		end
		if elements.destroy.serdce.v == true and model == 7093 then
			return false
		end
		if elements.destroy.xlam.v == true and 
		(model == 819 or -- Большой Куст #2
		model == 823 or -- Большой Куст #1
		model == 886 or -- Небольшое дерево #1
		model == 890 or -- Небольшое дерево #2
		model == 894 or -- INVALID_OBJECT_ID
		model == 1728 or -- Диван
		model == 2614 or -- Флаг
		model == 18659 or -- Граффити
		model == 18660 or -- Граффити
		model == 18661 or -- Граффити
		model == 18662 or -- Граффити
		-- model == 18663 or -- Граффити (используются на ЦР)
		-- model == 18664 or -- Граффити (используются для других надписей)
		model == 18665 or -- Граффити
		model == 18666 or -- Граффити
		model == 18667 or -- Граффити
		model == 19306 or -- Красный флажок
		model == 19317 or -- Красная гитара
		model == 19318 or -- Чёрно-белая гитара
		model == 19319 or -- Чёрная гитара
		model == 19525) then -- Праздничный торт
			return false
		end
	end
end

function skupka()
	delay_skupka = 500
	lua_thread.create(function()
		if elements.lavka.drugs.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 0, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.drugs.v..' '..elements.lavka.drugs_price.v)
		end
		if elements.lavka.materials.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 1, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.materials.v..' '..elements.lavka.materials_price.v)
		end
		if elements.lavka.fam_talon.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.fam_talon.v..' '..elements.lavka.fam_talon_price.v)
		end
		if elements.lavka.cherepa.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.cherepa.v..' '..elements.lavka.cherepa_price.v)
		end
		if elements.lavka.sale_talon.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sale_talon.v..' '..elements.lavka.sale_talon_price.v)
		end
		if elements.lavka.gift.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gift.v..' '..elements.lavka.gift_price.v)
		end
		if elements.lavka.cooper_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.cooper_roll.v..' '..elements.lavka.cooper_roll_price.v)
		end
		if elements.lavka.silver_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.silver_roll.v..' '..elements.lavka.silver_roll_price.v)
		end
		if elements.lavka.gold_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 10, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gold_roll.v..' '..elements.lavka.gold_roll_price.v)
		end
		if elements.lavka.xlopok.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 2, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.xlopok.v..' '..elements.lavka.xlopok_price.v)
		end
		if elements.lavka.lens.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.lens.v..' '..elements.lavka.lens_price.v)
		end
		if elements.lavka.stone.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.stone.v..' '..elements.lavka.stone_price.v)
		end
		if elements.lavka.metal.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.metal.v..' '..elements.lavka.metal_price.v)
		end
		if elements.lavka.bronze.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.bronze.v..' '..elements.lavka.bronze_price.v)
		end
		if elements.lavka.silver.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 7, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.silver.v..' '..elements.lavka.silver_price.v)
		end
		if elements.lavka.gold.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gold.v..' '..elements.lavka.gold_price.v)
		end
		if elements.lavka.alyminiu.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.alyminiu.v..' '..elements.lavka.alyminiu_price.v)
		end
		if elements.lavka.tywka.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.tywka.v..' '..elements.lavka.tywka_price.v)
		end
		if elements.lavka.wkyra.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 13, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.wkyra.v..' '..elements.lavka.wkyra_price.v)
		end
		if elements.lavka.euro.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.euro.v..' '..elements.lavka.euro_price.v)
		end
		if elements.lavka.gr_talon.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.gr_talon.v..' '..elements.lavka.gr_talon_price.v)
		end
		if elements.lavka.antibiotiki.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.antibiotiki.v..' '..elements.lavka.antibiotiki_price.v)
		end
		if elements.lavka.prison.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 7, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.prison.v..' '..elements.lavka.prison_price.v)
		end
		if elements.lavka.mod_wings_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 12, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.mod_wings_price.v)
		end
		if elements.lavka.mod_reg_eyes_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 13, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.mod_reg_eyes_price.v)
		end
		if elements.lavka.zlov_moneta.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 17, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.zlov_moneta.v..' '..elements.lavka.zlov_moneta_price.v)
		end
		if elements.lavka.toch_stone.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.toch_stone.v..' '..elements.lavka.toch_stone_price.v)
		end
		if elements.lavka.bilet_6.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.bilet_6.v..' '..elements.lavka.bilet_6_price.v)
		end
		if elements.lavka.sticker_cluck.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 4, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_cluck.v..' '..elements.lavka.sticker_cluck_price.v)
		end
		if elements.lavka.sticker_binko.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_binko.v..' '..elements.lavka.sticker_binko_price.v)
		end
		if elements.lavka.sticker_jizzy.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.sticker_jizzy.v..' '..elements.lavka.sticker_jizzy_price.v)
		end
		if elements.lavka.platinum_roll.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 10, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.platinum_roll.v..' '..elements.lavka.platinum_roll_price.v)
		end
		if elements.lavka.rare_yellow.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rare_yellow.v..' '..elements.lavka.rare_yellow_price.v)
		end
		if elements.lavka.rare_red.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 9, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rare_red.v..' '..elements.lavka.rare_red_price.v)
		end
		if elements.lavka.rare_blue.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 10, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rare_blue.v..' '..elements.lavka.rare_blue_price.v)
		end
		if elements.lavka.fam_money.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 14, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.fam_money.v..' '..elements.lavka.fam_money_price.v)
		end
		if elements.lavka.box_marvel.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 18, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_marvel.v..' '..elements.lavka.box_marvel_price.v)
		end
		if elements.lavka.box_djent.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 0, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_djent.v..' '..elements.lavka.box_djent_price.v)
		end
		if elements.lavka.box_minecraft.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 1, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_minecraft.v..' '..elements.lavka.box_minecraft_price.v)
		end
		if elements.lavka.box_moto.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 2, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_moto.v..' '..elements.lavka.box_moto_price.v)
		end
		if elements.lavka.box_car.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 3, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_car.v..' '..elements.lavka.box_car_price.v)
		end
		if elements.lavka.box_nostalg.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 5, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.box_nostalg.v..' '..elements.lavka.box_nostalg_price.v)
		end
		if elements.lavka.larec_oligarha.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.larec_oligarha.v..' '..elements.lavka.larec_oligarha_price.v)
		end
		if elements.lavka.rykzak_para_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 1, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rykzak_para_price.v)
		end
		if elements.lavka.rykzak_pirat_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 2, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.rykzak_pirat_price.v)
		end
		if elements.lavka.mod_teddi_1_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 6, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.mod_teddi_1_price.v)
		end
		if elements.lavka.mod_teddi_2_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 7, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.mod_teddi_2_price.v)
		end
		if elements.lavka.mod_teddi_3_price.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.mod_teddi_3_price.v)
		end
		if elements.lavka.band_respect.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 17, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.band_respect.v..' '..elements.lavka.band_respect_price.v)
		end
		if elements.lavka.larec_premium.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 2, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.larec_premium.v..' '..elements.lavka.larec_premium_price.v)
		end
		if elements.lavka.larec_car_box.v ~= 0 then
			wait(delay_skupka)
			sampSendDialogResponse(3040, 1, nil, nil)
			sampSendDialogResponse(3050, 1, 19, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			wait(delay_skupka)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 20, nil)
			sampSendDialogResponse(3050, 1, 8, nil)
			sampSendDialogResponse(3060, 1, 0, elements.lavka.larec_car_box.v..' '..elements.lavka.larec_car_box_price.v)
		end
		sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт закончил выставлять товары на покупку.', 0xFFFFFF)
	end)
end

function sampev.onSetPlayerDrunk(drunkLevel)
	--sampfuncsLog(drunkLevel)
	return {1}
end

-- function sampev.onSendClientJoin(Ver, mod, nick, response, authKey, clientver, unk)
	-- clientver = 'Arizona PC'
	-- return {Ver, mod, nick, response, authKey, clientver, unk}
-- end

function sampev.onSendPlayerSync(data)
	--------------------[Анти банихоп]--------------------
	if bit.band(data.keysData, 0x28) == 0x28 then
		data.keysData = bit.bxor(data.keysData, 0x20)
	end
	--------------------[Отключение анимаций посадки в транспорт]--------------------
	for animid = 1009, 1060 do
		if animid == data.animationId then
			elements.config.anim_car.v = false
		end
	end
	----------------------------------------
end

function sumFormat(sum) -- Для автобазара
	if #sum > 3 then
		local b, e = ('%d'):format(sum):gsub('^%-', '')
		local c = b:reverse():gsub('%d%d%d', '%1.')
		local d = c:reverse():gsub('^%.', '')
		return (e == 1 and '-' or '')..d
	end
	return sum
end

-- local orion = 999

function sampev.onShowDialog(dialogId, style, title, button1, button2, text)
	--sampAddChatMessage(dialogId,-1)
	--sampAddChatMessage(text,-1)
	if elements.state.showmodel == true then
		sampfuncsLog(text)
	end
	--------------------[Orio[N]]--------------------
	-- if dialogId == 8655 then
		-- sampSendDialogResponse(dialogId, 1, nil, orion)
		-- orion = orion+1
		-- sampAddChatMessage(orion, -1)
	-- end
	-- if dialogId == 695 then
		-- sampSendDialogResponse(dialogId, 1, 2, nil)
	-- end
	
	ip, port = sampGetCurrentServerAddress()
	--------------------[Автологин]--------------------
	if ip == "185.169.134.5" and not sampIsLocalPlayerSpawned() then
		if local_name == elements.account.my_nick.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password.v)
				lua_thread.create(function()
					wait(1000)
					autoupdate("https://raw.githubusercontent.com/metk1u/scripts/main/update.json", '['..string.upper(thisScript().name)..']: ')
				end)
				return false
			end
		end
		if local_name == elements.account.my_nick_2.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password_2.v)
				lua_thread.create(function()
					wait(1000)
					autoupdate("https://raw.githubusercontent.com/metk1u/scripts/main/update.json", '['..string.upper(thisScript().name)..']: ')
				end)
				return false
			end
		end
		if local_name == elements.account.my_nick_3.v then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_password_3.v)
				lua_thread.create(function()
					wait(1000)
					autoupdate("https://raw.githubusercontent.com/metk1u/scripts/main/update.json", '['..string.upper(thisScript().name)..']: ')
				end)
				return false
			end
		end
	end
	if ip == "127.0.0.1" and not sampIsLocalPlayerSpawned() then
		if local_name == "Sawa_Seleznev" then
			if dialogId == 6 then
				sampSendDialogResponse(dialogId, 1, 0, "123456")
				return false
			end
		end
	end
	if ip == "185.169.134.61" and not sampIsLocalPlayerSpawned() then
		if local_name == "Che_Lovek" then
			if dialogId == 2 then
				sampSendDialogResponse(dialogId, 1, 0, "Sawka1289")
				return false
			end
		end
	end
	--------------------[Автопинкод]--------------------
	if ip == "185.169.134.5" then
		if local_name == elements.account.my_nick.v then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_2.v then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode_2.v)
				return false
			end
		end
		if local_name == elements.account.my_nick_3.v then
			if dialogId == 991 then
				sampSendDialogResponse(dialogId, 1, 0, elements.account.my_pincode_3.v)
				return false
			end
		end
	end
	--------------------[Автоподтверждение на открытие сим-карты]--------------------
	if dialogId == 9208 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Автоподтверждение на починку аксессуара]--------------------
	if dialogId == 8510 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Автоввод текста в лавку]--------------------
	if dialogId == 3020 then
		if dialogs_lavka == 0 then
			sampSendDialogResponse(dialogId, 1, 0, "Продажа")
			return false
		else
			-- sampSendDialogResponse(dialogId, 1, 0, "Скуп")
			sampSendDialogResponse(dialogId, 1, 0, "Скуп")
			return false
		end
		dialogs_lavka = -1
	end
	if dialogId == 3030 then
		sampSendDialogResponse(dialogId, 1, 13, nil)
		return false
	end
	--------------------[Авторепорт]--------------------
	if dialogId == 32 and #message_report > 0 then
		sampSendDialogResponse(dialogId, 1, 0, message_report)
		message_report = ""
		--sampCloseCurrentDialogWithButton(0)
		return false
	end
	if dialogId == 1332 or dialogId == 1333 then
		sampSendDialogResponse(dialogId, 1, 0, nil)
		return false
	end
	--------------------[Продовоз]--------------------
	if dialogId == 2291 then
		sampSendDialogResponse(dialogId, 1, 0, "Купить")
		return false
	end
	----------------------------------------
	if dialogId == 430 then
		sampSendDialogResponse(dialogId, 1, 0, "2000")
		prods = 2000
		return false
	end
	----------------------------------------
	if dialogId == 8762 then
		if text:match('которое хотите продать бизнесу.') then
			bizz = string.match(text,'закупает {B7A51B}(%d+)')
			----------------------------------------
			biz = 0
			biz = biz+bizz
			----------------------------------------
			if biz >= prods then
				sampSendDialogResponse(dialogId, 2, 1, elements.config.prodovoz_edit.v)
				sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт продал в бизнес '..elements.config.prodovoz_edit.v..' продуктов. (1)', 0xFFFFFF)
				prods = prods-elements.config.prodovoz_edit.v
				return false
			else
				sampSendDialogResponse(dialogId, 2, 1, biz)
				sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт продал в бизнес '..biz..' продуктов. (2)', 0xFFFFFF)
				prods = prods-biz
				return false
			end
		end
	end
	--------------------[Новый автолут]--------------------
	if elements.state.autoloot == true then
		if dialogId == 8251 and elements.state.autoloot_number ~= 0 then
			sampSendDialogResponse(dialogId, 2, 1, autoloot_td[elements.state.autoloot_number])
			elements.state.autoloot_number = 0
			return false
		end
		if dialogId == 1966 then
			sampSendDialogResponse(dialogId, 1, 1, nil)
			return false
		end
	end
	--------------------[Анализ цен на ЦР]--------------------
	if dialogId == 15072 and title:find('Выберите список') then
		if analysis == 2 then
			sampSendDialogResponse(dialogId, 1, 1, nil)
			return false
		end
		----------------------------------------
		text = text .. '\n' .. '{00FF00}Проанализировать'
		return {dialogId, style, title, button1, button2, text}
	end
	----------------------------------------
	if analysis ~= nil and dialogId == 15073 then
		if last_text ~= nil and last_text == text then
			if analysis == 1 then
				analysis = 2
			else
				analysis = nil
				data_cr.last_update = os.time()
				sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Анализ завершён! Средние цены на товары обновлены!', 0xFFFFFF)
				----------------------------------------
				local file_open = io.open(path_cr, "w")
				file_open:write(encodeJson(data_cr))
				file_open:close()
			end
			sampSendDialogResponse(dialogId, 0, nil, nil)
			return false
		end
		----------------------------------------
		last_text = text
		if title:find('Средняя цена товаров при продаже') then
			parser(text, 1)
		elseif title:find('Средняя цена товаров при скупке') then
			parser(text, 2)
		end
		sampSendDialogResponse(dialogId, 1, 1, nil)
		return false
	elseif analysis ~= nil then
		analysis = nil
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Критическая ошибка! Анализ был сбит другим диалогом!', 0xFFFFFF)
		sampSendDialogResponse(dialogId, 0, nil, nil)
		return false
	end
	----------------------------------------
	if dialogId == 3082 then
		for line in text:gmatch('[^\n]+') do
			local item = line:match('.*{%x+}(.+){%x+}.*$')
			local temp = {}
			----------------------------------------
			if item == nil then
				text = text:gsub('Стоимость:[^\n]+', '%1\n{FF4040}Не удалось определить товар\n{FDDB6D}Средняя цена не может быть найдена!')
				--sampfuncsLog('Название не обнаружено: ' .. line)
				return { dialogId, style, title, button1, button2, text }
			end
			----------------------------------------
			for _, info in ipairs(title:find('Продажа предмета') and data_cr.buy or data_cr.sell) do
				if item:find(info['i'], 1, true) then
					temp[#temp + 1] = string.format('%s - {FFD900}%s', info['i'], sumFormat(tostring(info['p']))) 
				end
			end
			----------------------------------------
			if os.time() - data_cr.last_update <= 86400 then -- 1 day
				if #temp > 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средние цены' .. ':\n{67BE55}' .. table.concat(temp, '\n{67BE55}'))
				elseif #temp == 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена на ' .. temp[1])
				else
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена не найдена!\n{FFD900}Обнови списки на площади ЦР\n')
				end
			else
				local datetime = string.format(os.date('%d.%m.%Y', data_cr.last_update))
				if #temp > 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{FF3300}['..datetime..'] Средние цены' .. ':\n{67BE55}' .. table.concat(temp, '\n{67BE55}'))
				elseif #temp == 1 then
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{FF3300}['..datetime..'] Средняя цена на ' .. temp[1])
				else
					text = text:gsub('Стоимость:[^\n]+', '%1\n\n{67BE55}Средняя цена не найдена!\n{FFD900}Обнови списки на площади ЦР\n')
				end
			end
			break
		end
		return { dialogId, style, title, button1, button2, text }
	end
	--------------------[Авто-открытие рулеток]--------------------
	if dialogId == 722 and nodial then
		nodial = false
		return false
	end
	if elements.autoopenroul.open_roul_bronze.v == true or elements.autoopenroul.open_roul_silver.v == true or elements.autoopenroul.open_roul_gold.v == true or elements.autoopenroul.open_roul_platina.v == true then
		if dialogId == 9238 then
			elements.autoopenroul.open_roul_bronze.v = false
			elements.autoopenroul.open_roul_silver.v = false
			elements.autoopenroul.open_roul_gold.v = false
			elements.autoopenroul.open_roul_platina.v = false
			elements.autoopenroul.open_roul_active = true
			sampSendDialogResponse(dialogId, 0, nil, nil)
			sampSendClickTextdraw(65535)
			sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Рулетки закончились. Авто-открытие выключено.', 0xFFFFFF)
			return false
		end
	end
	--------------------[Отказ показа диалогов]--------------------
	if dialogId == 0 and
	((text:find("В этом месте запрещено") and text:find("Если вы продолжите, то вы будете кикнуты!")) or
	text:find("Перед тем как подтвердить сделку, советуем") or
	text:find("Приятной игры на arizona") or
	text:find("Вы успешно купили ") or
	text:find("PIN%-код принят")) then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	if dialogId == 0 and text:find("Аз Монет при пополнении счета на нашем сайте") then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Отказ показа диалогов Аренды транспорта]--------------------
	if dialogId == 281 or dialogId == 230 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
	--------------------[Отказ показа диалога при авторизации]--------------------
	if dialogId == 15330 or dialogId == 15375 then
		sampSendDialogResponse(dialogId, 1, nil, nil)
		return false
	end
end

function sampev.onSendDialogResponse(dialogId, button, listboxId, input)
	--------------------[Автоввод текста в лавку]--------------------
	if dialogId == 3021 then
		dialogs_lavka = listboxId
	end
	--------------------[Анализ цен на ЦР]--------------------
	if dialogId == 15072 and listboxId == 2 and button == 1 then
		analysis = 1
		last_text = nil
		data_cr = template
		sampAddChatMessage('[{FDDB6D}'..script_names..' '..thisScript().version..'{FFFFFF}] Запущен анализ цен. Не открывайте до завершения другие диалоги!', 0xFFFFFF)
		return { dialogId, button, 0, input }
	end
end

function string_to_lower(str) -- Анализ цен на ЦР
	for i = 192, 223 do
		str = str:gsub(_G.string.char(i), _G.string.char(i + 32))
	end
	str = str:gsub(_G.string.char(168), _G.string.char(184))
	return str:lower()
end

function parser(text, mode) -- Анализ цен на ЦР
	text = tostring(text)
	--sampfuncsLog(text)
	local current = 0
	for line in text:gmatch('[^\n]+') do
		current = current + 1
		if current > 3 then
			local item, price = line:match('^(.+)\t(.+)$')
			if item and price then
				if mode == 1 then
					table.insert(data_cr.sell, {i = item, p = price})
				else
					table.insert(data_cr.buy, {i = item, p = price})
				end
			end
		end
	end
end

function sumFormat(sum) -- Анализ цен на ЦР
	count = sum:match('%d+')
	if count and #count > 3 then
		local b, e = ('%d'):format(count):gsub('^%-', '')
		local c = b:reverse():gsub('%d%d%d', '%1.')
		local d = c:reverse():gsub('^%.', '')
		return sum:gsub(count, (e == 1 and '-' or '') .. d)
	end
	return sum
end

function sampev.onPlayerEnterVehicle(playerId, vehicleId, passenger)
	--------------------[Отключение анимаций посадки в транспорт]--------------------
	if elements.config.anim_car.v == true then
		local _, ped = sampGetCharHandleBySampPlayerId(playerId)
		if _ then
			local x1, y1, z1 = getCharCoordinates(PLAYER_PED)
			local x2, y2, z2 = getCharCoordinates(ped)
			if getDistanceBetweenCoords2d(x1, y1, x2, y2) < 10 then
				return false
			end
		end
	end
	----------------------------------------
end

function sampev.onSendCommand(cmd)
	local result_ = cmd:match('^/id (.+)')
	if result_ ~= nil then
		lua_thread.create(function()
			wait(700)
			sampSendChat('/number ' .. result_)
		end)
	end
	if elements.chat.removevipchat.v == false then
		local result = cmd:match('^/vr (.+)')
		if result ~= nil then
			process, finished = nil, false
			message = tostring(result)
			process = lua_thread.create(function()
				while not finished do
					if sampGetGamestate() ~= 3 or not sampIsLocalPlayerSpawned() then
						finished = true;
						break
					end
					if not sampIsChatInputActive() then
						local rotate = math.sin(os.clock() * 3) * 90 + 90
						local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
						local windowPosX = getStructElement(input, 0x8, 4)
						local windowPosY = getStructElement(input, 0xC, 4)
						renderDrawPolygon(windowPosX + 10, windowPosY + (renderGetFontDrawHeight(molot_10_9) / 2), 15, 15, 3, rotate, 0xFF0090FF)
						renderDrawPolygon(windowPosX + 10, windowPosY + (renderGetFontDrawHeight(molot_10_9) / 2), 15, 15, 3, -1 * rotate, 0xFFFDDB6D)
						renderFontDrawText(molot_10_9, tostring(message), windowPosX + 25, windowPosY, -1)
					end
					wait(0)
				end
			end)
		end
	end
end

function sampev.onPlayerChatBubble(playerId, color, distance, duration, message)
	if not sampIsPlayerPaused(playerId) and
		not message:find("%-%s*%d+%.%d+ хп") and
		not message:find(".+ взглянул%(a%) на часы$") and
		not message:find(".+ передаёт конверт с деньгами .+") and
		not message:find("^%* Закрывает организационный транспорт$") and
		not message:find("^%* Закрывает рабочий транспорт$") and
		not message:find("^%* Открывает организационный транспорт$") and
		not message:find("^%* Открывает рабочий транспорт$") and
		not message:find("^.+ достал%(а%) .+ из кармана$") and
		not message:find("^.+ показывает свой паспорт .+$") and
		not message:find("^.+ пытается завести двигатель$") and
		not message:find("^.+ сделал%(а%) себе оружие.$") and
		not message:find("^Взял%(а%) бочку!$") and
		not message:find("^Взял%(а%) дубинку$") and
		not message:find("^Взял%(а%) ящик$") and
		not message:find("^Включил%(а%) левый поворотник$") and
		not message:find("^Включил%(а%) печку$") and
		not message:find("^Включил%(а%) правый поворотник$") and
		not message:find("^Выкинул%(а%) мусор$") and
		not message:find("^Выключил%(а%) печку$") and
		not message:find("^Выпало: %d+$") and
		not message:find("^Выпало: %d+$") and
		not message:find("^Двигатель успешно завелся %| %-  .+ .$") and
		not message:find("^Достал%(а%) из багажника ящик с пиццой.$") and
		not message:find("^Достал%(а%) оружие из кармана$") and
		not message:find("^Заполняет документы$") and
		not message:find("^Звонит телефон$") and
		not message:find("^Открыл%(а%) дверь$") and
		not message:find("^Открыл%(а%) шлагбаум$") and
		not message:find("^Переоделся%(ась%)$") and
		not message:find("^Подобрал%(а%) оружие с земли") and
		not message:find("^Подобрал%(а%) что%-то с земли$") and
		not message:find("^Позвонил%(а%) в службу точного времени$") and
		not message:find("^Положил%(а%) ящик$") and
		not message:find("^Получил%(а%) сообщение$") and
		not message:find("^Поцеловал%(a%) .+$") and
		not message:find("^Продал%(а%) бочку!$") and
		not message:find("^Просит деньги$") and
		not message:find("^Пытается что%-то сказать.$") and
		not message:find("^Сильно кашляет$") and
		not message:find("^Смотрит телефонную книгу$") and
		not message:find("^Собирает сено$") and
		not message:find("^Собрал%(а%) мусор$") and
		not message:find("^Собрал%(а%) сено$") and
		not message:find("^Сообщение по рации$") and
		not message:find("^Украл%(а%) ингредиенты$") and
		not message:find("^бито$") and
		not message:find("^восстанавливает состояние %d+/%d+$") and
		not message:find("^закончил%(а%) работу$") and
		not message:find("^закрывает личный транспорт$") and
		not message:find("^затянул%(а%)$") and
		not message:find("^отбился%(а%) .+%[.+%]$") and
		not message:find("^отбился%(ась%) .+%[.+%]$") and
		not message:find("^открывает личный транспорт$") and
		not message:find("^подкинул%(а%) .+%[.+%]$") and
		not message:find("^показывает своё удостоверение$") and
		not message:find("^походил%(а%) .+%[.+%]$") and
		not message:find("Заглянул%(а%) в карман") and
		not message:find("Кушает {69B1E4}%( 5:00%+ %)") and
		not message:find("Отошел") and
		not message:find("Поймал%(а%) рыбу") and
		not message:find("Положил%(а%) ящик с пиццой в багажник мопеда") and
		not message:find("Сильно держит удочку") and
		not message:find("Смотрит на {FFFFFF}.*") and
		not message:find("Сообщение по домашней рации") and
		not message:find("Тянет рыбу!") and
		not message:find("Вышел на улицу") and
		not message:find("закидывает крючок и ловит рыбу") then
		----------------------------------------
		r, g, b, a = explode_argb(color)
		----------------------------------------
		table.insert(chatbuble, string.format("{%06X}"..os.date("[%H:%M:%S] (D: " .. distance .. ") ") .. sampGetPlayerNickname(playerId) .. "[" .. playerId .. "]: " .. message, join_rgb(r,g,b)))
		----------------------------------------
		if #chatbuble > elements.chat.distant_count.v then
			table.remove(chatbuble, 1)
		end
		----------------------------------------
	end
end

-- function sampev.onApplyPlayerAnimation(playerId, animLib, animName, frameDelta, loop, lockX, lockY, freeze, time)
	-- sampAddChatMessage(string.format('ApplyAnimation(playerid,"%s","%s",%0.1f,%s,%s,%s,%s,%d);',animLib, animName, frameDelta, loop, lockX, lockY, freeze, time),-1)
-- end

-- function sampev.onCreateGangZone(zoneId, squareStart, squareEnd, color)
	-- color_2 = string.format('0x%X', bit.band(0xFFFFFFFF, color))
	-- sampAddChatMessage(string.format('(0, %f, %f, %f, %f),',squareStart.x,squareStart.y,squareEnd.x,squareEnd.y), -1)
	
	-- local file = io.open('moonloader/gz.notepad', 'a+')
	-- if file ~= -1 and file ~= nil then
		-- file:write(string.format('(0, %f, %f, %f, %f),\n',squareStart.x,squareStart.y,squareEnd.x,squareEnd.y))
		-- io.close(file)
	-- end

-- end

-- function sampev.onGangZoneFlash(zoneId, color)
	-- color_2 = string.format('0x%X', bit.band(0xFFFFFFFF, color))
	-- sampAddChatMessage(string.format('%d | %s',zoneId,color_2), -1)
-- end

function sampev.onSetPlayerAttachedObject(playerId, index, create, object)
	if elements.config.del_stream.v == false and elements.config.del_stream_pl.v == false then
		model = object.modelId
		if playerId == elements.config.attach_id.v then
			sampAddChatMessage('С ID: '..playerId..' своровалась модификация. '..object.modelId..':'..getColor(object.color1)..':'..getColor(object.color2)..':'..object.color1..':'..object.color2,0xFF3300)
			SaveFileAttach(elements.config.attach_id.v,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
		end
		if sampGetPlayerNickname(playerId) == "Roy_Shelby" then
			sampAddChatMessage('С Roy_Shelby['..playerId..'] своровалась модификация. '..object.modelId..':'..getColor(object.color1)..':'..getColor(object.color2)..':'..object.color1..':'..object.color2,0xFF3300)
			SaveFileAttach(playerId,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
		end
		ip, port = sampGetCurrentServerAddress()
		if ip == "185.169.134.3" or ip == "185.169.134.4" or ip == "185.169.134.43" or ip == "185.169.134.44" or ip == "185.169.134.45" or ip == "185.169.134.5" or ip == "185.169.134.59" or ip == "185.169.134.61" or ip == "185.169.134.107" or ip == "185.169.134.109" or ip == "185.169.134.166" or ip == "185.169.134.171" or ip == "185.169.134.172" or ip == "185.169.134.173" or ip == "185.169.134.174" or ip == "80.66.82.191" or ip == "80.66.82.190" then
			----------------------------------------
			for model_id, name in pairs(model_name_anti_stealer) do
				if model_id == model then
					return
				end
			end
			----------------------------------------
			if model == 1247 then -- Звезды
				if object.rotation.y == -3.4999 and object.rotation.z == 28.2000 then return end
				if object.scale.x == 0.2579 and object.scale.y == 0.7160 and object.scale.z == 0.3470 then return end
			end
			----------------------------------------
			if model == 2405 or model == 2406 then -- Доска для серфа (сделано)
				model = 2404
				if object.bone == 1 then return end
			end
			----------------------------------------
			if model >= 18948 and model <= 18951 then -- Шляпы
				model = 18947
				if object.offset.x == 0.0729 then return end
			end
			----------------------------------------
			if model >= 18968 and model <= 18969 then -- Панамки
				model = 18967
				if object.offset.x == 0.0439 then return end
			end
			----------------------------------------
			if model >= 18977 and model <= 18979 then -- Мотошлемы
				model = 18645
				if object.bone == 1 then return end
				if object.offset.x == 0.0610 then return end
			end
			----------------------------------------
			if model == 328 then return false end -- Розовый оружейный кейс
			if model == 363 and object.bone == 7 then return end -- Бомба на пояс
			if model == 1210 then return false end -- Коричневый кейс
			if model == 1276 and object.offset.x == 0 then return false end -- Свечение игрока
			if model == 2918 and object.bone == 2 then return end -- Рюкзак с шипами с модификации Костюм для хэллоуина
			if model == 3524 and (object.scale.x == 0.2029 or object.scale.y == 0.2229 or object.scale.z == 0.1889) then return end -- Левая горящая голова и Правая горящая голова
			if model == 3528 then return false end -- Дракон
			if model == 11745 then return false end -- Сумка для ноутбука (сделано)
			if model == 18868 and object.bone == 6 then return end -- Телефон
			if model == 18890 and object.bone == 6 then return end -- Грабли в руку
			if model == 18954 then model = 18953 end -- Шапки
			if model == 18965 or model == 18966 then model = 18964 end -- Бандитская шапка
			if model == 19037 or model == 19038 then model = 19036 end -- Хоккейная маска
			if model == 19064 and (object.bone == 1 or object.bone == 3 or object.bone == 4) then return end -- Плащ деда мороза, Наручи на плечи
			if model == 19065 or model == 19066 then model = 19064 end -- Новогодняя шапка
			if model == 19076 then return false end -- Ёлочка на плечо
			if model == 19094 and (object.offset.x == 0.0099 or object.offset.y == 0.0590 or object.offset.z == -0.0030) then return end -- Бургер на рту
			if model == 19160 or model == 19161 or model == 19162 then model = 19093 end -- Кепки DUDE & Police
			if model == 19317 and object.bone == 2 then return end -- Гитара на глазу
			if model == 19318 or model == 19319 then model = 19317 end -- Гитары
			if model == 19421 and object.bone == 2 then return end -- Наушники на голову
			if model == 19487 then model = 19352 end -- Конусы
			if model == 19514 then model = 19141 end -- Каски спецназа
			if model == 19515 then model = 19142 end -- Бронежилет
			if model == 19521 then model = 19520 end -- Фуражка офицера
			if model == 19557 and object.bone == 1 then return end -- Крылья
			if model == 19581 and object.bone == 14 then return end -- Сковородка в руку
			if model == 19631 and (object.bone == 6 or object.rotation.y == -31.8000) then return end -- Кирка в руку и молот на спину
			if model == 19847 and object.bone == 5 then return end -- Мясо в руку
			if model == 19921 then return false end -- Красный чемодан (сделано)
			if model >= 18892 and model <= 18905 then model = 18891 end -- Бандана
			if model >= 18907 and model <= 18910 then model = 18906 end -- Банданы на голову
			if model >= 18912 and model <= 18920 then model = 18911 end -- Банданы
			if model >= 18922 and model <= 18925 then model = 18921 end -- Береты
			if model >= 18927 and model <= 18935 then model = 18926 end -- Кепка передняя
			if model >= 18956 and model <= 18959 then model = 18955 end -- Кепка обратная
			if model >= 18971 and model <= 18973 then model = 18970 end -- Шляпы
			if model >= 19007 and model <= 19035 then model = 19006 end -- Очки
			if model >= 19040 and model <= 19053 then model = 19039 end -- Часы
			if model >= 19068 and model <= 19069 then model = 19067 end -- Шапки
			if model >= 19096 and model <= 19100 then model = 19095 end -- Ковбойская шляпа
			if model >= 19102 and model <= 19120 then model = 19101 end -- Каски
			if model >= 19422 and model <= 19424 then model = 19421 end -- Наушники
			model_name_2 = ''
			for model_id, name in pairs(model_name) do
				if model_id == model then
					model_name_2 = name
				end
			end
			----------------------------------------
			object_name = string.format('%d - %s',model,model_name_2)
			----------------------------------------
			local file = io.open('moonloader/stealer/'..object_name..'.notepad', 'a+')
			if file ~= -1 and file ~= nil then
				----------------------------------------
				_, id = sampGetPlayerIdByCharHandle(PLAYER_PED)
				skin = -1
				----------------------------------------
				if playerId == id then
					skin = getCharModel(PLAYER_PED)
				else
					lua_thread.create(function()
						result, ped = sampGetCharHandleBySampPlayerId(playerId)
						if result then
							skin = getCharModel(ped)
						end
						if not doesCharExist(ped) then
							return
						end
						--sampfuncsLog('----------------------------------------')
						--sampfuncsLog(string.format('result: %s',result))
						--sampfuncsLog('ped: '..ped)
						--sampfuncsLog('skin: '..skin)
						--sampfuncsLog('playerId: '..playerId)
						--sampfuncsLog('----------------------------------------')
					end)
				end
				if skin ~= -1 then
					code_temp_2 = ""
					code_temp_2 = string.format('case %d: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',skin,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
					if string.find(file:read("*all"), code_temp_2, 1, true) then
						--sampfuncsLog('{FF3300}<Копия> '..code_temp_2)
						io.close(file)
						return
					end
					sampfuncsLog('{33AA33}<Добавлено> '..code_temp_2)
					-- table.insert(chatMessages, '{33AA33}<Добавлено> '..code_temp_2)
					SaveFileAttach(skin,model,object.bone,object.offset.x,object.offset.y,object.offset.z,object.rotation.x,object.rotation.y,object.rotation.z,object.scale.x,object.scale.y,object.scale.z)
					io.close(file)
				end
			end
		end
	end
end

function SaveFileAttach(skin,modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ)
	if skin == elements.config.attach_id.v then
		local file = io.open('moonloader/stealer/mod_'..elements.config.attach_id.v..'.notepad', 'a+')
		if file ~= -1 and file ~= nil then
			file:write(string.format('SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			io.close(file)
		end
		return
	end
	----------------------------------------
	model_name_2 = ''
	for model_id, name in pairs(model_name) do
		if model_id == modelId then
			model_name_2 = name
		end
	end
	----------------------------------------
	object_name = string.format('%d - %s',modelId,model_name_2)
	----------------------------------------
	local file = io.open('moonloader/stealer/'..object_name..'.notepad', 'a+')
	if file ~= -1 and file ~= nil then
		if skin == 0 or skin == 74 then
			file:write(string.format('case 0: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 74: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 13 or skin == 65 then
			file:write(string.format('case 13: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 65: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 36 or skin == 37 then
			file:write(string.format('case 36: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 37: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 51 or skin == 52 then
			file:write(string.format('case 51: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 52: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 66 or skin == 67 then
			file:write(string.format('case 66: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 67: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 80 or skin == 81 then
			file:write(string.format('case 80: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 81: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 82 or skin == 83 or skin == 84 then
			file:write(string.format('case 82: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 83: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 84: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 78 or skin == 239 then
			file:write(string.format('case 78: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 239: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 117 or skin == 118 then
			file:write(string.format('case 117: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 118: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 203 or skin == 204 then
			file:write(string.format('case 203: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 204: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 224 or skin == 225 then
			file:write(string.format('case 224: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 225: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 247 or skin == 254 then
			file:write(string.format('case 247: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 254: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 274 or skin == 275  or skin == 276 then
			file:write(string.format('case 274: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 275: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 276: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 277 or skin == 278 or skin == 279 then
			file:write(string.format('case 277: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 278: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 279: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 280 or skin == 300 then
			file:write(string.format('case 280: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 300: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 281 or skin == 301 then
			file:write(string.format('case 281: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 301: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 282 or skin == 302 then
			file:write(string.format('case 282: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 302: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 283 or skin == 288 then
			file:write(string.format('case 283: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 288: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 303 or skin == 304 then
			file:write(string.format('case 303: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 304: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 306 or skin == 308 or skin == 309 then
			file:write(string.format('case 306: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 308: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 309: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		elseif skin == 310 or skin == 311 then
			file:write(string.format('case 310: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
			file:write(string.format('case 311: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		else
			file:write(string.format('case %d: SetPlayerAttachedObject(playerid, slot, %d, %d, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, %0.4f, -1, -1);\n',skin,modelId,bone,offsetX,offsetY,offsetZ,rotationX,rotationY,rotationZ,scaleX,scaleY,scaleZ))
		end
		io.close(file)
	end
end

function cleanStreamMemoryBuffer() -- Очистка памяти
-- адреса памяти можно взять тут https://github.com/DK22Pac/plugin-sdk/blob/master/plugin_sa/game_sa/CGame.cpp
	local clear1 = callFunction(0x53C500, 2, 2, true, true)
	local clear2 = callFunction(0x53C810, 1, 1, true)
	local clear3 = callFunction(0x40CF80, 0, 0)
	local clear4 = callFunction(0x4090A0, 0, 0)
	local clear5 = callFunction(0x5A18B0, 0, 0)
	local clear6 = callFunction(0x707770, 0, 0)
	local clear7 = callFunction(0x53BED0, 0, 0)
	local clear8 = callFunction(0x53C440, 0, 0)
	local clear9 = callFunction(0x53C4A0, 0, 0)
	local clear10 = callFunction(0x53C240, 0, 0)
	local clear11 = callFunction(0x409760, 0, 0)
	local clear12 = callFunction(0x409210, 0, 0)
	local clear13 = callFunction(0x40D7C0, 1, 1, -1)
	local clear14 = callFunction(0x40E4E0, 0, 0)
	local clear15 = callFunction(0x70C950, 0, 0)
	local clear16 = callFunction(0x408CB0, 0, 0)
	local clear17 = callFunction(0x40E460, 0, 0)
	local clear18 = callFunction(0x407A10, 0, 0)
	local clear19 = callFunction(0x40B3A0, 0, 0)
	local clear20 = callFunction(0x5BA060, 0, 0)
	memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
	memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
	local pX, pY, pZ = getCharCoordinates(PLAYER_PED)
	requestCollision(pX, pY)
	loadScene(pX, pY, pZ)
end

function inventory(var) -- Авто-точилка аксессуаров
	lua_thread.create(function()
		if var == 1 then
			sampSendClickTextdraw(2093)
			wait(500)
			sampSendClickTextdraw(2092)
		elseif var == 2 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2093)
		elseif var == 3 then
			sampSendClickTextdraw(2092)
			wait(500)
			sampSendClickTextdraw(2094)
		end
	end)
end

function number_separator(n) -- Калькулятор
	local left, num, right = string.match(n,'^([^%d]*%d)(%d*)(.-)$')
	return left..(num:reverse():gsub('(%d%d%d)','%1 '):reverse())..right
end

function auto_roul(respond) -- Авто-открытие рулеток
	lua_thread.create(function( ... )
		nodial = true
		sampSendChat('/mn')
		wait(222)
		sampSendDialogResponse(722, 1, 7, nil)
	end)
end

function onScriptTerminate(LuaScript, quitGame)
	if LuaScript == thisScript() then
		showCursor(false)
		sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Скрипт выключается =(', 0xFFFFFF)
	end
end

function rgbToHex(rgb)
	slot1 = "0xFF"
	for _, slot6 in pairs(rgb) do
		slot7 = ""
		while slot6 > 0 do
			slot8 = math.fmod(slot6, 16) + 1
			slot6 = math.floor(slot6 / 16)
			slot7 = string.sub("0123456789ABCDEF", slot8, slot8) .. slot7
		end

		if string.len(slot7) == 0 then
			slot7 = "00"
		elseif string.len(slot7) == 1 then
			slot7 = "0" .. slot7
		end
		slot1 = slot1 .. slot7
	end
	return slot1
end

function getColor(color)
	a, r, g, b = explode_argb(color)
	slot1 = 
	{
		r,
		g,
		b
	}
	rgb = slot1
	return rgbToHex(rgb)
end

function explode_argb(color)
	return bit.band(bit.rshift(color, 24), 255), bit.band(bit.rshift(color, 16), 255), bit.band(bit.rshift(color, 8), 255), bit.band(color, 255)
end

function join_rgb(r, g, b)
	return bit.bor(bit.bor(b, bit.lshift(g, 8)), bit.lshift(r, 16))
end

function join_argb(a, r, g, b)
	local argb = b
	argb = bit.bor(argb, bit.lshift(g, 8))
	argb = bit.bor(argb, bit.lshift(r, 16))
	argb = bit.bor(argb, bit.lshift(a, 24))
	return argb
end

function argb_to_rgba(argb)
	local a, r, g, b = explode_argb(argb)
	return join_argb(r, g, b, a)
end

local list = {}
function list:new()
	return
	{
		pos =
		{
			x = select(1,getScreenResolution()) - 222,
			y = select(2,getScreenResolution()) - 65
		},
		size =
		{
			x = 200,
			y = 0
		}
	}
end
notfList = list:new()

function onRenderNotification()
	local count = 0
	for k, v in ipairs(_message) do
		local push = false
		if v.active and v.time < os.clock() then
			v.active = false
			table.remove(_message, k)
		end
		if count < 10 then
			if not v.active then
				if v.showtime > 0 then
					v.active = true
					v.time = os.clock() + v.showtime
					v.showtime = 0
				end
			end
			if v.active then
				count = count + 1
				if v.time + 3.000 >= os.clock() then
					imgui.PushStyleVar(imgui.StyleVar.Alpha, (v.time - os.clock()) / 0.3)
					push = true
				end
				local nText = u8(tostring(v.text))
				notfList.size = imgui.GetFont():CalcTextSizeA(imgui.GetFont().FontSize, 200.0, 196.0, nText)
				notfList.pos = imgui.ImVec2(notfList.pos.x, (notfList.pos.y - (count == 1 and notfList.size.y or (notfList.size.y + 40))))
				imgui.SetNextWindowPos(notfList.pos, _, imgui.ImVec2(0.0, 0.0))
				imgui.SetNextWindowSize(imgui.ImVec2(200, notfList.size.y + imgui.GetStyle().ItemSpacing.y + imgui.GetStyle().WindowPadding.y+25))
				imgui.Begin(u8'##msg' .. k, _, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize + imgui.WindowFlags.NoScrollbar + imgui.WindowFlags.NoMove + imgui.WindowFlags.NoTitleBar)
				imgui.CenterText(script_names)
				imgui.Separator()
				--imgui.TextWrapped(nText)
				imgui.TextUnformatted(nText)
				imgui.End()
				if push then
					imgui.PopStyleVar()
				end
			end
		end
	end
	notfList = list:new()
end

function imgui.TextQuestion(text)
	imgui.TextDisabled(u8'(?)')
	if imgui.IsItemHovered() then
		imgui.BeginTooltip()
		imgui.PushTextWrapPos(450)
		imgui.TextUnformatted(text)
		imgui.PopTextWrapPos()
		imgui.EndTooltip()
	end
end

function imgui.CenterText(text) 
	local width = imgui.GetWindowWidth()
	local calc = imgui.CalcTextSize(text)
	imgui.SetCursorPosX(width / 2 - calc.x / 2)
	imgui.Text(text)
end

function imgui.TextColoredRGB(text)
	local width = imgui.GetWindowWidth()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local ImVec4 = imgui.ImVec4

	local getcolor = function(color)
		if color:sub(1, 6):upper() == 'SSSSSS' then
			local r, g, b = colors[1].x, colors[1].y, colors[1].z
			local a = tonumber(color:sub(7, 8), 16) or colors[1].w * 255
			return ImVec4(r, g, b, a / 255)
		end
		local color = type(color) == 'string' and tonumber(color, 16) or color
		if type(color) ~= 'number' then return end
		local r, g, b, a = explode_argb(color)
		return imgui.ImColor(r, g, b, a):GetVec4()
	end

	local render_text = function(text_)
		for w in text_:gmatch('[^\r\n]+') do
			local textsize = w:gsub('{.-}', '')
			local text_width = imgui.CalcTextSize((textsize))
			local text, colors_, m = {}, {}, 1
			w = w:gsub('{(......)}', '{%1FF}')
			while w:find('{........}') do
				local n, k = w:find('{........}')
				local color = getcolor(w:sub(n + 1, k - 1))
				if color then
					text[#text], text[#text + 1] = w:sub(m, n - 1), w:sub(k + 1, #w)
					colors_[#colors_ + 1] = color
					m = n
				end
				w = w:sub(1, n - 1) .. w:sub(k + 1, #w)
			end
			if text[0] then
				for i = 0, #text do
					imgui.TextColored(colors_[i] or colors[1], (text[i]))
					imgui.SameLine(nil, 0)
				end
				imgui.NewLine()
			else
				imgui.Text((w))
			end
		end
	end
	render_text(text)
end

function imgui.CenterTextColored(text) 
	local text2 = text:gsub('{(......)}','') 
	local width = imgui.GetWindowWidth()
	local calc = imgui.CalcTextSize(text2)
	imgui.SetCursorPosX(width / 2 - calc.x / 2)
	imgui.TextColoredRGB(text)
end

function imgui.CenterWindowText(text,typetext)
	typetext = typetext or imgui.Text
	local windSZ = imgui.GetWindowSize()
	if typetext == imgui.TextColoredRGB then
		local imguiRenderText = text
		text = text:gsub('{(......)}','')
		local txtSZ = imgui.CalcTextSize(text)
		imgui.SetCursorPos(imgui.ImVec2(windSZ.x/2 - txtSZ.x / 2,windSZ.y/2 - txtSZ.y / 2))
		typetext(imguiRenderText)
	else
		local txtSZ = imgui.CalcTextSize(text)
		imgui.SetCursorPos(imgui.ImVec2(windSZ.x/2 - txtSZ.x / 2,windSZ.y/2 - txtSZ.y / 2))
		typetext(text)
	end
end

function onWindowMessage(msg, wparam, lparam)
	if msg == 261 and wparam == 13 then consumeWindowMessage(true, true) end
	if msg == 0x100 or msg == 0x101 then
		if (wparam == 0x1B and windowstate.v) and not isPauseMenuActive() then
			consumeWindowMessage(true, false)
			if msg == 0x101 then
				windowstate.v = false
			end
		end
	end
end

local ffi = require("ffi")
ffi.cdef[[
	short GetKeyState(int nVirtKey);
	bool GetKeyboardLayoutNameA(char* pwszKLID);
	int GetLocaleInfoA(int Locale, int LCType, char* lpLCData, int cchData);
]]
local BuffSize = 32
local KeyboardLayoutName = ffi.new("char[?]", BuffSize)
local LocalInfo = ffi.new("char[?]", BuffSize)
chars =
{
	["й"] = "q", ["ц"] = "w", ["у"] = "e", ["к"] = "r", ["е"] = "t", ["н"] = "y", ["г"] = "u", ["ш"] = "i", ["щ"] = "o", ["з"] = "p", ["х"] = "[", ["ъ"] = "]", ["ф"] = "a",
	["ы"] = "s", ["в"] = "d", ["а"] = "f", ["п"] = "g", ["р"] = "h", ["о"] = "j", ["л"] = "k", ["д"] = "l", ["ж"] = ";", ["э"] = "'", ["я"] = "z", ["ч"] = "x", ["с"] = "c",
	["м"] = "v", ["и"] = "b", ["т"] = "n", ["ь"] = "m", ["б"] = ",", ["ю"] = ".", ["Й"] = "Q", ["Ц"] = "W", ["У"] = "E", ["К"] = "R", ["Е"] = "T", ["Н"] = "Y", ["Г"] = "U",
	["Ш"] = "I", ["Щ"] = "O", ["З"] = "P", ["Х"] = "{", ["Ъ"] = "}", ["Ф"] = "A", ["Ы"] = "S", ["В"] = "D", ["А"] = "F", ["П"] = "G", ["Р"] = "H", ["О"] = "J", ["Л"] = "K",
	["Д"] = "L", ["Ж"] = ":", ["Э"] = "\"", ["Я"] = "Z", ["Ч"] = "X", ["С"] = "C", ["М"] = "V", ["И"] = "B", ["Т"] = "N", ["Ь"] = "M", ["Б"] = "<", ["Ю"] = ">"
}

function getStrByState(keyState)
	if keyState == 0 then
		return "{33AA33}Выкл.{FFFFFF}"
	end
	return "{FF3300}Вкл.{FFFFFF}"
end

function showInputHelp()
	if sampIsChatInputActive() == true then
		local input = getStructElement(sampGetInputInfoPtr(), 0x8, 4)
		local windowPosX = getStructElement(input, 0x8, 4)
		local windowPosY = getStructElement(input, 0xC, 4)
		----------------------------------------
		fib = windowPosY + 41
		fib2 = windowPosX + 10
		----------------------------------------
		local _, playerid = sampGetPlayerIdByCharHandle(PLAYER_PED)
		local color = sampGetPlayerColor(playerid)
		local name = sampGetPlayerNickname(playerid)
		local ping = sampGetPlayerPing(playerid)
		local score = sampGetPlayerScore(playerid)
		local capsState = ffi.C.GetKeyState(20)
		local success = ffi.C.GetKeyboardLayoutNameA(KeyboardLayoutName)
		local errorCode = ffi.C.GetLocaleInfoA(tonumber(ffi.string(KeyboardLayoutName), 16), 0x00000002, LocalInfo, BuffSize)
		local localName = ffi.string(LocalInfo)		
		----------------------------------------
		local text = string.format(
			"%s - {%0.6x}%s[%d]{FFFFFF} - Пинг: %d - Уровень: %d - Капс: %s - Язык: {33AA33}%s",
			os.date("%H:%M:%S"),
			bit.band(color,0xffffff),
			name,
			playerid,
			ping,
			score,
			getStrByState(capsState),
			string.match(localName, "([^%(]*)")
		)
		renderFontDrawText(molot_10_9, text, fib2, fib, 0xD7FFFFFF)
		----------------------------------------
	end
end

function autoupdate(json_url, prefix, url)
	sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Проверка обновлений...', 0xFFFFFF)
	local dlstatus = require('moonloader').download_status
	local json = getWorkingDirectory() .. '\\'..script_names..'-version.json'
	if doesFileExist(json) then os.remove(json) end
	downloadUrlToFile(json_url, json,
		function(id, status, p1, p2)
			if status == dlstatus.STATUSEX_ENDDOWNLOAD then
				if doesFileExist(json) then
					local file = io.open(json, 'r')
					if file then
						local info = decodeJson(file:read('*a'))
						updatelink = info.updateurl
						updateversion = info.latest
						file:close()
						os.remove(json)
						if updateversion > thisScript().version then
							lua_thread.create(function(prefix)
								local dlstatus = require('moonloader').download_status
								sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Доступно новое обновление! Пытаюсь обновиться c '..thisScript().version..' на '..updateversion, 0xFFFFFF)
								wait(250)
								downloadUrlToFile(updatelink, thisScript().path,
									function(id3, status1, p13, p23)
										if status1 == dlstatus.STATUS_DOWNLOADINGDATA then
										elseif status1 == dlstatus.STATUS_ENDDOWNLOADDATA then
											sampAddChatMessage('['..thisScript().name..'{FFFFFF}] Мы успешно обновились до версии '..updateversion..'.', 0xFFFFFF)
											goupdatestatus = true
											lua_thread.create(function()
												wait(500)
												thisScript():reload()
											end)
										end
										if status1 == dlstatus.STATUSEX_ENDDOWNLOAD then
											if goupdatestatus == nil then
												sampAddChatMessage('['..thisScript().name..'{FFFFFF}] К сожалению не удалось обновить скрипт.', 0xFFFFFF)
												update = false
											end
										end
									end
								)
								end, prefix
							)
						else
							sampAddChatMessage('['..thisScript().name..' '..thisScript().version..'{FFFFFF}] Обновлений не найдено.', 0xFFFFFF)
							update = false
						end
					end
				else
					update = false
				end
			end
		end
	)
	while
		update ~= false
	do
		wait(100)
	end
end

function theme()
	imgui.SwitchContext()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local clr = imgui.Col
	local ImVec4 = imgui.ImVec4
	local ImVec2 = imgui.ImVec2

	style.WindowPadding = imgui.ImVec2(8, 8)
	style.WindowRounding = 6
	style.ChildWindowRounding = 5
	style.FramePadding = imgui.ImVec2(5, 3)
	style.FrameRounding = 3.0
	style.ItemSpacing = imgui.ImVec2(5, 4)
	style.ItemInnerSpacing = imgui.ImVec2(4, 4)
	style.IndentSpacing = 21
	style.ScrollbarSize = 10.0
	style.ScrollbarRounding = 13
	style.GrabMinSize = 8
	style.GrabRounding = 1
	style.WindowTitleAlign = imgui.ImVec2(0.5, 0.5)
	style.ButtonTextAlign = imgui.ImVec2(0.5, 0.5)

	colors[clr.Text]					= ImVec4(0.95, 0.96, 0.98, 1.00);
	colors[clr.TextDisabled]			= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.WindowBg]				= ImVec4(0.14, 0.14, 0.14, 0.95);
	colors[clr.ChildWindowBg]			= ImVec4(0.17, 0.17, 0.17, 1.00);
	colors[clr.PopupBg]					= ImVec4(0.08, 0.08, 0.08, 0.94);
	colors[clr.Border]					= ImVec4(0.14, 0.14, 0.14, 1.00);
	colors[clr.BorderShadow]			= ImVec4(1.00, 1.00, 1.00, 0.10);
	colors[clr.FrameBg]					= ImVec4(0.22, 0.22, 0.22, 1.00);
	colors[clr.FrameBgHovered]			= ImVec4(0.18, 0.18, 0.18, 1.00);
	colors[clr.FrameBgActive]			= ImVec4(0.10, 0.10, 0.10, 1.00);
	colors[clr.TitleBg]					= ImVec4(0.14, 0.14, 0.14, 0.81);
	colors[clr.TitleBgActive]			= ImVec4(0.12, 0.12, 0.12, 1.00);
	colors[clr.TitleBgCollapsed]		= ImVec4(0.00, 0.00, 0.00, 0.51);
	colors[clr.MenuBarBg]				= ImVec4(0.20, 0.20, 0.20, 1.00);
	colors[clr.ScrollbarBg]				= ImVec4(0.02, 0.02, 0.02, 0.39);
	colors[clr.ScrollbarGrab]			= ImVec4(0.36, 0.36, 0.36, 1.00);
	colors[clr.ScrollbarGrabHovered]	= ImVec4(0.18, 0.22, 0.25, 1.00);
	colors[clr.ScrollbarGrabActive]		= ImVec4(0.24, 0.24, 0.24, 1.00);
	colors[clr.ComboBg]					= ImVec4(0.24, 0.24, 0.24, 1.00);
	colors[clr.CheckMark]				= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.SliderGrab]				= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.SliderGrabActive]		= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.Button]					= ImVec4(0.22, 0.22, 0.22, 1.00);
	colors[clr.ButtonHovered]			= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.ButtonActive]			= ImVec4(1.00, 0.21, 0.21, 1.00);
	colors[clr.Header]					= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.HeaderHovered]			= ImVec4(1.00, 0.39, 0.39, 1.00);
	colors[clr.HeaderActive]			= ImVec4(1.00, 0.21, 0.21, 1.00);
	colors[clr.ResizeGrip]				= ImVec4(1.00, 0.28, 0.28, 1.00);
	colors[clr.ResizeGripHovered]		= ImVec4(1.00, 0.39, 0.39, 1.00);
	colors[clr.ResizeGripActive]		= ImVec4(1.00, 0.19, 0.19, 1.00);
	colors[clr.CloseButton]				= ImVec4(0.40, 0.39, 0.38, 0.16);
	colors[clr.CloseButtonHovered]		= ImVec4(0.40, 0.39, 0.38, 0.39);
	colors[clr.CloseButtonActive]		= ImVec4(0.40, 0.39, 0.38, 1.00);
	colors[clr.PlotLines]				= ImVec4(0.61, 0.61, 0.61, 1.00);
	colors[clr.PlotLinesHovered]		= ImVec4(1.00, 0.43, 0.35, 1.00);
	colors[clr.PlotHistogram]			= ImVec4(1.00, 0.21, 0.21, 1.00);
	colors[clr.PlotHistogramHovered]	= ImVec4(1.00, 0.18, 0.18, 1.00);
	colors[clr.TextSelectedBg]			= ImVec4(1.00, 0.32, 0.32, 1.00);
	colors[clr.ModalWindowDarkening]	= ImVec4(0.26, 0.26, 0.26, 0.60);
end
theme()

function patch()
	if memory.getuint8(0x748C2B) == 0xE8 then
		memory.fill(0x748C2B, 0x90, 5, true)
	elseif memory.getuint8(0x748C7B) == 0xE8 then
		memory.fill(0x748C7B, 0x90, 5, true)
	end
	if memory.getuint8(0x5909AA) == 0xBE then
		memory.write(0x5909AB, 1, 1, true)
	end
	if memory.getuint8(0x590A1D) == 0xBE then
		memory.write(0x590A1D, 0xE9, 1, true)
		memory.write(0x590A1E, 0x8D, 4, true)
	end
	if memory.getuint8(0x748C6B) == 0xC6 then
		memory.fill(0x748C6B, 0x90, 7, true)
	elseif memory.getuint8(0x748CBB) == 0xC6 then
		memory.fill(0x748CBB, 0x90, 7, true)
	end
	if memory.getuint8(0x590AF0) == 0xA1 then
		memory.write(0x590AF0, 0xE9, 1, true)
		memory.write(0x590AF1, 0x140, 4, true)
	end
end
patch()